*** packages/mudlark/src/arena.rs:112:26: replace / with * in Arena<T>::is_occupied

*** mutation diff:
--- packages/mudlark/src/arena.rs
+++ replace / with * in Arena<T>::is_occupied
@@ -104,17 +104,17 @@
         debug_assert!(self.is_occupied(index), "Arena::get_mut: slot {index} is not occupied");
         &mut self.slots[index]
     }
 
     /// Whether the slot at `index` is currently occupied.
     #[must_use]
     #[inline]
     pub fn is_occupied(&self, index: usize) -> bool {
-        let word = index / 64;
+        let word = index * /* ~ changed by cargo-mutants ~ */ 64;
         let bit = index % 64;
         word < self.occupied.len() && (self.occupied[word] & (1u64 << bit)) != 0
     }
 
     /// Iterate over all occupied `(index, &T)` pairs.
     ///
     /// Useful for invariant checking and diagnostics. The iteration
     /// order is by slot index (ascending), not insertion order.

---- tests::arena::bitset_grows_correctly stdout ----

thread 'tests::arena::bitset_grows_correctly' (1039031) panicked at packages/mudlark/src/tests/arena.rs:65:5:
assertion failed: arena.is_occupied(64)

---- tests::arena::dealloc_and_reuse stdout ----

thread 'tests::arena::dealloc_and_reuse' (1039032) panicked at packages/mudlark/src/tests/arena.rs:25:5:
assertion failed: arena.is_occupied(b)

---- tests::arena::multiple_alloc_dealloc_cycles stdout ----

thread 'tests::arena::multiple_alloc_dealloc_cycles' (1039034) panicked at packages/mudlark/src/arena.rs:77:9:
Arena::dealloc: slot 2 is not occupied

failures:
    tests::arena::bitset_grows_correctly
    tests::arena::dealloc_and_reuse
    tests::arena::multiple_alloc_dealloc_cycles
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation

test result: FAILED. 182 passed; 164 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
