*** packages/mudlark/src/arena.rs:113:25: replace % with + in Arena<T>::is_occupied

*** mutation diff:
--- packages/mudlark/src/arena.rs
+++ replace % with + in Arena<T>::is_occupied
@@ -105,17 +105,17 @@
         &mut self.slots[index]
     }
 
     /// Whether the slot at `index` is currently occupied.
     #[must_use]
     #[inline]
     pub fn is_occupied(&self, index: usize) -> bool {
         let word = index / 64;
-        let bit = index % 64;
+        let bit = index + /* ~ changed by cargo-mutants ~ */ 64;
         word < self.occupied.len() && (self.occupied[word] & (1u64 << bit)) != 0
     }
 
     /// Iterate over all occupied `(index, &T)` pairs.
     ///
     /// Useful for invariant checking and diagnostics. The iteration
     /// order is by slot index (ascending), not insertion order.
     pub fn iter_occupied(&self) -> impl Iterator<Item = (usize, &T)> + '_ {

---- tests::arena::alloc_and_get stdout ----

thread 'tests::arena::alloc_and_get' (1044657) panicked at packages/mudlark/src/arena.rs:114:62:
attempt to shift left with overflow

---- tests::arena::get_stale_handle_panics_in_debug stdout ----

thread 'tests::arena::get_stale_handle_panics_in_debug' (1044660) panicked at packages/mudlark/src/arena.rs:114:62:
attempt to shift left with overflow
note: panic did not contain expected string
      panic message: "attempt to shift left with overflow"
 expected substring: "not occupied"

---- tests::arena::multiple_alloc_dealloc_cycles stdout ----

thread 'tests::arena::multiple_alloc_dealloc_cycles' (1044661) panicked at packages/mudlark/src/arena.rs:114:62:
attempt to shift left with overflow

failures:
    tests::arena::alloc_and_get
    tests::arena::bitset_grows_correctly
    tests::arena::dealloc_and_reuse
    tests::arena::get_stale_handle_panics_in_debug
    tests::arena::multiple_alloc_dealloc_cycles
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants

test result: FAILED. 148 passed; 198 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
