*** packages/mudlark/src/arena.rs:114:14: replace < with <= in Arena<T>::is_occupied

*** mutation diff:
--- packages/mudlark/src/arena.rs
+++ replace < with <= in Arena<T>::is_occupied
@@ -106,17 +106,17 @@
     }
 
     /// Whether the slot at `index` is currently occupied.
     #[must_use]
     #[inline]
     pub fn is_occupied(&self, index: usize) -> bool {
         let word = index / 64;
         let bit = index % 64;
-        word < self.occupied.len() && (self.occupied[word] & (1u64 << bit)) != 0
+        word <= /* ~ changed by cargo-mutants ~ */ self.occupied.len() && (self.occupied[word] & (1u64 << bit)) != 0
     }
 
     /// Iterate over all occupied `(index, &T)` pairs.
     ///
     /// Useful for invariant checking and diagnostics. The iteration
     /// order is by slot index (ascending), not insertion order.
     pub fn iter_occupied(&self) -> impl Iterator<Item = (usize, &T)> + '_ {
         (0..self.slots.len())

---- tests::diagnostic::gn_display_dead_node stdout ----

thread 'tests::diagnostic::gn_display_dead_node' (1060460) panicked at packages/mudlark/src/arena.rs:114:89:
index out of bounds: the len is 1 but the index is 1

failures:
    tests::diagnostic::gn_display_dead_node

test result: FAILED. 345 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
