*** packages/mudlark/src/arena.rs:114:36: replace && with || in Arena<T>::is_occupied

*** mutation diff:
--- packages/mudlark/src/arena.rs
+++ replace && with || in Arena<T>::is_occupied
@@ -106,17 +106,17 @@
     }
 
     /// Whether the slot at `index` is currently occupied.
     #[must_use]
     #[inline]
     pub fn is_occupied(&self, index: usize) -> bool {
         let word = index / 64;
         let bit = index % 64;
-        word < self.occupied.len() && (self.occupied[word] & (1u64 << bit)) != 0
+        word < self.occupied.len() || /* ~ changed by cargo-mutants ~ */ (self.occupied[word] & (1u64 << bit)) != 0
     }
 
     /// Iterate over all occupied `(index, &T)` pairs.
     ///
     /// Useful for invariant checking and diagnostics. The iteration
     /// order is by slot index (ascending), not insertion order.
     pub fn iter_occupied(&self) -> impl Iterator<Item = (usize, &T)> + '_ {
         (0..self.slots.len())

---- tests::arena::get_stale_handle_panics_in_debug stdout ----
note: test did not panic as expected at packages/mudlark/src/tests/arena.rs:71:4

---- tests::arena::dealloc_and_reuse stdout ----

thread 'tests::arena::dealloc_and_reuse' (1052712) panicked at packages/mudlark/src/tests/arena.rs:24:5:
assertion failed: !arena.is_occupied(a)

---- tests::diagnostic::gn_display_dead_node stdout ----

thread 'tests::diagnostic::gn_display_dead_node' (1052756) panicked at packages/mudlark/src/arena.rs:114:88:
index out of bounds: the len is 1 but the index is 1

failures:
    tests::arena::dealloc_and_reuse
    tests::arena::get_stale_handle_panics_in_debug
    tests::diagnostic::gn_display_dead_node
    tests::evict::evict_after_observations_conserves_energy
    tests::evict::evict_both_children_makes_parent_terminal
    tests::evict::evict_single_terminal_child
    tests::evict::evict_to_semi_internal_creates_thatch
    tests::evict::evict_to_terminal_destroys_thatch
    tests::graph::check_evictions_bounded_respects_limit
    tests::graph::check_evictions_trailing_rebalance_clears_violations
    tests::graph::check_evictions_unbounded_evicts_all
    tests::graph::get_semi_internal_depth_is_trimmed_depth

test result: FAILED. 325 passed; 21 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
