*** packages/mudlark/src/arena.rs:114:60: replace & with ^ in Arena<T>::is_occupied

*** mutation diff:
--- packages/mudlark/src/arena.rs
+++ replace & with ^ in Arena<T>::is_occupied
@@ -106,17 +106,17 @@
     }
 
     /// Whether the slot at `index` is currently occupied.
     #[must_use]
     #[inline]
     pub fn is_occupied(&self, index: usize) -> bool {
         let word = index / 64;
         let bit = index % 64;
-        word < self.occupied.len() && (self.occupied[word] & (1u64 << bit)) != 0
+        word < self.occupied.len() && (self.occupied[word] ^ /* ~ changed by cargo-mutants ~ */ (1u64 << bit)) != 0
     }
 
     /// Iterate over all occupied `(index, &T)` pairs.
     ///
     /// Useful for invariant checking and diagnostics. The iteration
     /// order is by slot index (ascending), not insertion order.
     pub fn iter_occupied(&self) -> impl Iterator<Item = (usize, &T)> + '_ {
         (0..self.slots.len())

---- tests::arena::bitset_grows_correctly stdout ----

thread 'tests::arena::bitset_grows_correctly' (1071304) panicked at packages/mudlark/src/tests/arena.rs:65:5:
assertion failed: arena.is_occupied(64)

---- tests::arena::alloc_and_get stdout ----

thread 'tests::arena::alloc_and_get' (1071303) panicked at packages/mudlark/src/arena.rs:93:9:
Arena::get: slot 0 is not occupied

---- tests::arena::dealloc_and_reuse stdout ----

thread 'tests::arena::dealloc_and_reuse' (1071305) panicked at packages/mudlark/src/tests/arena.rs:24:5:
assertion failed: !arena.is_occupied(a)

failures:
    tests::arena::alloc_and_get
    tests::arena::bitset_grows_correctly
    tests::arena::dealloc_and_reuse
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation

test result: FAILED. 190 passed; 156 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
