*** packages/mudlark/src/arena.rs:114:68: replace << with >> in Arena<T>::is_occupied

*** mutation diff:
--- packages/mudlark/src/arena.rs
+++ replace << with >> in Arena<T>::is_occupied
@@ -106,17 +106,17 @@
     }
 
     /// Whether the slot at `index` is currently occupied.
     #[must_use]
     #[inline]
     pub fn is_occupied(&self, index: usize) -> bool {
         let word = index / 64;
         let bit = index % 64;
-        word < self.occupied.len() && (self.occupied[word] & (1u64 << bit)) != 0
+        word < self.occupied.len() && (self.occupied[word] & (1u64 >> /* ~ changed by cargo-mutants ~ */ bit)) != 0
     }
 
     /// Iterate over all occupied `(index, &T)` pairs.
     ///
     /// Useful for invariant checking and diagnostics. The iteration
     /// order is by slot index (ascending), not insertion order.
     pub fn iter_occupied(&self) -> impl Iterator<Item = (usize, &T)> + '_ {
         (0..self.slots.len())

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (1073452) panicked at packages/mudlark/src/arena.rs:104:9:
Arena::get_mut: slot 1 is not occupied

---- tests::decay::decay_amplification_above_one stdout ----

thread 'tests::decay::decay_amplification_above_one' (1073451) panicked at packages/mudlark/src/arena.rs:104:9:
Arena::get_mut: slot 1 is not occupied

---- tests::arena::dealloc_and_reuse stdout ----

thread 'tests::arena::dealloc_and_reuse' (1073448) panicked at packages/mudlark/src/tests/arena.rs:25:5:
assertion failed: arena.is_occupied(b)

failures:
    tests::arena::dealloc_and_reuse
    tests::arena::multiple_alloc_dealloc_cycles
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q

test result: FAILED. 183 passed; 163 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
