*** packages/mudlark/src/arena.rs:122:9: replace Arena<T>::iter_occupied -> impl Iterator<Item =(usize, &T)>+'_ with ::std::iter::empty()

*** mutation diff:
--- packages/mudlark/src/arena.rs
+++ replace Arena<T>::iter_occupied -> impl Iterator<Item =(usize, &T)>+'_ with ::std::iter::empty()
@@ -114,19 +114,17 @@
         word < self.occupied.len() && (self.occupied[word] & (1u64 << bit)) != 0
     }
 
     /// Iterate over all occupied `(index, &T)` pairs.
     ///
     /// Useful for invariant checking and diagnostics. The iteration
     /// order is by slot index (ascending), not insertion order.
     pub fn iter_occupied(&self) -> impl Iterator<Item = (usize, &T)> + '_ {
-        (0..self.slots.len())
-            .filter(move |&i| self.is_occupied(i))
-            .map(move |i| (i, &self.slots[i]))
+        ::std::iter::empty() /* ~ changed by cargo-mutants ~ */
     }
 
     // ── internal helpers ──────────────────────────────────────────
 
     fn set_occupied(&mut self, index: usize, value: bool) {
         let word = index / 64;
         let bit = index % 64;
         if value {

---- tests::decay::decay_amplification_above_one stdout ----

thread 'tests::decay::decay_amplification_above_one' (1077947) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (2 total):
Clean accounting violated: V-entry sum=0, G-root sum=180
Terminal count: graph.terminal_count()=10, arena walk=0

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (1077948) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (2 total):
Clean accounting violated: V-entry sum=0, G-root sum=180
Terminal count: graph.terminal_count()=10, arena walk=0

---- tests::decay::decay_energy_conservation_selective stdout ----

thread 'tests::decay::decay_energy_conservation_selective' (1077949) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (2 total):
Clean accounting violated: V-entry sum=0, G-root sum=180
Terminal count: graph.terminal_count()=10, arena walk=0

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 250 passed; 96 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
