*** packages/mudlark/src/arena.rs:130:26: replace / with * in Arena<T>::set_occupied

*** mutation diff:
--- packages/mudlark/src/arena.rs
+++ replace / with * in Arena<T>::set_occupied
@@ -122,17 +122,17 @@
         (0..self.slots.len())
             .filter(move |&i| self.is_occupied(i))
             .map(move |i| (i, &self.slots[i]))
     }
 
     // ── internal helpers ──────────────────────────────────────────
 
     fn set_occupied(&mut self, index: usize, value: bool) {
-        let word = index / 64;
+        let word = index * /* ~ changed by cargo-mutants ~ */ 64;
         let bit = index % 64;
         if value {
             self.occupied[word] |= 1u64 << bit;
         } else {
             self.occupied[word] &= !(1u64 << bit);
         }
     }
 }

---- tests::arena::dealloc_and_reuse stdout ----

thread 'tests::arena::dealloc_and_reuse' (1087413) panicked at packages/mudlark/src/arena.rs:133:26:
index out of bounds: the len is 1 but the index is 64

---- tests::decay::decay_multiple_selective_preserves_invariants stdout ----

thread 'tests::decay::decay_multiple_selective_preserves_invariants' (1087422) panicked at packages/mudlark/src/arena.rs:133:26:
index out of bounds: the len is 1 but the index is 64

---- tests::arena::multiple_alloc_dealloc_cycles stdout ----

thread 'tests::arena::multiple_alloc_dealloc_cycles' (1087415) panicked at packages/mudlark/src/arena.rs:133:26:
index out of bounds: the len is 1 but the index is 64

failures:
    tests::arena::bitset_grows_correctly
    tests::arena::dealloc_and_reuse
    tests::arena::multiple_alloc_dealloc_cycles
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation

test result: FAILED. 182 passed; 164 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
