*** packages/mudlark/src/arena.rs:133:33: replace |= with &= in Arena<T>::set_occupied

*** mutation diff:
--- packages/mudlark/src/arena.rs
+++ replace |= with &= in Arena<T>::set_occupied
@@ -125,17 +125,17 @@
     }
 
     // ── internal helpers ──────────────────────────────────────────
 
     fn set_occupied(&mut self, index: usize, value: bool) {
         let word = index / 64;
         let bit = index % 64;
         if value {
-            self.occupied[word] |= 1u64 << bit;
+            self.occupied[word] &= /* ~ changed by cargo-mutants ~ */ 1u64 << bit;
         } else {
             self.occupied[word] &= !(1u64 << bit);
         }
     }
 }
 
 impl<T: Default> Default for Arena<T> {
     fn default() -> Self {

---- tests::arena::dealloc_and_reuse stdout ----

thread 'tests::arena::dealloc_and_reuse' (1091245) panicked at packages/mudlark/src/arena.rs:77:9:
Arena::dealloc: slot 0 is not occupied

---- tests::arena::bitset_grows_correctly stdout ----

thread 'tests::arena::bitset_grows_correctly' (1091244) panicked at packages/mudlark/src/tests/arena.rs:65:5:
assertion failed: arena.is_occupied(64)

---- tests::arena::multiple_alloc_dealloc_cycles stdout ----

thread 'tests::arena::multiple_alloc_dealloc_cycles' (1091247) panicked at packages/mudlark/src/arena.rs:77:9:
Arena::dealloc: slot 0 is not occupied

failures:
    tests::arena::alloc_and_get
    tests::arena::bitset_grows_correctly
    tests::arena::dealloc_and_reuse
    tests::arena::multiple_alloc_dealloc_cycles
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one

test result: FAILED. 149 passed; 197 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
