*** packages/mudlark/src/arena.rs:133:41: replace << with >> in Arena<T>::set_occupied

*** mutation diff:
--- packages/mudlark/src/arena.rs
+++ replace << with >> in Arena<T>::set_occupied
@@ -125,17 +125,17 @@
     }
 
     // ── internal helpers ──────────────────────────────────────────
 
     fn set_occupied(&mut self, index: usize, value: bool) {
         let word = index / 64;
         let bit = index % 64;
         if value {
-            self.occupied[word] |= 1u64 << bit;
+            self.occupied[word] |= 1u64 >> /* ~ changed by cargo-mutants ~ */ bit;
         } else {
             self.occupied[word] &= !(1u64 << bit);
         }
     }
 }
 
 impl<T: Default> Default for Arena<T> {
     fn default() -> Self {

---- tests::arena::dealloc_and_reuse stdout ----

thread 'tests::arena::dealloc_and_reuse' (1096348) panicked at packages/mudlark/src/tests/arena.rs:25:5:
assertion failed: arena.is_occupied(b)

---- tests::arena::multiple_alloc_dealloc_cycles stdout ----

thread 'tests::arena::multiple_alloc_dealloc_cycles' (1096350) panicked at packages/mudlark/src/arena.rs:77:9:
Arena::dealloc: slot 2 is not occupied

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (1096352) panicked at packages/mudlark/src/arena.rs:104:9:
Arena::get_mut: slot 1 is not occupied

failures:
    tests::arena::dealloc_and_reuse
    tests::arena::multiple_alloc_dealloc_cycles
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q

test result: FAILED. 183 passed; 163 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
