*** packages/mudlark/src/arena.rs:135:33: replace &= with |= in Arena<T>::set_occupied

*** mutation diff:
--- packages/mudlark/src/arena.rs
+++ replace &= with |= in Arena<T>::set_occupied
@@ -127,17 +127,17 @@
     // ── internal helpers ──────────────────────────────────────────
 
     fn set_occupied(&mut self, index: usize, value: bool) {
         let word = index / 64;
         let bit = index % 64;
         if value {
             self.occupied[word] |= 1u64 << bit;
         } else {
-            self.occupied[word] &= !(1u64 << bit);
+            self.occupied[word] |= /* ~ changed by cargo-mutants ~ */ !(1u64 << bit);
         }
     }
 }
 
 impl<T: Default> Default for Arena<T> {
     fn default() -> Self {
         Self::new()
     }

---- tests::arena::dealloc_and_reuse stdout ----

thread 'tests::arena::dealloc_and_reuse' (1100043) panicked at packages/mudlark/src/tests/arena.rs:24:5:
assertion failed: !arena.is_occupied(a)

---- tests::arena::get_stale_handle_panics_in_debug stdout ----
note: test did not panic as expected at packages/mudlark/src/tests/arena.rs:71:4

---- tests::evict::evict_both_children_makes_parent_terminal stdout ----

thread 'tests::evict::evict_both_children_makes_parent_terminal' (1100106) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (3 total):
V-I6 violated at V-node 1: is_exposed=false, expected=true (state=SemiInternal)
V-I6 violated at V-node 3: is_exposed=false, expected=true (state=SemiInternal)
Terminal count: graph.terminal_count()=1, arena walk=2

failures:
    tests::arena::dealloc_and_reuse
    tests::arena::get_stale_handle_panics_in_debug
    tests::evict::evict_after_observations_conserves_energy
    tests::evict::evict_both_children_makes_parent_terminal
    tests::evict::evict_single_terminal_child
    tests::evict::evict_to_semi_internal_creates_thatch
    tests::evict::evict_to_terminal_destroys_thatch
    tests::graph::check_evictions_bounded_respects_limit
    tests::graph::check_evictions_trailing_rebalance_clears_violations
    tests::graph::check_evictions_unbounded_evicts_all
    tests::graph::get_semi_internal_depth_is_trimmed_depth
    tests::graph::get_semi_internal_left_child_trims_right

test result: FAILED. 327 passed; 19 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
