*** packages/mudlark/src/arena.rs:135:43: replace << with >> in Arena<T>::set_occupied

*** mutation diff:
--- packages/mudlark/src/arena.rs
+++ replace << with >> in Arena<T>::set_occupied
@@ -127,17 +127,17 @@
     // ── internal helpers ──────────────────────────────────────────
 
     fn set_occupied(&mut self, index: usize, value: bool) {
         let word = index / 64;
         let bit = index % 64;
         if value {
             self.occupied[word] |= 1u64 << bit;
         } else {
-            self.occupied[word] &= !(1u64 << bit);
+            self.occupied[word] &= !(1u64 >> /* ~ changed by cargo-mutants ~ */ bit);
         }
     }
 }
 
 impl<T: Default> Default for Arena<T> {
     fn default() -> Self {
         Self::new()
     }

---- tests::evict::evict_both_children_makes_parent_terminal stdout ----

thread 'tests::evict::evict_both_children_makes_parent_terminal' (1103602) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (3 total):
V-I6 violated at V-node 1: is_exposed=false, expected=true (state=SemiInternal)
V-I6 violated at V-node 3: is_exposed=false, expected=true (state=SemiInternal)
Terminal count: graph.terminal_count()=1, arena walk=2

---- tests::evict::evict_to_terminal_destroys_thatch stdout ----

thread 'tests::evict::evict_to_terminal_destroys_thatch' (1103605) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (3 total):
V-I6 violated at V-node 1: is_exposed=false, expected=true (state=SemiInternal)
V-I6 violated at V-node 3: is_exposed=false, expected=true (state=SemiInternal)
Terminal count: graph.terminal_count()=1, arena walk=2

---- tests::evict::evict_after_observations_conserves_energy stdout ----

thread 'tests::evict::evict_after_observations_conserves_energy' (1103601) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (3 total):
V-I6 violated at V-node 1: is_exposed=false, expected=true (state=SemiInternal)
V-I6 violated at V-node 3: is_exposed=false, expected=true (state=SemiInternal)
Terminal count: graph.terminal_count()=1, arena walk=2

failures:
    tests::evict::evict_after_observations_conserves_energy
    tests::evict::evict_both_children_makes_parent_terminal
    tests::evict::evict_single_terminal_child
    tests::evict::evict_to_semi_internal_creates_thatch
    tests::evict::evict_to_terminal_destroys_thatch
    tests::graph::check_evictions_bounded_respects_limit
    tests::graph::check_evictions_trailing_rebalance_clears_violations
    tests::graph::check_evictions_unbounded_evicts_all
    tests::graph::get_semi_internal_depth_is_trimmed_depth
    tests::graph::get_semi_internal_left_child_trims_right
    tests::graph::get_semi_internal_right_child_trims_left
    tests::observe::observe_invariants_hold_after_eviction_cycle

test result: FAILED. 329 passed; 17 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
