*** packages/mudlark/src/arena.rs:43:9: replace Arena<T>::count -> u32 with 0

*** mutation diff:
--- packages/mudlark/src/arena.rs
+++ replace Arena<T>::count -> u32 with 0
@@ -35,17 +35,17 @@
             count: 0,
         }
     }
 
     /// Number of live (occupied) entries.
     #[must_use]
     #[inline]
     pub const fn count(&self) -> u32 {
-        self.count
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Allocate a slot, returning its 0-based index.
     ///
     /// Reuses a previously freed slot if available, otherwise grows
     /// the backing `Vec`.
     pub fn alloc(&mut self, value: T) -> usize {
         let index = if let Some(idx) = self.free.pop() {

---- tests::decay::decay_energy_conservation_uniform stdout ----

thread 'tests::decay::decay_energy_conservation_uniform' (998694) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
Node count: graph.node_count()=19, arena count=0

---- tests::arena::dealloc_and_reuse stdout ----

thread 'tests::arena::dealloc_and_reuse' (998688) panicked at packages/mudlark/src/tests/arena.rs:19:5:
assertion `left == right` failed
  left: 0
 right: 2

---- tests::arena::multiple_alloc_dealloc_cycles stdout ----

thread 'tests::arena::multiple_alloc_dealloc_cycles' (998690) panicked at packages/mudlark/src/tests/arena.rs:41:5:
assertion `left == right` failed
  left: 0
 right: 100

failures:
    tests::arena::alloc_and_get
    tests::arena::bitset_grows_correctly
    tests::arena::dealloc_and_reuse
    tests::arena::multiple_alloc_dealloc_cycles
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one

test result: FAILED. 251 passed; 95 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
