*** packages/mudlark/src/arena.rs:43:9: replace Arena<T>::count -> u32 with 1

*** mutation diff:
--- packages/mudlark/src/arena.rs
+++ replace Arena<T>::count -> u32 with 1
@@ -35,17 +35,17 @@
             count: 0,
         }
     }
 
     /// Number of live (occupied) entries.
     #[must_use]
     #[inline]
     pub const fn count(&self) -> u32 {
-        self.count
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Allocate a slot, returning its 0-based index.
     ///
     /// Reuses a previously freed slot if available, otherwise grows
     /// the backing `Vec`.
     pub fn alloc(&mut self, value: T) -> usize {
         let index = if let Some(idx) = self.free.pop() {

---- tests::arena::multiple_alloc_dealloc_cycles stdout ----

thread 'tests::arena::multiple_alloc_dealloc_cycles' (1005755) panicked at packages/mudlark/src/tests/arena.rs:41:5:
assertion `left == right` failed
  left: 1
 right: 100

---- tests::arena::bitset_grows_correctly stdout ----

thread 'tests::arena::bitset_grows_correctly' (1005752) panicked at packages/mudlark/src/tests/arena.rs:64:5:
assertion `left == right` failed
  left: 1
 right: 65

---- tests::arena::dealloc_and_reuse stdout ----

thread 'tests::arena::dealloc_and_reuse' (1005753) panicked at packages/mudlark/src/tests/arena.rs:19:5:
assertion `left == right` failed
  left: 1
 right: 2

failures:
    tests::arena::bitset_grows_correctly
    tests::arena::dealloc_and_reuse
    tests::arena::multiple_alloc_dealloc_cycles
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation

test result: FAILED. 260 passed; 86 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
