*** packages/mudlark/src/arena.rs:59:26: replace / with % in Arena<T>::alloc

*** mutation diff:
--- packages/mudlark/src/arena.rs
+++ replace / with % in Arena<T>::alloc
@@ -51,17 +51,17 @@
         let index = if let Some(idx) = self.free.pop() {
             let i = idx as usize;
             self.slots[i] = value;
             i
         } else {
             let i = self.slots.len();
             self.slots.push(value);
             // Grow bitset if needed.
-            let word = i / 64;
+            let word = i % /* ~ changed by cargo-mutants ~ */ 64;
             if word >= self.occupied.len() {
                 self.occupied.resize(word + 1, 0);
             }
             i
         };
         self.set_occupied(index, true);
         self.count += 1;
         index

---- tests::rebalance_stress::large_violation_cascade_exceeds_fixed_10k_limit stdout ----

thread 'tests::rebalance_stress::large_violation_cascade_exceeds_fixed_10k_limit' (1004970) panicked at packages/mudlark/src/arena.rs:133:26:
index out of bounds: the len is 64 but the index is 64

failures:
    tests::rebalance_stress::large_violation_cascade_exceeds_fixed_10k_limit

test result: FAILED. 345 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.10s

*** result: Failure(101)
