*** packages/mudlark/src/arena.rs:61:43: replace + with * in Arena<T>::alloc

*** mutation diff:
--- packages/mudlark/src/arena.rs
+++ replace + with * in Arena<T>::alloc
@@ -53,17 +53,17 @@
             self.slots[i] = value;
             i
         } else {
             let i = self.slots.len();
             self.slots.push(value);
             // Grow bitset if needed.
             let word = i / 64;
             if word >= self.occupied.len() {
-                self.occupied.resize(word + 1, 0);
+                self.occupied.resize(word * /* ~ changed by cargo-mutants ~ */ 1, 0);
             }
             i
         };
         self.set_occupied(index, true);
         self.count += 1;
         index
     }

---- tests::decay::decay_energy_conservation_selective stdout ----

thread 'tests::decay::decay_energy_conservation_selective' (1023009) panicked at packages/mudlark/src/arena.rs:133:26:
index out of bounds: the len is 0 but the index is 0

---- tests::decay::decay_amplification_above_one stdout ----

thread 'tests::decay::decay_amplification_above_one' (1023007) panicked at packages/mudlark/src/arena.rs:133:26:
index out of bounds: the len is 0 but the index is 0

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (1023008) panicked at packages/mudlark/src/arena.rs:133:26:
index out of bounds: the len is 0 but the index is 0

failures:
    tests::arena::alloc_and_get
    tests::arena::bitset_grows_correctly
    tests::arena::dealloc_and_reuse
    tests::arena::get_stale_handle_panics_in_debug
    tests::arena::multiple_alloc_dealloc_cycles
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants

test result: FAILED. 147 passed; 199 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
