*** packages/mudlark/src/arena.rs:66:20: replace += with -= in Arena<T>::alloc

*** mutation diff:
--- packages/mudlark/src/arena.rs
+++ replace += with -= in Arena<T>::alloc
@@ -58,17 +58,17 @@
             // Grow bitset if needed.
             let word = i / 64;
             if word >= self.occupied.len() {
                 self.occupied.resize(word + 1, 0);
             }
             i
         };
         self.set_occupied(index, true);
-        self.count += 1;
+        self.count -= /* ~ changed by cargo-mutants ~ */ 1;
         index
     }
 
     /// Deallocate the slot at `index`, returning the stored value
     /// and replacing it with `T::default()`.
     ///
     /// # Panics (debug only)
     ///

---- tests::decay::decay_energy_conservation_selective stdout ----

thread 'tests::decay::decay_energy_conservation_selective' (1026840) panicked at packages/mudlark/src/arena.rs:66:9:
attempt to subtract with overflow

---- tests::decay::decay_energy_conservation_uniform stdout ----

thread 'tests::decay::decay_energy_conservation_uniform' (1026841) panicked at packages/mudlark/src/arena.rs:66:9:
attempt to subtract with overflow

---- tests::arena::get_stale_handle_panics_in_debug stdout ----

thread 'tests::arena::get_stale_handle_panics_in_debug' (1026836) panicked at packages/mudlark/src/arena.rs:66:9:
attempt to subtract with overflow
note: panic did not contain expected string
      panic message: "attempt to subtract with overflow"
 expected substring: "not occupied"

failures:
    tests::arena::alloc_and_get
    tests::arena::bitset_grows_correctly
    tests::arena::dealloc_and_reuse
    tests::arena::get_stale_handle_panics_in_debug
    tests::arena::multiple_alloc_dealloc_cycles
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants

test result: FAILED. 147 passed; 199 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
