*** packages/mudlark/src/arena.rs:66:20: replace += with *= in Arena<T>::alloc

*** mutation diff:
--- packages/mudlark/src/arena.rs
+++ replace += with *= in Arena<T>::alloc
@@ -58,17 +58,17 @@
             // Grow bitset if needed.
             let word = i / 64;
             if word >= self.occupied.len() {
                 self.occupied.resize(word + 1, 0);
             }
             i
         };
         self.set_occupied(index, true);
-        self.count += 1;
+        self.count *= /* ~ changed by cargo-mutants ~ */ 1;
         index
     }
 
     /// Deallocate the slot at `index`, returning the stored value
     /// and replacing it with `T::default()`.
     ///
     /// # Panics (debug only)
     ///

---- tests::arena::alloc_and_get stdout ----

thread 'tests::arena::alloc_and_get' (1026996) panicked at packages/mudlark/src/tests/arena.rs:11:5:
assertion `left == right` failed
  left: 0
 right: 1

---- tests::arena::bitset_grows_correctly stdout ----

thread 'tests::arena::bitset_grows_correctly' (1026997) panicked at packages/mudlark/src/tests/arena.rs:64:5:
assertion `left == right` failed
  left: 0
 right: 65

---- tests::arena::dealloc_and_reuse stdout ----

thread 'tests::arena::dealloc_and_reuse' (1026999) panicked at packages/mudlark/src/tests/arena.rs:19:5:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    tests::arena::alloc_and_get
    tests::arena::bitset_grows_correctly
    tests::arena::dealloc_and_reuse
    tests::arena::get_stale_handle_panics_in_debug
    tests::arena::multiple_alloc_dealloc_cycles
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants

test result: FAILED. 220 passed; 126 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
