*** packages/mudlark/src/arena.rs:81:20: replace -= with /= in Arena<T>::dealloc

*** mutation diff:
--- packages/mudlark/src/arena.rs
+++ replace -= with /= in Arena<T>::dealloc
@@ -73,17 +73,17 @@
     /// # Panics (debug only)
     ///
     /// `debug_assert`s that the slot is currently occupied.
     pub fn dealloc(&mut self, index: usize) -> T {
         debug_assert!(self.is_occupied(index), "Arena::dealloc: slot {index} is not occupied");
         self.set_occupied(index, false);
         #[allow(clippy::cast_possible_truncation)] // arena indices are always < u32::MAX
         self.free.push(index as u32);
-        self.count -= 1;
+        self.count /= /* ~ changed by cargo-mutants ~ */ 1;
         std::mem::take(&mut self.slots[index])
     }
 
     /// Immutable access to the slot at `index`.
     ///
     /// # Panics (debug only)
     ///
     /// `debug_assert`s that the slot is currently occupied.

---- tests::arena::dealloc_and_reuse stdout ----

thread 'tests::arena::dealloc_and_reuse' (1029966) panicked at packages/mudlark/src/tests/arena.rs:23:5:
assertion `left == right` failed
  left: 2
 right: 1

---- tests::arena::multiple_alloc_dealloc_cycles stdout ----

thread 'tests::arena::multiple_alloc_dealloc_cycles' (1029968) panicked at packages/mudlark/src/tests/arena.rs:47:5:
assertion `left == right` failed
  left: 100
 right: 50

---- tests::evict::evict_to_semi_internal_creates_thatch stdout ----

thread 'tests::evict::evict_to_semi_internal_creates_thatch' (1030026) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
Node count: graph.node_count()=2, arena count=3

failures:
    tests::arena::dealloc_and_reuse
    tests::arena::multiple_alloc_dealloc_cycles
    tests::evict::evict_after_observations_conserves_energy
    tests::evict::evict_both_children_makes_parent_terminal
    tests::evict::evict_single_terminal_child
    tests::evict::evict_to_semi_internal_creates_thatch
    tests::evict::evict_to_terminal_destroys_thatch
    tests::graph::check_evictions_bounded_respects_limit
    tests::graph::check_evictions_trailing_rebalance_clears_violations
    tests::graph::check_evictions_unbounded_evicts_all
    tests::graph::get_semi_internal_depth_is_trimmed_depth
    tests::graph::get_semi_internal_left_child_trims_right

test result: FAILED. 327 passed; 19 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
