*** packages/mudlark/src/contour_range.rs:303:8: delete ! in validate_endpoints

*** mutation diff:
--- packages/mudlark/src/contour_range.rs
+++ delete ! in validate_endpoints
@@ -295,17 +295,17 @@
 /// - `start < end`.
 pub fn validate_endpoints<C: Coordinate, V: Accumulator>(
     plateaus: &BTreeMap<BasisEdge<C>, Plateau<C, V>>,
     start: BasisEdge<C>,
     end: BasisEdge<C>,
     domain_end: C,
 ) -> Option<()> {
     // CR-I1: start must be a plateau basis edge.
-    if !plateaus.contains_key(&start) {
+    if  /* ~ changed by cargo-mutants ~ */plateaus.contains_key(&start) {
         return None;
     }
     // CR-I1: end must be a basis edge or the domain sentinel.
     if end != BasisEdge(domain_end) && !plateaus.contains_key(&end) {
         return None;
     }
     // CR-I1: start < end.
     if start >= end {

---- basis_is_flat_list stdout ----

thread 'basis_is_flat_list' (670846) panicked at packages/mudlark/tests/contour_range.rs:619:50:
called `Option::unwrap()` on a `None` value

---- boundary_thatch_flag stdout ----

thread 'boundary_thatch_flag' (670848) panicked at packages/mudlark/tests/contour_range.rs:690:50:
called `Option::unwrap()` on a `None` value

---- energy_equals_basis_sum stdout ----

thread 'energy_equals_basis_sum' (670852) panicked at packages/mudlark/tests/contour_range.rs:458:50:
called `Option::unwrap()` on a `None` value

failures:
    basis_is_flat_list
    boundary_count_at_most_two
    boundary_thatch_flag
    cross_plateau_energy_non_negative
    determinism
    energy_equals_basis_sum
    energy_exact_gap
    energy_only_matches_full
    energy_ordering
    full_domain_range
    invalid_endpoint_returns_none
    nesting_monotonicity

test result: FAILED. 3 passed; 20 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
