*** packages/mudlark/src/contour_range.rs:307:12: replace != with == in validate_endpoints

*** mutation diff:
--- packages/mudlark/src/contour_range.rs
+++ replace != with == in validate_endpoints
@@ -299,17 +299,17 @@
     end: BasisEdge<C>,
     domain_end: C,
 ) -> Option<()> {
     // CR-I1: start must be a plateau basis edge.
     if !plateaus.contains_key(&start) {
         return None;
     }
     // CR-I1: end must be a basis edge or the domain sentinel.
-    if end != BasisEdge(domain_end) && !plateaus.contains_key(&end) {
+    if end == /* ~ changed by cargo-mutants ~ */ BasisEdge(domain_end) && !plateaus.contains_key(&end) {
         return None;
     }
     // CR-I1: start < end.
     if start >= end {
         return None;
     }
     Some(())
 }

---- boundary_count_at_most_two stdout ----

thread 'boundary_count_at_most_two' (639709) panicked at packages/mudlark/tests/contour_range.rs:292:66:
called `Option::unwrap()` on a `None` value

---- invalid_endpoint_returns_none stdout ----

thread 'invalid_endpoint_returns_none' (639719) panicked at packages/mudlark/tests/contour_range.rs:331:5:
non-lattice end should return None

---- full_domain_range stdout ----

thread 'full_domain_range' (639718) panicked at packages/mudlark/tests/contour_range.rs:133:42:
full domain range is valid

failures:
    basis_is_flat_list
    boundary_count_at_most_two
    boundary_thatch_flag
    cross_plateau_energy_non_negative
    determinism
    energy_equals_basis_sum
    energy_exact_gap
    energy_only_matches_full
    energy_ordering
    full_domain_range
    invalid_endpoint_returns_none
    nesting_monotonicity

test result: FAILED. 3 passed; 20 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
