*** packages/mudlark/src/contour_range.rs:307:37: replace && with || in validate_endpoints

*** mutation diff:
--- packages/mudlark/src/contour_range.rs
+++ replace && with || in validate_endpoints
@@ -299,17 +299,17 @@
     end: BasisEdge<C>,
     domain_end: C,
 ) -> Option<()> {
     // CR-I1: start must be a plateau basis edge.
     if !plateaus.contains_key(&start) {
         return None;
     }
     // CR-I1: end must be a basis edge or the domain sentinel.
-    if end != BasisEdge(domain_end) && !plateaus.contains_key(&end) {
+    if end != BasisEdge(domain_end) || /* ~ changed by cargo-mutants ~ */ !plateaus.contains_key(&end) {
         return None;
     }
     // CR-I1: start < end.
     if start >= end {
         return None;
     }
     Some(())
 }

---- basis_is_flat_list stdout ----

thread 'basis_is_flat_list' (682058) panicked at packages/mudlark/tests/contour_range.rs:619:50:
called `Option::unwrap()` on a `None` value

---- energy_only_matches_full stdout ----

thread 'energy_only_matches_full' (682068) panicked at packages/mudlark/tests/contour_range.rs:514:52:
called `Option::unwrap()` on a `None` value

---- determinism stdout ----

thread 'determinism' (682063) panicked at packages/mudlark/tests/contour_range.rs:555:49:
called `Option::unwrap()` on a `None` value

failures:
    basis_is_flat_list
    boundary_count_at_most_two
    boundary_thatch_flag
    cross_plateau_energy_non_negative
    determinism
    energy_equals_basis_sum
    energy_exact_gap
    energy_only_matches_full
    energy_ordering
    full_domain_range
    nesting_monotonicity
    no_straddling_ancestors

test result: FAILED. 4 passed; 19 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
