*** packages/mudlark/src/contour_range.rs:311:14: replace >= with < in validate_endpoints

*** mutation diff:
--- packages/mudlark/src/contour_range.rs
+++ replace >= with < in validate_endpoints
@@ -303,17 +303,17 @@
     if !plateaus.contains_key(&start) {
         return None;
     }
     // CR-I1: end must be a basis edge or the domain sentinel.
     if end != BasisEdge(domain_end) && !plateaus.contains_key(&end) {
         return None;
     }
     // CR-I1: start < end.
-    if start >= end {
+    if start < /* ~ changed by cargo-mutants ~ */ end {
         return None;
     }
     Some(())
 }
 
 /// Sum of individual plateau energies within `[start, end)`.
 ///
 /// Collects plateaus whose basis edge `a_j ∈ [start, end)` and

---- basis_is_flat_list stdout ----

thread 'basis_is_flat_list' (676174) panicked at packages/mudlark/tests/contour_range.rs:619:50:
called `Option::unwrap()` on a `None` value

---- energy_equals_basis_sum stdout ----

thread 'energy_equals_basis_sum' (676180) panicked at packages/mudlark/tests/contour_range.rs:458:50:
called `Option::unwrap()` on a `None` value

---- boundary_count_at_most_two stdout ----

thread 'boundary_count_at_most_two' (676175) panicked at packages/mudlark/tests/contour_range.rs:292:66:
called `Option::unwrap()` on a `None` value

failures:
    basis_is_flat_list
    boundary_count_at_most_two
    boundary_thatch_flag
    cross_plateau_energy_non_negative
    determinism
    empty_range_rejected
    energy_equals_basis_sum
    energy_exact_gap
    energy_only_matches_full
    energy_ordering
    full_domain_range
    nesting_monotonicity

test result: FAILED. 3 passed; 20 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
