*** packages/mudlark/src/contour_range.rs:332:15: replace += with -= in compute_plateau_energy

*** mutation diff:
--- packages/mudlark/src/contour_range.rs
+++ replace += with -= in compute_plateau_energy
@@ -324,17 +324,17 @@
     plateaus: &BTreeMap<BasisEdge<C>, Plateau<C, V>>,
     start: BasisEdge<C>,
     end: BasisEdge<C>,
 ) -> (V, usize) {
     let mut sum = V::zero();
     let mut count = 0usize;
     for (_, p) in plateaus.range(start..end) {
         sum = V::add(sum, p.sum);
-        count += 1;
+        count -= /* ~ changed by cargo-mutants ~ */ 1;
     }
     (sum, count)
 }
 
 // ── Debug-build invariant assertions (Phase 5, ADR-M-037) ───────────
 
 /// Debug-build invariant checks for a contour range decomposition.
 ///

---- cross_plateau_energy_non_negative stdout ----

thread 'cross_plateau_energy_non_negative' (646948) panicked at packages/mudlark/src/contour_range.rs:332:9:
attempt to subtract with overflow

---- boundary_count_at_most_two stdout ----

thread 'boundary_count_at_most_two' (646946) panicked at packages/mudlark/src/contour_range.rs:332:9:
attempt to subtract with overflow

---- determinism stdout ----

thread 'determinism' (646949) panicked at packages/mudlark/src/contour_range.rs:332:9:
attempt to subtract with overflow

failures:
    basis_is_flat_list
    boundary_count_at_most_two
    boundary_thatch_flag
    cross_plateau_energy_non_negative
    determinism
    energy_equals_basis_sum
    energy_exact_gap
    energy_only_matches_full
    energy_ordering
    full_domain_range
    nesting_monotonicity
    no_straddling_ancestors

test result: FAILED. 4 passed; 19 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
