*** packages/mudlark/src/contour_range.rs:418:37: replace - with + in debug_assert_contour_range_invariants

*** mutation diff:
--- packages/mudlark/src/contour_range.rs
+++ replace - with + in debug_assert_contour_range_invariants
@@ -410,14 +410,14 @@
     // in sign (§CR.13.6).  No universal ordering assertion.
     // Structural identity: energy = exact_energy + B − A (both
     // B, A ≥ 0 under P1).  Verifying this requires computing B
     // and A separately, deferred to dedicated tests (test 17).
 
     // ── §CR.10.4: cross_plateau_energy consistency ──────────
     let cross_f64 = cr.cross_plateau_energy.to_f64_approx();
     let plateau_f64 = cr.plateau_energy.to_f64_approx();
-    let expected_cross = energy_f64 - plateau_f64;
+    let expected_cross = energy_f64 + /* ~ changed by cargo-mutants ~ */ plateau_f64;
     debug_assert!(
         (cross_f64 - expected_cross).abs() < 1e-10,
         "cross_plateau_energy ({cross_f64}) != energy - plateau_energy ({expected_cross})",
     );
 }

---- energy_ordering stdout ----

thread 'energy_ordering' (663464) panicked at packages/mudlark/src/contour_range.rs:419:5:
cross_plateau_energy (0) != energy - plateau_energy (100)

---- boundary_thatch_flag stdout ----

thread 'boundary_thatch_flag' (663457) panicked at packages/mudlark/src/contour_range.rs:419:5:
cross_plateau_energy (0) != energy - plateau_energy (100)

---- basis_is_flat_list stdout ----

thread 'basis_is_flat_list' (663455) panicked at packages/mudlark/src/contour_range.rs:419:5:
cross_plateau_energy (0) != energy - plateau_energy (100)

failures:
    basis_is_flat_list
    boundary_count_at_most_two
    boundary_thatch_flag
    cross_plateau_energy_non_negative
    determinism
    energy_equals_basis_sum
    energy_exact_gap
    energy_only_matches_full
    energy_ordering
    full_domain_range
    nesting_monotonicity
    no_straddling_ancestors

test result: FAILED. 4 passed; 19 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
