*** packages/mudlark/src/decay.rs:103:30: replace == with != in GvGraph<C, V, N>::decay

*** mutation diff:
--- packages/mudlark/src/decay.rs
+++ replace == with != in GvGraph<C, V, N>::decay
@@ -95,17 +95,17 @@
         );
 
         // No-op: factor of exactly 1.0 changes nothing.
         #[allow(clippy::float_cmp)] // Intentional exact comparison for the no-op case.
         if attenuation == 1.0 {
             return;
         }
 
-        let is_global = root == self.g_root;
+        let is_global = root != /* ~ changed by cargo-mutants ~ */ self.g_root;
 
         let _span = tracing::debug_span!("decay", root = root.index(), attenuation, q,).entered();
 
         if q == 0.0 {
             self.decay_uniform(root, attenuation, is_global);
         } else {
             self.decay_selective(root, attenuation, q, is_global);
         }

---- tests::decay::decay_selective_subtree_leaves_other_half_unchanged stdout ----

thread 'tests::decay::decay_selective_subtree_leaves_other_half_unchanged' (1118233) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (2 total):
G-I1 violated at G-node 0: expected sum=365, actual sum=530 (own=20, left_sum=115, right_sum=230)
Clean accounting violated: V-entry sum=365, G-root sum=530

---- tests::decay::decay_selective_subtree_preserves_invariants stdout ----

thread 'tests::decay::decay_selective_subtree_preserves_invariants' (1118234) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (2 total):
G-I1 violated at G-node 0: expected sum=365, actual sum=530 (own=20, left_sum=115, right_sum=230)
Clean accounting violated: V-entry sum=365, G-root sum=530

---- tests::decay::decay_uniform_subtree_preserves_invariants stdout ----

thread 'tests::decay::decay_uniform_subtree_preserves_invariants' (1118241) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (2 total):
G-I1 violated at G-node 0: expected sum=334, actual sum=530 (own=20, left_sum=84, right_sum=230)
Clean accounting violated: V-entry sum=334, G-root sum=530

failures:
    tests::decay::decay_selective_subtree_leaves_other_half_unchanged
    tests::decay::decay_selective_subtree_preserves_invariants
    tests::decay::decay_uniform_subtree_preserves_invariants
    tests::decay::decay_uniform_subtree_scales_only_target

test result: FAILED. 342 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
