*** packages/mudlark/src/decay.rs:107:14: replace == with != in GvGraph<C, V, N>::decay

*** mutation diff:
--- packages/mudlark/src/decay.rs
+++ replace == with != in GvGraph<C, V, N>::decay
@@ -99,17 +99,17 @@
         if attenuation == 1.0 {
             return;
         }
 
         let is_global = root == self.g_root;
 
         let _span = tracing::debug_span!("decay", root = root.index(), attenuation, q,).entered();
 
-        if q == 0.0 {
+        if q != /* ~ changed by cargo-mutants ~ */ 0.0 {
             self.decay_uniform(root, attenuation, is_global);
         } else {
             self.decay_selective(root, attenuation, q, is_global);
         }
     }
 
     // ── Uniform path (q = 0) ────────────────────────────────────

---- tests::decay::decay_f64_tree stdout ----

thread 'tests::decay::decay_f64_tree' (1121617) panicked at packages/mudlark/src/decay.rs:232:33:
index out of bounds: the len is 5 but the index is 5

---- tests::decay::decay_single_node_selective stdout ----

thread 'tests::decay::decay_single_node_selective' (1121634) panicked at packages/mudlark/src/tests/decay.rs:469:5:
assertion `left == right` failed
  left: 50
 right: 87

---- tests::decay::decay_selective_q1_root_undecayed stdout ----

thread 'tests::decay::decay_selective_q1_root_undecayed' (1121631) panicked at packages/mudlark/src/tests/decay.rs:208:5:
at q=1.0, subtree root own should be unchanged

failures:
    tests::decay::decay_f64_tree
    tests::decay::decay_selective_q1_root_undecayed
    tests::decay::decay_single_node_selective
    tests::decay_f64_depth::trace_f64_depth_inconsistency_step_by_step

test result: FAILED. 342 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
