*** packages/mudlark/src/decay.rs:152:12: delete ! in GvGraph<C, V, N>::decay_uniform

*** mutation diff:
--- packages/mudlark/src/decay.rs
+++ delete ! in GvGraph<C, V, N>::decay_uniform
@@ -144,17 +144,17 @@
                 stack.push(right);
             }
         }
 
         // 2. Recompute g.sum bottom-up within subtree.
         gtree::recompute_g_sums_subtree(&mut self.gnodes, &order);
 
         // 3. Fix G-sums above the subtree.
-        if !is_global {
+        if  /* ~ changed by cargo-mutants ~ */is_global {
             if let Some(parent) = self.gnodes.get(root.index()).parent {
                 gtree::recompute_g_sums(&mut self.gnodes, parent);
             }
         }
 
         // 3. Recompute all V-structural intensities bottom-up.
         if let Some(v_root) = self.v_root {
             vtree::recompute_all_v_intensities(&mut self.vnodes, v_root);

---- tests::decay::decay_uniform_subtree_preserves_invariants stdout ----

thread 'tests::decay::decay_uniform_subtree_preserves_invariants' (1124410) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (2 total):
G-I1 violated at G-node 0: expected sum=334, actual sum=530 (own=20, left_sum=84, right_sum=230)
Clean accounting violated: V-entry sum=334, G-root sum=530

---- tests::decay::decay_uniform_subtree_scales_only_target stdout ----

thread 'tests::decay::decay_uniform_subtree_scales_only_target' (1124411) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (2 total):
G-I1 violated at G-node 0: expected sum=390, actual sum=530 (own=20, left_sum=140, right_sum=230)
Clean accounting violated: V-entry sum=390, G-root sum=530

failures:
    tests::decay::decay_uniform_subtree_preserves_invariants
    tests::decay::decay_uniform_subtree_scales_only_target

test result: FAILED. 344 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
