*** packages/mudlark/src/decay.rs:207:29: replace - with / in GvGraph<C, V, N>::decay_selective

*** mutation diff:
--- packages/mudlark/src/decay.rs
+++ replace - with / in GvGraph<C, V, N>::decay_selective
@@ -199,17 +199,17 @@
     // ── Selective path (q > 0) ──────────────────────────────────
 
     /// Per-depth factor table, bottom-up G-sum recompute, trailing
     /// rebalance.
     fn decay_selective(&mut self, root: GNodeId, att: f64, q: f64, is_global: bool) {
         let _span = tracing::debug_span!("decay_selective", root = root.index(), att, q, is_global,).entered();
 
         let d_root = self.gnode_depth(root);
-        let depth_range = N - d_root;
+        let depth_range = N / /* ~ changed by cargo-mutants ~ */ d_root;
 
         // 1. Precompute per-depth factor table.
         //    factors[d_local] = exp(ln(att) * (1 + q * (2*d_local/D - 1)))
         let ln_att = att.ln();
         let factors: Vec<f64> = (0..=depth_range)
             .map(|d_local| {
                 let t = if depth_range == 0 {
                     0.0

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (1141321) panicked at packages/mudlark/src/decay.rs:207:27:
attempt to divide by zero

---- tests::decay::decay_energy_conservation_selective stdout ----

thread 'tests::decay::decay_energy_conservation_selective' (1141322) panicked at packages/mudlark/src/decay.rs:207:27:
attempt to divide by zero

---- tests::decay::decay_multiple_selective_preserves_invariants stdout ----

thread 'tests::decay::decay_multiple_selective_preserves_invariants' (1141325) panicked at packages/mudlark/src/decay.rs:207:27:
attempt to divide by zero

failures:
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_selective_preserves_invariants
    tests::decay::decay_selective_q1_root_undecayed
    tests::decay::decay_single_node_selective
    tests::decay::decay_then_extract_roundtrip

test result: FAILED. 339 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.15s

*** result: Failure(101)
