*** packages/mudlark/src/decay.rs:214:40: replace == with != in GvGraph<C, V, N>::decay_selective

*** mutation diff:
--- packages/mudlark/src/decay.rs
+++ replace == with != in GvGraph<C, V, N>::decay_selective
@@ -206,17 +206,17 @@
         let d_root = self.gnode_depth(root);
         let depth_range = N - d_root;
 
         // 1. Precompute per-depth factor table.
         //    factors[d_local] = exp(ln(att) * (1 + q * (2*d_local/D - 1)))
         let ln_att = att.ln();
         let factors: Vec<f64> = (0..=depth_range)
             .map(|d_local| {
-                let t = if depth_range == 0 {
+                let t = if depth_range != /* ~ changed by cargo-mutants ~ */ 0 {
                     0.0
                 } else {
                     2.0 * f64::from(d_local) / f64::from(depth_range) - 1.0
                 };
                 (ln_att * q.mul_add(t, 1.0)).exp()
             })
             .collect();

---- tests::decay::decay_selective_q1_root_undecayed stdout ----

thread 'tests::decay::decay_selective_q1_root_undecayed' (1148639) panicked at packages/mudlark/src/tests/decay.rs:208:5:
at q=1.0, subtree root own should be unchanged

---- tests::decay::decay_single_node_selective stdout ----

thread 'tests::decay::decay_single_node_selective' (1148642) panicked at packages/mudlark/src/tests/decay.rs:469:5:
assertion `left == right` failed
  left: 50
 right: 87

failures:
    tests::decay::decay_selective_q1_root_undecayed
    tests::decay::decay_single_node_selective

test result: FAILED. 344 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
