*** packages/mudlark/src/decay.rs:219:25: replace * with + in GvGraph<C, V, N>::decay_selective

*** mutation diff:
--- packages/mudlark/src/decay.rs
+++ replace * with + in GvGraph<C, V, N>::decay_selective
@@ -211,17 +211,17 @@
         let ln_att = att.ln();
         let factors: Vec<f64> = (0..=depth_range)
             .map(|d_local| {
                 let t = if depth_range == 0 {
                     0.0
                 } else {
                     2.0 * f64::from(d_local) / f64::from(depth_range) - 1.0
                 };
-                (ln_att * q.mul_add(t, 1.0)).exp()
+                (ln_att + /* ~ changed by cargo-mutants ~ */ q.mul_add(t, 1.0)).exp()
             })
             .collect();
 
         // 2. DFS walk: collect nodes in pre-order for bottom-up
         //    reversal, scale g.own per depth.
         let mut order = Vec::new();
         let mut stack = vec![root];
         while let Some(gid) = stack.pop() {

---- tests::decay::decay_energy_conservation_selective stdout ----

thread 'tests::decay::decay_energy_conservation_selective' (1172815) panicked at packages/mudlark/src/tests/decay.rs:304:5:
expected ≈98.10180455785104, got 371 (tolerance 38)

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (1172814) panicked at packages/mudlark/src/tests/decay.rs:242:9:
G-node 0: own mismatch after composition: 111 vs 10 (diff 101)

---- tests::decay::decay_single_node_selective stdout ----

thread 'tests::decay::decay_single_node_selective' (1172839) panicked at packages/mudlark/src/tests/decay.rs:469:5:
assertion `left == right` failed
  left: 61
 right: 87

failures:
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_selective_q1_root_undecayed
    tests::decay::decay_single_node_selective

test result: FAILED. 342 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
