*** packages/mudlark/src/decay.rs:219:25: replace * with / in GvGraph<C, V, N>::decay_selective

*** mutation diff:
--- packages/mudlark/src/decay.rs
+++ replace * with / in GvGraph<C, V, N>::decay_selective
@@ -211,17 +211,17 @@
         let ln_att = att.ln();
         let factors: Vec<f64> = (0..=depth_range)
             .map(|d_local| {
                 let t = if depth_range == 0 {
                     0.0
                 } else {
                     2.0 * f64::from(d_local) / f64::from(depth_range) - 1.0
                 };
-                (ln_att * q.mul_add(t, 1.0)).exp()
+                (ln_att / /* ~ changed by cargo-mutants ~ */ q.mul_add(t, 1.0)).exp()
             })
             .collect();
 
         // 2. DFS walk: collect nodes in pre-order for bottom-up
         //    reversal, scale g.own per depth.
         let mut order = Vec::new();
         let mut stack = vec![root];
         while let Some(gid) = stack.pop() {

---- tests::decay::decay_selective_q1_root_undecayed stdout ----

thread 'tests::decay::decay_selective_q1_root_undecayed' (1177235) panicked at packages/mudlark/src/tests/decay.rs:208:5:
at q=1.0, subtree root own should be unchanged

---- tests::decay::decay_single_node_selective stdout ----

thread 'tests::decay::decay_single_node_selective' (1177238) panicked at packages/mudlark/src/tests/decay.rs:469:5:
assertion `left == right` failed
  left: 3
 right: 87

failures:
    tests::decay::decay_selective_q1_root_undecayed
    tests::decay::decay_single_node_selective

test result: FAILED. 344 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
