*** packages/mudlark/src/decay.rs:231:49: replace - with + in GvGraph<C, V, N>::decay_selective

*** mutation diff:
--- packages/mudlark/src/decay.rs
+++ replace - with + in GvGraph<C, V, N>::decay_selective
@@ -223,17 +223,17 @@
         // 2. DFS walk: collect nodes in pre-order for bottom-up
         //    reversal, scale g.own per depth.
         let mut order = Vec::new();
         let mut stack = vec![root];
         while let Some(gid) = stack.pop() {
             order.push(gid);
 
             let g = self.gnodes.get(gid.index());
-            let d_local = self.gnode_depth(gid) - d_root;
+            let d_local = self.gnode_depth(gid) + /* ~ changed by cargo-mutants ~ */ d_root;
             let factor = factors[d_local as usize];
 
             // Scale own.
             let new_own = g.own.attenuate(factor);
             // Drop immutable borrow before mutable access.
             let g = self.gnodes.get_mut(gid.index());
             g.own = new_own;

---- tests::decay::decay_selective_subtree_preserves_invariants stdout ----

thread 'tests::decay::decay_selective_subtree_preserves_invariants' (1179781) panicked at packages/mudlark/src/decay.rs:232:33:
index out of bounds: the len is 4 but the index is 4

---- tests::decay::decay_selective_subtree_leaves_other_half_unchanged stdout ----

thread 'tests::decay::decay_selective_subtree_leaves_other_half_unchanged' (1179780) panicked at packages/mudlark/src/decay.rs:232:33:
index out of bounds: the len is 4 but the index is 4

failures:
    tests::decay::decay_selective_subtree_leaves_other_half_unchanged
    tests::decay::decay_selective_subtree_preserves_invariants

test result: FAILED. 344 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
