*** packages/mudlark/src/decay.rs:254:12: delete ! in GvGraph<C, V, N>::decay_selective

*** mutation diff:
--- packages/mudlark/src/decay.rs
+++ delete ! in GvGraph<C, V, N>::decay_selective
@@ -246,17 +246,17 @@
                 stack.push(right);
             }
         }
 
         // 3. Recompute g.sum bottom-up within subtree.
         gtree::recompute_g_sums_subtree(&mut self.gnodes, &order);
 
         // 4. Propagate G-sums above the subtree.
-        if !is_global {
+        if  /* ~ changed by cargo-mutants ~ */is_global {
             if let Some(parent) = self.gnodes.get(root.index()).parent {
                 gtree::recompute_g_sums(&mut self.gnodes, parent);
             }
         }
 
         // 5. Sync V-entry intensities from g.own.
         for &gid in &order {
             let g = self.gnodes.get(gid.index());

---- tests::decay::decay_selective_subtree_leaves_other_half_unchanged stdout ----

thread 'tests::decay::decay_selective_subtree_leaves_other_half_unchanged' (1183730) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (2 total):
G-I1 violated at G-node 0: expected sum=365, actual sum=530 (own=20, left_sum=115, right_sum=230)
Clean accounting violated: V-entry sum=365, G-root sum=530

---- tests::decay::decay_selective_subtree_preserves_invariants stdout ----

thread 'tests::decay::decay_selective_subtree_preserves_invariants' (1183731) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (2 total):
G-I1 violated at G-node 0: expected sum=365, actual sum=530 (own=20, left_sum=115, right_sum=230)
Clean accounting violated: V-entry sum=365, G-root sum=530

failures:
    tests::decay::decay_selective_subtree_leaves_other_half_unchanged
    tests::decay::decay_selective_subtree_preserves_invariants

test result: FAILED. 344 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
