*** packages/mudlark/src/decay.rs:99:24: replace == with != in GvGraph<C, V, N>::decay

*** mutation diff:
--- packages/mudlark/src/decay.rs
+++ replace == with != in GvGraph<C, V, N>::decay
@@ -91,17 +91,17 @@
         );
         assert!(
             (0.0..=1.0).contains(&q) && !q.is_nan(),
             "decay: q must be in [0.0, 1.0] and not NaN, got {q}"
         );
 
         // No-op: factor of exactly 1.0 changes nothing.
         #[allow(clippy::float_cmp)] // Intentional exact comparison for the no-op case.
-        if attenuation == 1.0 {
+        if attenuation != /* ~ changed by cargo-mutants ~ */ 1.0 {
             return;
         }
 
         let is_global = root == self.g_root;
 
         let _span = tracing::debug_span!("decay", root = root.index(), attenuation, q,).entered();
 
         if q == 0.0 {

---- tests::decay::decay_energy_conservation_selective stdout ----

thread 'tests::decay::decay_energy_conservation_selective' (1113317) panicked at packages/mudlark/src/tests/decay.rs:304:5:
expected ≈98.10180455785104, got 180 (tolerance 38)

---- tests::decay::decay_amplification_above_one stdout ----

thread 'tests::decay::decay_amplification_above_one' (1113315) panicked at packages/mudlark/src/tests/decay.rs:363:5:
amplification should increase energy

---- tests::decay::decay_energy_conservation_uniform stdout ----

thread 'tests::decay::decay_energy_conservation_uniform' (1113318) panicked at packages/mudlark/src/tests/decay.rs:264:5:
expected ≈135, got 180 (tolerance 19)

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_single_node_selective
    tests::decay::decay_single_node_tree
    tests::decay::decay_uniform_global_all_own_scaled
    tests::decay::decay_uniform_global_scales_all_nodes
    tests::decay::decay_updates_plateau_sums

test result: FAILED. 337 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
