*** packages/mudlark/src/diagnostic.rs:273:17: delete match arm 2 in diagnose_missed_violation

*** mutation diff:
--- packages/mudlark/src/diagnostic.rs
+++ delete match arm 2 in diagnose_missed_violation
@@ -265,17 +265,17 @@
     let _ancestry_span = tracing::error_span!("vtree_path_to_violated", node = violated.index()).entered();
     let mut current = violated;
     let mut depth = 0_usize;
     loop {
         let n = vnodes.get(current.index());
         let kind = match &n.kind {
             VKind::Entry { .. } => "E",
             VKind::Structural { children, .. } => match children.len() {
-                2 => "S2",
+                 /* ~ changed by cargo-mutants ~ */
                 3 => "S3",
                 _ => "S?",
             },
         };
         tracing::error!(
             depth,
             node = current.index(),
             kind,

*** result: Success
