*** packages/mudlark/src/evict.rs:160:13: delete match arm 3 in evict_tip

*** mutation diff:
--- packages/mudlark/src/evict.rs
+++ delete match arm 3 in evict_tip
@@ -152,17 +152,17 @@
     // for source-7 violation checking (§IDEA M-11.11.3).
     let v_parent = graph.vnodes.get(v_id.index()).parent;
     let (child_count, change_point, collapse_sibling) = v_parent.map_or((0, None, None), |p| {
         let count = match &graph.vnodes.get(p.index()).kind {
             VKind::Structural { children, .. } => children.len(),
             VKind::Entry { .. } => 0,
         };
         match count {
-            3 => (3, Some(p), None), // 3→2: parent survives
+             /* ~ changed by cargo-mutants ~ */ // 3→2: parent survives
             2 => {
                 // 2-node collapse: find the surviving sibling.
                 let sibling = match &graph.vnodes.get(p.index()).kind {
                     VKind::Structural { children, .. } => {
                         // Find the child that is NOT v_id.
                         let (c0, _) = children.get(0);
                         let (c1, _) = children.get(1);
                         if c0 == v_id {

*** result: Success
