*** packages/mudlark/src/evict.rs:168:31: replace == with != in evict_tip

*** mutation diff:
--- packages/mudlark/src/evict.rs
+++ replace == with != in evict_tip
@@ -160,17 +160,17 @@
             3 => (3, Some(p), None), // 3→2: parent survives
             2 => {
                 // 2-node collapse: find the surviving sibling.
                 let sibling = match &graph.vnodes.get(p.index()).kind {
                     VKind::Structural { children, .. } => {
                         // Find the child that is NOT v_id.
                         let (c0, _) = children.get(0);
                         let (c1, _) = children.get(1);
-                        if c0 == v_id {
+                        if c0 != /* ~ changed by cargo-mutants ~ */ v_id {
                             Some(c1)
                         } else {
                             Some(c0)
                         }
                     }
                     VKind::Entry { .. } => None,
                 };
                 (2, graph.vnodes.get(p.index()).parent, sibling) // collapse: grandparent

---- tests::diagnostic::catalytic_split_creates_span stdout ----

thread 'tests::diagnostic::catalytic_split_creates_span' (1289888) panicked at packages/mudlark/src/tests/diagnostic.rs:310:5:
expected 'catalytic_split' span in: ["bootstrap_split", "plateau_after_bootstrap_split", "rebalance", "normalize_plateaus", "rebalance", "normalize_plateaus", "rebalance", "normalize_plateaus"]

---- tests::diagnostic::eviction_pipeline_creates_spans stdout ----

thread 'tests::diagnostic::eviction_pipeline_creates_spans' (1289891) panicked at packages/mudlark/src/arena.rs:93:9:
Arena::get: slot 10 is not occupied

---- tests::diagnostic::evict_tip_creates_span stdout ----

thread 'tests::diagnostic::evict_tip_creates_span' (1289890) panicked at packages/mudlark/src/arena.rs:93:9:
Arena::get: slot 10 is not occupied

failures:
    tests::diagnostic::catalytic_split_creates_span
    tests::diagnostic::evict_tip_creates_span
    tests::diagnostic::eviction_pipeline_creates_spans
    tests::diagnostic::vtree_remove_leaf_creates_span
    tests::evict::evict_after_observations_conserves_energy
    tests::evict::evict_both_children_makes_parent_terminal
    tests::evict::evict_single_terminal_child
    tests::evict::evict_to_semi_internal_creates_thatch
    tests::evict::evict_to_terminal_destroys_thatch
    tests::graph::check_evictions_bounded_respects_limit
    tests::graph::check_evictions_return_value_matches_count_delta
    tests::graph::check_evictions_trailing_rebalance_clears_violations

test result: FAILED. 326 passed; 20 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.14s

*** result: Failure(101)
