*** packages/mudlark/src/evict.rs:270:22: replace -= with += in evict_tip

*** mutation diff:
--- packages/mudlark/src/evict.rs
+++ replace -= with += in evict_tip
@@ -262,17 +262,17 @@
     // Snapshot parent state before deallocation for plateau maintenance.
     #[cfg(feature = "dynamic-contour-tracking")]
     let parent_snapshot = {
         let pg = graph.gnodes.get(parent_id.index());
         (pg.state(), pg.lo, pg.hi)
     };
 
     graph.gnodes.dealloc(gnode_id.index());
-    graph.node_count -= 1;
+    graph.node_count += /* ~ changed by cargo-mutants ~ */ 1;
     // The evicted node was a terminal: −1.
     // If the parent is now terminal (both children gone): +1 → net 0.
     graph.terminal_count -= 1;
     if graph.gnodes.get(parent_id.index()).is_terminal() {
         graph.terminal_count += 1;
     }
 
     // 8. Plateau maintenance (no-op without `plateau` feature).

---- tests::evict::evict_after_observations_conserves_energy stdout ----

thread 'tests::evict::evict_after_observations_conserves_energy' (1298184) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
Node count: graph.node_count()=4, arena count=2

---- tests::evict::evict_both_children_makes_parent_terminal stdout ----

thread 'tests::evict::evict_both_children_makes_parent_terminal' (1298185) panicked at packages/mudlark/src/tests/evict.rs:78:5:
assertion `left == right` failed
  left: 4
 right: 2

---- tests::evict::evict_single_terminal_child stdout ----

thread 'tests::evict::evict_single_terminal_child' (1298186) panicked at packages/mudlark/src/tests/evict.rs:49:5:
assertion `left == right` failed
  left: 4
 right: 2

failures:
    tests::evict::evict_after_observations_conserves_energy
    tests::evict::evict_both_children_makes_parent_terminal
    tests::evict::evict_single_terminal_child
    tests::evict::evict_to_semi_internal_creates_thatch
    tests::evict::evict_to_terminal_destroys_thatch
    tests::graph::check_evictions_bounded_respects_limit
    tests::graph::check_evictions_return_value_matches_count_delta
    tests::graph::check_evictions_trailing_rebalance_clears_violations
    tests::graph::check_evictions_unbounded_evicts_all
    tests::graph::get_semi_internal_depth_is_trimmed_depth
    tests::graph::get_semi_internal_left_child_trims_right
    tests::graph::get_semi_internal_right_child_trims_left

test result: FAILED. 330 passed; 16 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
