*** packages/mudlark/src/evict.rs:273:26: replace -= with += in evict_tip

*** mutation diff:
--- packages/mudlark/src/evict.rs
+++ replace -= with += in evict_tip
@@ -265,17 +265,17 @@
         let pg = graph.gnodes.get(parent_id.index());
         (pg.state(), pg.lo, pg.hi)
     };
 
     graph.gnodes.dealloc(gnode_id.index());
     graph.node_count -= 1;
     // The evicted node was a terminal: −1.
     // If the parent is now terminal (both children gone): +1 → net 0.
-    graph.terminal_count -= 1;
+    graph.terminal_count += /* ~ changed by cargo-mutants ~ */ 1;
     if graph.gnodes.get(parent_id.index()).is_terminal() {
         graph.terminal_count += 1;
     }
 
     // 8. Plateau maintenance (no-op without `plateau` feature).
     #[cfg(feature = "dynamic-contour-tracking")]
     {
         let (parent_state_after, parent_lo, parent_hi) = parent_snapshot;

---- tests::evict::evict_after_observations_conserves_energy stdout ----

thread 'tests::evict::evict_after_observations_conserves_energy' (1306098) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
Terminal count: graph.terminal_count()=3, arena walk=1

---- tests::evict::evict_to_semi_internal_creates_thatch stdout ----

thread 'tests::evict::evict_to_semi_internal_creates_thatch' (1306101) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
Terminal count: graph.terminal_count()=3, arena walk=1

---- tests::evict::evict_to_terminal_destroys_thatch stdout ----

thread 'tests::evict::evict_to_terminal_destroys_thatch' (1306102) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
Terminal count: graph.terminal_count()=3, arena walk=1

failures:
    tests::evict::evict_after_observations_conserves_energy
    tests::evict::evict_both_children_makes_parent_terminal
    tests::evict::evict_single_terminal_child
    tests::evict::evict_to_semi_internal_creates_thatch
    tests::evict::evict_to_terminal_destroys_thatch
    tests::graph::check_evictions_bounded_respects_limit
    tests::graph::check_evictions_trailing_rebalance_clears_violations
    tests::graph::check_evictions_unbounded_evicts_all
    tests::graph::get_semi_internal_depth_is_trimmed_depth
    tests::graph::get_semi_internal_left_child_trims_right
    tests::graph::get_semi_internal_right_child_trims_left
    tests::observe::observe_invariants_hold_after_eviction_cycle

test result: FAILED. 331 passed; 15 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
