*** packages/mudlark/src/evict.rs:275:30: replace += with *= in evict_tip

*** mutation diff:
--- packages/mudlark/src/evict.rs
+++ replace += with *= in evict_tip
@@ -267,17 +267,17 @@
     };
 
     graph.gnodes.dealloc(gnode_id.index());
     graph.node_count -= 1;
     // The evicted node was a terminal: −1.
     // If the parent is now terminal (both children gone): +1 → net 0.
     graph.terminal_count -= 1;
     if graph.gnodes.get(parent_id.index()).is_terminal() {
-        graph.terminal_count += 1;
+        graph.terminal_count *= /* ~ changed by cargo-mutants ~ */ 1;
     }
 
     // 8. Plateau maintenance (no-op without `plateau` feature).
     #[cfg(feature = "dynamic-contour-tracking")]
     {
         let (parent_state_after, parent_lo, parent_hi) = parent_snapshot;
         plateau_after_evict(graph, gnode_id, parent_id, parent_state_after, parent_lo, parent_hi);

---- tests::evict::evict_both_children_makes_parent_terminal stdout ----

thread 'tests::evict::evict_both_children_makes_parent_terminal' (1313850) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
Terminal count: graph.terminal_count()=0, arena walk=1

---- tests::graph::check_evictions_trailing_rebalance_clears_violations stdout ----

thread 'tests::graph::check_evictions_trailing_rebalance_clears_violations' (1313882) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
Terminal count: graph.terminal_count()=0, arena walk=3

---- tests::graph::get_semi_internal_right_child_trims_left stdout ----

thread 'tests::graph::get_semi_internal_right_child_trims_left' (1313898) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
Terminal count: graph.terminal_count()=0, arena walk=3

failures:
    tests::evict::evict_both_children_makes_parent_terminal
    tests::evict::evict_to_terminal_destroys_thatch
    tests::graph::check_evictions_trailing_rebalance_clears_violations
    tests::graph::check_evictions_unbounded_evicts_all
    tests::graph::get_semi_internal_depth_is_trimmed_depth
    tests::graph::get_semi_internal_left_child_trims_right
    tests::graph::get_semi_internal_right_child_trims_left
    tests::observe::observe_invariants_hold_after_eviction_cycle

test result: FAILED. 338 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
