*** packages/mudlark/src/evict.rs:355:31: replace == with != in plateau_after_evict

*** mutation diff:
--- packages/mudlark/src/evict.rs
+++ replace == with != in plateau_after_evict
@@ -347,17 +347,17 @@
     let mut displaced_extra: Vec<(crate::handle::GNodeId, u32)> = Vec::new();
 
     let ancestor_key = if let Some(key) = graph.plateau_basis.remove(parent_id) {
         // Case (a): parent was the basis element.
 
         // If parent was Internal → SemiInternal, the surviving
         // child was covered by the parent and needs its own
         // basis element.
-        if parent_state_after == GState::SemiInternal {
+        if parent_state_after != /* ~ changed by cargo-mutants ~ */ GState::SemiInternal {
             let g = graph.gnodes.get(parent_id.index());
             if let Some(sib) = g.left.or(g.right) {
                 // Remove from current plateau if already a basis element.
                 if let Some(ok) = graph.plateau_basis.remove(sib) {
                     graph.fixup_plateau(ok);
                 }
                 displaced.push(sib);
             }

---- tests::diagnostic::evict_tip_creates_span stdout ----

thread 'tests::diagnostic::evict_tip_creates_span' (1323767) panicked at packages/mudlark/src/graph_plateau.rs:193:13:
POST-EVICT-SINGLE-1: dynamic-contour-tracking mirror diverged from static rebuild
left (dynamic): {
    BasisEdge(
        0,
    ): Plateau {
        basis_edge: BasisEdge(
            0,
        ),
        start: 0,
        end: 64,
        depth: 4,

---- tests::diagnostic::eviction_pipeline_creates_spans stdout ----

thread 'tests::diagnostic::eviction_pipeline_creates_spans' (1323768) panicked at packages/mudlark/src/graph_plateau.rs:193:13:
POST-EVICT-SINGLE-1: dynamic-contour-tracking mirror diverged from static rebuild
left (dynamic): {
    BasisEdge(
        0,
    ): Plateau {
        basis_edge: BasisEdge(
            0,
        ),
        start: 0,
        end: 64,
        depth: 4,

---- tests::evict::evict_after_observations_conserves_energy stdout ----

thread 'tests::evict::evict_after_observations_conserves_energy' (1323791) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (3 total):
P-I1(i): plateau count (1) != contour step count (2)
P-I1(ii): plateau BasisEdge(0): tile union ends at 8, expected 16
P-I4 thatch one-hop: semi-internal GNodeId(1) in plateau BasisEdge(0) thatches child GNodeId(3), but child's plateau key BasisEdge(0) == parent's

failures:
    tests::diagnostic::evict_tip_creates_span
    tests::diagnostic::eviction_pipeline_creates_spans
    tests::diagnostic::vtree_remove_leaf_creates_span
    tests::evict::evict_after_observations_conserves_energy
    tests::evict::evict_both_children_makes_parent_terminal
    tests::evict::evict_single_terminal_child
    tests::evict::evict_to_semi_internal_creates_thatch
    tests::evict::evict_to_terminal_destroys_thatch
    tests::graph::check_evictions_return_value_matches_count_delta
    tests::graph::check_evictions_trailing_rebalance_clears_violations
    tests::graph::check_evictions_unbounded_evicts_all
    tests::graph::get_semi_internal_depth_is_trimmed_depth

test result: FAILED. 328 passed; 18 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
