*** packages/mudlark/src/evict.rs:390:46: replace >= with < in plateau_after_evict

*** mutation diff:
--- packages/mudlark/src/evict.rs
+++ replace >= with < in plateau_after_evict
@@ -382,17 +382,17 @@
                 // Candidate ancestor found. Check if its tile
                 // actually covers the parent's basis edge:
                 // tile = [anc_key, next_key_in_btreemap)
                 let next_key = graph
                     .plateaus
                     .range((std::ops::Bound::Excluded(anc_key), std::ops::Bound::Unbounded))
                     .next()
                     .map(|(&k, _)| k);
-                let tile_covers = parent_key >= anc_key && next_key.map_or(true, |nk| parent_key < nk);
+                let tile_covers = parent_key < /* ~ changed by cargo-mutants ~ */ anc_key && next_key.map_or(true, |nk| parent_key < nk);
 
                 if tile_covers {
                     // Case (b): ancestor's tile covers parent.
                     // Now remove it and decompose.
                     graph.plateau_basis.remove(anc);
 
                     // Surviving child at parent level.
                     if parent_state_after == GState::SemiInternal {

---- tests::graph::get_semi_internal_right_child_trims_left stdout ----
2026-03-16T21:13:39.343817Z ERROR torrust_mudlark::graph_plateau: PLATEAU DIVERGENCE DETECTED label="POST-EVICT-SINGLE-1" only_dynamic=[] only_static=[BasisEdge(160)] differing=[BasisEdge(64)]
2026-03-16T21:13:39.343846Z ERROR torrust_mudlark::graph_plateau: STATIC-ONLY plateau key=BasisEdge(160) depth=3 start=160 end=256 sum=12
2026-03-16T21:13:39.343851Z ERROR torrust_mudlark::graph_plateau: DIFFERS key=BasisEdge(64) dyn_depth=3 dyn_start=64 dyn_end=256 dyn_sum=30 stat_depth=3 stat_start=64 stat_end=128 stat_sum=6 basis=[2, 6]
2026-03-16T21:13:39.343856Z ERROR torrust_mudlark::graph_plateau:   basis element gid=2 state=Internal lo=128 hi=256 sum=24 uniform_depth=None
2026-03-16T21:13:39.343861Z ERROR torrust_mudlark::graph_plateau:   basis element gid=6 state=Internal lo=64 hi=128 sum=6 uniform_depth=Some(3)
2026-0

---- tests::graph::check_evictions_bounded_respects_limit stdout ----
2026-03-16T21:13:39.347842Z ERROR torrust_mudlark::graph_plateau: PLATEAU DIVERGENCE DETECTED label="POST-EVICT-SINGLE-1" only_dynamic=[] only_static=[BasisEdge(160)] differing=[BasisEdge(64)]
2026-03-16T21:13:39.347873Z ERROR torrust_mudlark::graph_plateau: STATIC-ONLY plateau key=BasisEdge(160) depth=3 start=160 end=256 sum=12
2026-03-16T21:13:39.347879Z ERROR torrust_mudlark::graph_plateau: DIFFERS key=BasisEdge(64) dyn_depth=3 dyn_start=64 dyn_end=256 dyn_sum=30 stat_depth=3 stat_start=64 stat_end=128 stat_sum=6 basis=[6, 2]
2026-03-16T21:13:39.347886Z ERROR torrust_mudlark::graph_plateau:   basis element gid=6 state=Internal lo=64 hi=128 sum=6 uniform_depth=Some(3)
2026-03-16T21:13:39.347891Z ERROR torrust_mudlark::graph_plateau:   basis element gid=2 state=Internal lo=128 hi=256 sum=24 uniform_depth=None
2026-03-

---- tests::graph::get_semi_internal_depth_is_trimmed_depth stdout ----
2026-03-16T21:13:39.349864Z ERROR torrust_mudlark::graph_plateau: PLATEAU DIVERGENCE DETECTED label="POST-EVICT-SINGLE-1" only_dynamic=[] only_static=[BasisEdge(160)] differing=[BasisEdge(64)]
2026-03-16T21:13:39.349882Z ERROR torrust_mudlark::graph_plateau: STATIC-ONLY plateau key=BasisEdge(160) depth=3 start=160 end=256 sum=12
2026-03-16T21:13:39.349886Z ERROR torrust_mudlark::graph_plateau: DIFFERS key=BasisEdge(64) dyn_depth=3 dyn_start=64 dyn_end=256 dyn_sum=30 stat_depth=3 stat_start=64 stat_end=128 stat_sum=6 basis=[6, 2]
2026-03-16T21:13:39.349890Z ERROR torrust_mudlark::graph_plateau:   basis element gid=6 state=Internal lo=64 hi=128 sum=6 uniform_depth=Some(3)
2026-03-16T21:13:39.349894Z ERROR torrust_mudlark::graph_plateau:   basis element gid=2 state=Internal lo=128 hi=256 sum=24 uniform_depth=None
2026-0

failures:
    tests::graph::check_evictions_bounded_respects_limit
    tests::graph::check_evictions_return_value_matches_count_delta
    tests::graph::check_evictions_trailing_rebalance_clears_violations
    tests::graph::check_evictions_unbounded_evicts_all
    tests::graph::get_semi_internal_depth_is_trimmed_depth
    tests::graph::get_semi_internal_left_child_trims_right
    tests::graph::get_semi_internal_right_child_trims_left
    tests::structural::semi_internal_surviving_child_unaffected

test result: FAILED. 338 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
