*** packages/mudlark/src/evict.rs:390:57: replace && with || in plateau_after_evict

*** mutation diff:
--- packages/mudlark/src/evict.rs
+++ replace && with || in plateau_after_evict
@@ -382,17 +382,17 @@
                 // Candidate ancestor found. Check if its tile
                 // actually covers the parent's basis edge:
                 // tile = [anc_key, next_key_in_btreemap)
                 let next_key = graph
                     .plateaus
                     .range((std::ops::Bound::Excluded(anc_key), std::ops::Bound::Unbounded))
                     .next()
                     .map(|(&k, _)| k);
-                let tile_covers = parent_key >= anc_key && next_key.map_or(true, |nk| parent_key < nk);
+                let tile_covers = parent_key >= anc_key || /* ~ changed by cargo-mutants ~ */ next_key.map_or(true, |nk| parent_key < nk);
 
                 if tile_covers {
                     // Case (b): ancestor's tile covers parent.
                     // Now remove it and decompose.
                     graph.plateau_basis.remove(anc);
 
                     // Surviving child at parent level.
                     if parent_state_after == GState::SemiInternal {

---- tests::structural::semi_internal_surviving_child_unaffected stdout ----
2026-03-16T21:13:36.000378Z ERROR torrust_mudlark::graph_plateau: PLATEAU DIVERGENCE DETECTED label="POST-EVICT-SINGLE-1" only_dynamic=[] only_static=[BasisEdge(32)] differing=[]
2026-03-16T21:13:36.000395Z ERROR torrust_mudlark::graph_plateau: STATIC-ONLY plateau key=BasisEdge(32) depth=2 start=0 end=64 sum=42
2026-03-16T21:13:36.000421Z ERROR torrust_mudlark::graph_plateau: G-TREE DUMP dump=═══ G-Tree dump (root=GNodeId(0), 6 nodes) ═══
  G(  0) S [   0.0,  256.0)  d=0  par=None  L=1 R=_  sum=    54.0 own=     6.0  basis=BasisEdge(128)
  G(  1) S [   0.0,  128.0)  d=1  par=0  L=3 R=_  sum=    48.0 own=     6.0  basis=BasisEdge(64)  [SI-child (par=G(0))]
  G(  2) S [   0.0,   16.0)  d=4  par=5  L=_ R=7  sum=    12.0 own=     6.0  basis=BasisEdge(0)  [SI-child (par=G(5)); parent is SI-child (G(5) under G(3)); gr

failures:
    tests::structural::semi_internal_surviving_child_unaffected

test result: FAILED. 345 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
