*** packages/mudlark/src/evict.rs:390:98: replace < with > in plateau_after_evict

*** mutation diff:
--- packages/mudlark/src/evict.rs
+++ replace < with > in plateau_after_evict
@@ -382,17 +382,17 @@
                 // Candidate ancestor found. Check if its tile
                 // actually covers the parent's basis edge:
                 // tile = [anc_key, next_key_in_btreemap)
                 let next_key = graph
                     .plateaus
                     .range((std::ops::Bound::Excluded(anc_key), std::ops::Bound::Unbounded))
                     .next()
                     .map(|(&k, _)| k);
-                let tile_covers = parent_key >= anc_key && next_key.map_or(true, |nk| parent_key < nk);
+                let tile_covers = parent_key >= anc_key && next_key.map_or(true, |nk| parent_key > /* ~ changed by cargo-mutants ~ */ nk);
 
                 if tile_covers {
                     // Case (b): ancestor's tile covers parent.
                     // Now remove it and decompose.
                     graph.plateau_basis.remove(anc);
 
                     // Surviving child at parent level.
                     if parent_state_after == GState::SemiInternal {

---- bench_mirrors::lifecycle::mirror_lifecycle_eviction stdout ----
2026-03-16T21:13:42.345592Z ERROR torrust_mudlark::graph_plateau: PLATEAU DIVERGENCE DETECTED label="POST-EVICT-SINGLE-1" only_dynamic=[] only_static=[BasisEdge(221)] differing=[BasisEdge(218)]
2026-03-16T21:13:42.345610Z ERROR torrust_mudlark::graph_plateau: STATIC-ONLY plateau key=BasisEdge(221) depth=8 start=221 end=224 sum=12
2026-03-16T21:13:42.345614Z ERROR torrust_mudlark::graph_plateau: DIFFERS key=BasisEdge(218) dyn_depth=8 dyn_start=218 dyn_end=224 dyn_sum=36 stat_depth=8 stat_start=218 stat_end=220 stat_sum=12 basis=[358, 356]
2026-03-16T21:13:42.345617Z ERROR torrust_mudlark::graph_plateau:   basis element gid=358 state=Internal lo=218 hi=220 sum=12 uniform_depth=Some(8)
2026-03-16T21:13:42.345620Z ERROR torrust_mudlark::graph_plateau:   basis element gid=356 state=Internal lo=220 hi=224 sum=24 uniform_depth

---- bench_mirrors::lifecycle::mirror_lifecycle_decay_evict stdout ----
2026-03-16T21:13:42.379031Z ERROR torrust_mudlark::graph_plateau: PLATEAU DIVERGENCE DETECTED label="POST-EVICT-SINGLE-1" only_dynamic=[] only_static=[BasisEdge(221)] differing=[BasisEdge(218)]
2026-03-16T21:13:42.379046Z ERROR torrust_mudlark::graph_plateau: STATIC-ONLY plateau key=BasisEdge(221) depth=8 start=221 end=224 sum=12
2026-03-16T21:13:42.379051Z ERROR torrust_mudlark::graph_plateau: DIFFERS key=BasisEdge(218) dyn_depth=8 dyn_start=218 dyn_end=224 dyn_sum=36 stat_depth=8 stat_start=218 stat_end=220 stat_sum=12 basis=[356, 358]
2026-03-16T21:13:42.379055Z ERROR torrust_mudlark::graph_plateau:   basis element gid=356 state=Internal lo=220 hi=224 sum=24 uniform_depth=None
2026-03-16T21:13:42.379058Z ERROR torrust_mudlark::graph_plateau:   basis element gid=358 state=Internal lo=218 hi=220 sum=12 uniform_depth

---- bench_mirrors::pathological::mirror_pathological_budget_burst stdout ----
2026-03-16T21:13:42.384826Z ERROR torrust_mudlark::graph_plateau: PLATEAU DIVERGENCE DETECTED label="POST-EVICT-SINGLE-1" only_dynamic=[] only_static=[BasisEdge(221)] differing=[BasisEdge(218)]
2026-03-16T21:13:42.384840Z ERROR torrust_mudlark::graph_plateau: STATIC-ONLY plateau key=BasisEdge(221) depth=8 start=221 end=224 sum=12
2026-03-16T21:13:42.384845Z ERROR torrust_mudlark::graph_plateau: DIFFERS key=BasisEdge(218) dyn_depth=8 dyn_start=218 dyn_end=224 dyn_sum=36 stat_depth=8 stat_start=218 stat_end=220 stat_sum=12 basis=[356, 358]
2026-03-16T21:13:42.384850Z ERROR torrust_mudlark::graph_plateau:   basis element gid=356 state=Internal lo=220 hi=224 sum=24 uniform_depth=None
2026-03-16T21:13:42.384853Z ERROR torrust_mudlark::graph_plateau:   basis element gid=358 state=Internal lo=218 hi=220 sum=12 unifor

failures:
    bench_mirrors::lifecycle::mirror_lifecycle_decay_evict
    bench_mirrors::lifecycle::mirror_lifecycle_eviction
    bench_mirrors::lifecycle::mirror_lifecycle_eviction_skewed
    bench_mirrors::observe::mirror_observe_spread_budgeted
    bench_mirrors::pathological::mirror_pathological_budget_burst
    bench_mirrors::spray::mirror_spray_interleave
    bench_mirrors::spray::mirror_spray_scaling_budget
    bench_mirrors::spray::mirror_spray_steady_state

test result: FAILED. 35 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.36s

*** result: Failure(101)
