*** packages/mudlark/src/evict.rs:390:98: replace < with <= in plateau_after_evict

*** mutation diff:
--- packages/mudlark/src/evict.rs
+++ replace < with <= in plateau_after_evict
@@ -382,17 +382,17 @@
                 // Candidate ancestor found. Check if its tile
                 // actually covers the parent's basis edge:
                 // tile = [anc_key, next_key_in_btreemap)
                 let next_key = graph
                     .plateaus
                     .range((std::ops::Bound::Excluded(anc_key), std::ops::Bound::Unbounded))
                     .next()
                     .map(|(&k, _)| k);
-                let tile_covers = parent_key >= anc_key && next_key.map_or(true, |nk| parent_key < nk);
+                let tile_covers = parent_key >= anc_key && next_key.map_or(true, |nk| parent_key <= /* ~ changed by cargo-mutants ~ */ nk);
 
                 if tile_covers {
                     // Case (b): ancestor's tile covers parent.
                     // Now remove it and decompose.
                     graph.plateau_basis.remove(anc);
 
                     // Surviving child at parent level.
                     if parent_state_after == GState::SemiInternal {

---- budget_bounded_eviction_converges stdout ----
2026-03-16T21:13:47.628299Z ERROR torrust_mudlark::graph_plateau: PLATEAU DIVERGENCE DETECTED label="POST-EVICT-SINGLE-3" only_dynamic=[] only_static=[BasisEdge(0)] differing=[]
2026-03-16T21:13:47.628312Z ERROR torrust_mudlark::graph_plateau: STATIC-ONLY plateau key=BasisEdge(0) depth=4 start=0 end=16 sum=31
2026-03-16T21:13:47.628359Z ERROR torrust_mudlark::graph_plateau: G-TREE DUMP dump=═══ G-Tree dump (root=GNodeId(0), 19 nodes) ═══
  G(  0) S [   0.0,  256.0)  d=0  par=None  L=1 R=_  sum=   189.0 own=     6.0  basis=BasisEdge(128)
  G(  1) I [   0.0,  128.0)  d=1  par=0  L=3 R=4  sum=   183.0 own=     9.0  (not basis)  [SI-child (par=G(0))]
  G(  3) I [   0.0,   64.0)  d=2  par=1  L=5 R=22  sum=   174.0 own=    11.0  (not basis)  [parent is SI-child (G(1) under G(0))]
  G(  4) T [  64.0,  128.0)  d=2  par=1  L=_ R=_  sum=     0.0 o

---- energy_conserved_with_budget stdout ----
2026-03-16T21:13:47.628462Z ERROR torrust_mudlark::graph_plateau: PLATEAU DIVERGENCE DETECTED label="POST-EVICT-SINGLE-3" only_dynamic=[] only_static=[BasisEdge(0)] differing=[]
2026-03-16T21:13:47.628468Z ERROR torrust_mudlark::graph_plateau: STATIC-ONLY plateau key=BasisEdge(0) depth=4 start=0 end=16 sum=31
2026-03-16T21:13:47.628504Z ERROR torrust_mudlark::graph_plateau: G-TREE DUMP dump=═══ G-Tree dump (root=GNodeId(0), 19 nodes) ═══
  G(  0) S [   0.0,  256.0)  d=0  par=None  L=1 R=_  sum=   189.0 own=     6.0  basis=BasisEdge(128)
  G(  1) I [   0.0,  128.0)  d=1  par=0  L=3 R=4  sum=   183.0 own=     9.0  (not basis)  [SI-child (par=G(0))]
  G(  3) I [   0.0,   64.0)  d=2  par=1  L=5 R=22  sum=   174.0 own=    11.0  (not basis)  [parent is SI-child (G(1) under G(0))]
  G(  4) T [  64.0,  128.0)  d=2  par=1  L=_ R=_  sum=     0.0 own=

---- budget_converges_under_500_observations stdout ----
2026-03-16T21:13:47.629351Z ERROR torrust_mudlark::graph_plateau: PLATEAU DIVERGENCE DETECTED label="POST-EVICT-SINGLE-3" only_dynamic=[] only_static=[BasisEdge(0)] differing=[]
2026-03-16T21:13:47.629363Z ERROR torrust_mudlark::graph_plateau: STATIC-ONLY plateau key=BasisEdge(0) depth=4 start=0 end=16 sum=31
2026-03-16T21:13:47.629410Z ERROR torrust_mudlark::graph_plateau: G-TREE DUMP dump=═══ G-Tree dump (root=GNodeId(0), 19 nodes) ═══
  G(  0) S [   0.0,  256.0)  d=0  par=None  L=1 R=_  sum=   189.0 own=     6.0  basis=BasisEdge(128)
  G(  1) I [   0.0,  128.0)  d=1  par=0  L=3 R=4  sum=   183.0 own=     9.0  (not basis)  [SI-child (par=G(0))]
  G(  3) I [   0.0,   64.0)  d=2  par=1  L=5 R=22  sum=   174.0 own=    11.0  (not basis)  [parent is SI-child (G(1) under G(0))]
  G(  4) T [  64.0,  128.0)  d=2  par=1  L=_ R=_  sum=

failures:
    bounded_and_unbounded_both_respect_hard_limit
    budget_200_sustained_load
    budget_50_tight_small_buffer
    budget_bounded_eviction_converges
    budget_converges_under_500_observations
    energy_conserved_with_budget
    gate_oscillation_near_budget_boundary
    hard_budget_ceiling_is_tight
    hard_budget_never_exceeded
    hard_budget_never_exceeded_bounded
    invariants_hold_through_growth_and_contraction

test result: FAILED. 13 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
