*** packages/mudlark/src/evict.rs:398:43: replace == with != in plateau_after_evict

*** mutation diff:
--- packages/mudlark/src/evict.rs
+++ replace == with != in plateau_after_evict
@@ -390,17 +390,17 @@
                 let tile_covers = parent_key >= anc_key && next_key.map_or(true, |nk| parent_key < nk);
 
                 if tile_covers {
                     // Case (b): ancestor's tile covers parent.
                     // Now remove it and decompose.
                     graph.plateau_basis.remove(anc);
 
                     // Surviving child at parent level.
-                    if parent_state_after == GState::SemiInternal {
+                    if parent_state_after != /* ~ changed by cargo-mutants ~ */ GState::SemiInternal {
                         let g = graph.gnodes.get(parent_id.index());
                         if let Some(sib) = g.left.or(g.right) {
                             if let Some(ok) = graph.plateau_basis.remove(sib) {
                                 graph.fixup_plateau(ok);
                             }
                             displaced.push(sib);
                         }
                     }

---- tests::graph::check_evictions_bounded_respects_limit stdout ----
2026-03-16T21:13:48.396181Z ERROR torrust_mudlark::graph_plateau: PLATEAU DIVERGENCE DETECTED label="POST-EVICT-SINGLE-1" only_dynamic=[BasisEdge(192)] only_static=[BasisEdge(160)] differing=[]
2026-03-16T21:13:48.396198Z ERROR torrust_mudlark::graph_plateau: DYNAMIC-ONLY plateau key=BasisEdge(192) depth=3 start=192 end=256 sum=12 basis=[4]
2026-03-16T21:13:48.396203Z ERROR torrust_mudlark::graph_plateau:   basis element gid=4 state=Internal lo=192 hi=256 sum=12
2026-03-16T21:13:48.396208Z ERROR torrust_mudlark::graph_plateau: STATIC-ONLY plateau key=BasisEdge(160) depth=3 start=160 end=256 sum=12
2026-03-16T21:13:48.396226Z ERROR torrust_mudlark::graph_plateau: G-TREE DUMP dump=═══ G-Tree dump (root=GNodeId(0), 12 nodes) ═══
  G(  0) I [   0.0,  256.0)  d=0  par=None  L=1 R=2  sum=    48.0 own=     6.0  (not basis)

---- tests::graph::check_evictions_return_value_matches_count_delta stdout ----
2026-03-16T21:13:48.396229Z ERROR torrust_mudlark::graph_plateau: PLATEAU DIVERGENCE DETECTED label="POST-EVICT-SINGLE-1" only_dynamic=[BasisEdge(192)] only_static=[BasisEdge(160)] differing=[]
2026-03-16T21:13:48.396235Z ERROR torrust_mudlark::graph_plateau: DYNAMIC-ONLY plateau key=BasisEdge(192) depth=3 start=192 end=256 sum=12 basis=[4]
2026-03-16T21:13:48.396238Z ERROR torrust_mudlark::graph_plateau:   basis element gid=4 state=Internal lo=192 hi=256 sum=12
2026-03-16T21:13:48.396241Z ERROR torrust_mudlark::graph_plateau: STATIC-ONLY plateau key=BasisEdge(160) depth=3 start=160 end=256 sum=12
2026-03-16T21:13:48.396259Z ERROR torrust_mudlark::graph_plateau: G-TREE DUMP dump=═══ G-Tree dump (root=GNodeId(0), 12 nodes) ═══
  G(  0) I [   0.0,  256.0)  d=0  par=None  L=1 R=2  sum=    48.0 own=     6.0  (not

---- tests::graph::check_evictions_trailing_rebalance_clears_violations stdout ----
2026-03-16T21:13:48.396275Z ERROR torrust_mudlark::graph_plateau: PLATEAU DIVERGENCE DETECTED label="POST-EVICT-SINGLE-1" only_dynamic=[BasisEdge(192)] only_static=[BasisEdge(160)] differing=[]
2026-03-16T21:13:48.396281Z ERROR torrust_mudlark::graph_plateau: DYNAMIC-ONLY plateau key=BasisEdge(192) depth=3 start=192 end=256 sum=12 basis=[4]
2026-03-16T21:13:48.396285Z ERROR torrust_mudlark::graph_plateau:   basis element gid=4 state=Internal lo=192 hi=256 sum=12
2026-03-16T21:13:48.396287Z ERROR torrust_mudlark::graph_plateau: STATIC-ONLY plateau key=BasisEdge(160) depth=3 start=160 end=256 sum=12
2026-03-16T21:13:48.396309Z ERROR torrust_mudlark::graph_plateau: G-TREE DUMP dump=═══ G-Tree dump (root=GNodeId(0), 12 nodes) ═══
  G(  0) I [   0.0,  256.0)  d=0  par=None  L=1 R=2  sum=    48.0 own=     6.0

failures:
    tests::graph::check_evictions_bounded_respects_limit
    tests::graph::check_evictions_return_value_matches_count_delta
    tests::graph::check_evictions_trailing_rebalance_clears_violations
    tests::graph::check_evictions_unbounded_evicts_all
    tests::graph::get_semi_internal_depth_is_trimmed_depth
    tests::graph::get_semi_internal_left_child_trims_right
    tests::graph::get_semi_internal_right_child_trims_left

test result: FAILED. 339 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
