*** packages/mudlark/src/evict.rs:416:50: replace == with != in plateau_after_evict

*** mutation diff:
--- packages/mudlark/src/evict.rs
+++ replace == with != in plateau_after_evict
@@ -408,17 +408,17 @@
                     // Siblings along the walk path (parent → ancestor).
                     for &path_node in &path {
                         let par = graph
                             .gnodes
                             .get(path_node.index())
                             .parent
                             .expect("path node must have a parent");
                         let pg = graph.gnodes.get(par.index());
-                        let sibling = if pg.left == Some(path_node) { pg.right } else { pg.left };
+                        let sibling = if pg.left != /* ~ changed by cargo-mutants ~ */ Some(path_node) { pg.right } else { pg.left };
                         if let Some(sib_id) = sibling {
                             if displaced.contains(&sib_id) {
                                 continue;
                             }
                             if let Some(ok) = graph.plateau_basis.remove(sib_id) {
                                 graph.fixup_plateau(ok);
                             }
                             displaced.push(sib_id);

---- tests::graph::check_evictions_bounded_respects_limit stdout ----

thread 'tests::graph::check_evictions_bounded_respects_limit' (1340152) panicked at packages/mudlark/src/plateau.rs:334:9:
PlateauBasis::insert: gnode GNodeId(4) already in basis of plateau Some(BasisEdge(128))

---- tests::graph::check_evictions_return_value_matches_count_delta stdout ----

thread 'tests::graph::check_evictions_return_value_matches_count_delta' (1340154) panicked at packages/mudlark/src/plateau.rs:334:9:
PlateauBasis::insert: gnode GNodeId(4) already in basis of plateau Some(BasisEdge(128))

---- tests::graph::check_evictions_unbounded_evicts_all stdout ----

thread 'tests::graph::check_evictions_unbounded_evicts_all' (1340156) panicked at packages/mudlark/src/plateau.rs:334:9:
PlateauBasis::insert: gnode GNodeId(4) already in basis of plateau Some(BasisEdge(128))

failures:
    tests::graph::check_evictions_bounded_respects_limit
    tests::graph::check_evictions_return_value_matches_count_delta
    tests::graph::check_evictions_trailing_rebalance_clears_violations
    tests::graph::check_evictions_unbounded_evicts_all
    tests::graph::get_semi_internal_depth_is_trimmed_depth
    tests::graph::get_semi_internal_left_child_trims_right
    tests::graph::get_semi_internal_right_child_trims_left

test result: FAILED. 339 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
