*** packages/mudlark/src/evict.rs:450:24: replace != with == in plateau_after_evict

*** mutation diff:
--- packages/mudlark/src/evict.rs
+++ replace != with == in plateau_after_evict
@@ -442,17 +442,17 @@
     // Step 3 — Fixup: now that the ancestor walk is complete, we
     // can safely fix up the evicted child's old plateau AND the
     // ancestor's old plateau (if found).
     if let Some(ek) = evicted_key {
         graph.fixup_plateau(ek);
     }
     if let Some(ak) = ancestor_key {
         // Don't double-fixup if the ancestor was the same plateau.
-        if evicted_key != Some(ak) {
+        if evicted_key == /* ~ changed by cargo-mutants ~ */ Some(ak) {
             graph.fixup_plateau(ak);
         }
     }
 
     // Step 4+5 combined — Merge parent into displaced list, collect
     // all basis elements, sort by BasisEdge, place left-to-right
     // (ADR-M-031 §3a).
     //

---- tests::diagnostic::evict_tip_creates_span stdout ----

thread 'tests::diagnostic::evict_tip_creates_span' (1342508) panicked at packages/mudlark/src/graph_plateau.rs:193:13:
POST-EVICT-SINGLE-1: dynamic-contour-tracking mirror diverged from static rebuild
left (dynamic): {
    BasisEdge(
        0,
    ): Plateau {
        basis_edge: BasisEdge(
            0,
        ),
        start: 0,
        end: 48,
        depth: 4,

---- tests::diagnostic::eviction_pipeline_creates_spans stdout ----

thread 'tests::diagnostic::eviction_pipeline_creates_spans' (1342509) panicked at packages/mudlark/src/graph_plateau.rs:193:13:
POST-EVICT-SINGLE-1: dynamic-contour-tracking mirror diverged from static rebuild
left (dynamic): {
    BasisEdge(
        0,
    ): Plateau {
        basis_edge: BasisEdge(
            0,
        ),
        start: 0,
        end: 48,
        depth: 4,

---- tests::diagnostic::vtree_remove_leaf_creates_span stdout ----

thread 'tests::diagnostic::vtree_remove_leaf_creates_span' (1342523) panicked at packages/mudlark/src/graph_plateau.rs:193:13:
POST-EVICT-SINGLE-1: dynamic-contour-tracking mirror diverged from static rebuild
left (dynamic): {
    BasisEdge(
        0,
    ): Plateau {
        basis_edge: BasisEdge(
            0,
        ),
        start: 0,
        end: 48,
        depth: 4,

failures:
    tests::diagnostic::evict_tip_creates_span
    tests::diagnostic::eviction_pipeline_creates_spans
    tests::diagnostic::vtree_remove_leaf_creates_span
    tests::graph::check_evictions_bounded_respects_limit
    tests::graph::check_evictions_return_value_matches_count_delta
    tests::graph::check_evictions_trailing_rebalance_clears_violations
    tests::graph::check_evictions_unbounded_evicts_all
    tests::graph::get_semi_internal_depth_is_trimmed_depth
    tests::graph::get_semi_internal_left_child_trims_right
    tests::graph::get_semi_internal_right_child_trims_left

test result: FAILED. 336 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.11s

*** result: Failure(101)
