*** packages/mudlark/src/evict.rs:483:64: replace != with == in plateau_after_evict

*** mutation diff:
--- packages/mudlark/src/evict.rs
+++ replace != with == in plateau_after_evict
@@ -475,17 +475,17 @@
     // Evacuate right-adjacent same-depth plateaus that could be
     // incorrectly merged with the parent during sorted placement.
     // We look for plateaus whose BasisEdge is in [parent_hi, ...) and
     // at the same depth, that are spatially adjacent (start <= parent_hi).
     {
         let right_keys: Vec<crate::plateau::BasisEdge<C>> = graph
             .plateaus
             .range(crate::plateau::BasisEdge(parent_hi)..)
-            .take_while(|(_, p)| p.start.total_cmp(&parent_hi) != std::cmp::Ordering::Greater)
+            .take_while(|(_, p)| p.start.total_cmp(&parent_hi) == /* ~ changed by cargo-mutants ~ */ std::cmp::Ordering::Greater)
             .filter(|(_, p)| p.depth == parent_depth)
             .map(|(&k, _)| k)
             .collect();
         for rk in right_keys {
             let members: Vec<crate::handle::GNodeId> = graph.plateau_basis.basis_elements(&rk).iter().copied().collect();
             if !members.is_empty() {
                 tracing::trace!(
                     ?rk,

---- tests::diagnostic::evict_tip_creates_span stdout ----

thread 'tests::diagnostic::evict_tip_creates_span' (1352528) panicked at packages/mudlark/src/graph_plateau.rs:193:13:
POST-EVICT-SINGLE-1: dynamic-contour-tracking mirror diverged from static rebuild
left (dynamic): {
    BasisEdge(
        0,
    ): Plateau {
        basis_edge: BasisEdge(
            0,
        ),
        start: 0,
        end: 64,
        depth: 4,

---- tests::diagnostic::eviction_pipeline_creates_spans stdout ----

thread 'tests::diagnostic::eviction_pipeline_creates_spans' (1352529) panicked at packages/mudlark/src/graph_plateau.rs:193:13:
POST-EVICT-SINGLE-1: dynamic-contour-tracking mirror diverged from static rebuild
left (dynamic): {
    BasisEdge(
        0,
    ): Plateau {
        basis_edge: BasisEdge(
            0,
        ),
        start: 0,
        end: 64,
        depth: 4,

---- tests::diagnostic::vtree_remove_leaf_creates_span stdout ----

thread 'tests::diagnostic::vtree_remove_leaf_creates_span' (1352543) panicked at packages/mudlark/src/graph_plateau.rs:193:13:
POST-EVICT-SINGLE-1: dynamic-contour-tracking mirror diverged from static rebuild
left (dynamic): {
    BasisEdge(
        0,
    ): Plateau {
        basis_edge: BasisEdge(
            0,
        ),
        start: 0,
        end: 64,
        depth: 4,

failures:
    tests::diagnostic::evict_tip_creates_span
    tests::diagnostic::eviction_pipeline_creates_spans
    tests::diagnostic::vtree_remove_leaf_creates_span
    tests::graph::check_evictions_return_value_matches_count_delta
    tests::graph::check_evictions_trailing_rebalance_clears_violations
    tests::graph::check_evictions_unbounded_evicts_all
    tests::graph::get_semi_internal_depth_is_trimmed_depth
    tests::graph::get_semi_internal_left_child_trims_right
    tests::graph::get_semi_internal_right_child_trims_left
    tests::observe::observe_invariants_hold_after_eviction_cycle
    tests::observe::observe_triggers_eviction_when_over_budget
    tests::observe::observe_violations_empty_after_eviction

test result: FAILED. 333 passed; 13 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
