*** packages/mudlark/src/evict.rs:489:16: delete ! in plateau_after_evict

*** mutation diff:
--- packages/mudlark/src/evict.rs
+++ delete ! in plateau_after_evict
@@ -481,17 +481,17 @@
             .plateaus
             .range(crate::plateau::BasisEdge(parent_hi)..)
             .take_while(|(_, p)| p.start.total_cmp(&parent_hi) != std::cmp::Ordering::Greater)
             .filter(|(_, p)| p.depth == parent_depth)
             .map(|(&k, _)| k)
             .collect();
         for rk in right_keys {
             let members: Vec<crate::handle::GNodeId> = graph.plateau_basis.basis_elements(&rk).iter().copied().collect();
-            if !members.is_empty() {
+            if  /* ~ changed by cargo-mutants ~ */members.is_empty() {
                 tracing::trace!(
                     ?rk,
                     parent_depth,
                     members = ?members.iter().map(|g| g.index()).collect::<Vec<_>>(),
                     "evacuating right-adjacent same-depth plateau for evict placement",
                 );
                 for &m in &members {
                     graph.plateau_basis.remove(m);

---- tests::diagnostic::evict_tip_creates_span stdout ----

thread 'tests::diagnostic::evict_tip_creates_span' (1353495) panicked at packages/mudlark/src/graph_plateau.rs:193:13:
POST-EVICT-SINGLE-1: dynamic-contour-tracking mirror diverged from static rebuild
left (dynamic): {
    BasisEdge(
        0,
    ): Plateau {
        basis_edge: BasisEdge(
            0,
        ),
        start: 0,
        end: 64,
        depth: 4,

---- tests::diagnostic::eviction_pipeline_creates_spans stdout ----

thread 'tests::diagnostic::eviction_pipeline_creates_spans' (1353496) panicked at packages/mudlark/src/graph_plateau.rs:193:13:
POST-EVICT-SINGLE-1: dynamic-contour-tracking mirror diverged from static rebuild
left (dynamic): {
    BasisEdge(
        0,
    ): Plateau {
        basis_edge: BasisEdge(
            0,
        ),
        start: 0,
        end: 64,
        depth: 4,

---- tests::diagnostic::vtree_remove_leaf_creates_span stdout ----

thread 'tests::diagnostic::vtree_remove_leaf_creates_span' (1353510) panicked at packages/mudlark/src/graph_plateau.rs:193:13:
POST-EVICT-SINGLE-1: dynamic-contour-tracking mirror diverged from static rebuild
left (dynamic): {
    BasisEdge(
        0,
    ): Plateau {
        basis_edge: BasisEdge(
            0,
        ),
        start: 0,
        end: 64,
        depth: 4,

failures:
    tests::diagnostic::evict_tip_creates_span
    tests::diagnostic::eviction_pipeline_creates_spans
    tests::diagnostic::vtree_remove_leaf_creates_span
    tests::graph::check_evictions_return_value_matches_count_delta
    tests::graph::check_evictions_trailing_rebalance_clears_violations
    tests::graph::check_evictions_unbounded_evicts_all
    tests::graph::get_semi_internal_depth_is_trimmed_depth
    tests::graph::get_semi_internal_left_child_trims_right
    tests::graph::get_semi_internal_right_child_trims_left
    tests::observe::observe_invariants_hold_after_eviction_cycle
    tests::observe::observe_triggers_eviction_when_over_budget
    tests::observe::observe_violations_empty_after_eviction

test result: FAILED. 333 passed; 13 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
