*** packages/mudlark/src/evict.rs:511:62: replace != with == in plateau_after_evict

*** mutation diff:
--- packages/mudlark/src/evict.rs
+++ replace != with == in plateau_after_evict
@@ -503,17 +503,17 @@
             }
         }
 
         // Also evacuate left-adjacent same-depth plateaus.
         let left_keys: Vec<crate::plateau::BasisEdge<C>> = graph
             .plateaus
             .range(..parent_be)
             .rev()
-            .take_while(|(_, p)| p.end.total_cmp(&parent_lo) != std::cmp::Ordering::Less)
+            .take_while(|(_, p)| p.end.total_cmp(&parent_lo) == /* ~ changed by cargo-mutants ~ */ std::cmp::Ordering::Less)
             .filter(|(_, p)| p.depth == parent_depth)
             .map(|(&k, _)| k)
             .collect();
         for lk in left_keys {
             let members: Vec<crate::handle::GNodeId> = graph.plateau_basis.basis_elements(&lk).iter().copied().collect();
             if !members.is_empty() {
                 tracing::trace!(
                     ?lk,

*** result: Success
