*** packages/mudlark/src/evict.rs:512:38: replace == with != in plateau_after_evict

*** mutation diff:
--- packages/mudlark/src/evict.rs
+++ replace == with != in plateau_after_evict
@@ -504,17 +504,17 @@
         }
 
         // Also evacuate left-adjacent same-depth plateaus.
         let left_keys: Vec<crate::plateau::BasisEdge<C>> = graph
             .plateaus
             .range(..parent_be)
             .rev()
             .take_while(|(_, p)| p.end.total_cmp(&parent_lo) != std::cmp::Ordering::Less)
-            .filter(|(_, p)| p.depth == parent_depth)
+            .filter(|(_, p)| p.depth != /* ~ changed by cargo-mutants ~ */ parent_depth)
             .map(|(&k, _)| k)
             .collect();
         for lk in left_keys {
             let members: Vec<crate::handle::GNodeId> = graph.plateau_basis.basis_elements(&lk).iter().copied().collect();
             if !members.is_empty() {
                 tracing::trace!(
                     ?lk,
                     parent_depth,

---- tests::diagnostic::evict_tip_creates_span stdout ----

thread 'tests::diagnostic::evict_tip_creates_span' (1368194) panicked at packages/mudlark/src/graph_plateau.rs:193:13:
POST-EVICT-SINGLE-1: dynamic-contour-tracking mirror diverged from static rebuild
left (dynamic): {
    BasisEdge(
        0,
    ): Plateau {
        basis_edge: BasisEdge(
            0,
        ),
        start: 0,
        end: 128,
        depth: 3,

---- tests::diagnostic::eviction_pipeline_creates_spans stdout ----

thread 'tests::diagnostic::eviction_pipeline_creates_spans' (1368195) panicked at packages/mudlark/src/graph_plateau.rs:193:13:
POST-EVICT-SINGLE-1: dynamic-contour-tracking mirror diverged from static rebuild
left (dynamic): {
    BasisEdge(
        0,
    ): Plateau {
        basis_edge: BasisEdge(
            0,
        ),
        start: 0,
        end: 128,
        depth: 3,

---- tests::diagnostic::vtree_remove_leaf_creates_span stdout ----

thread 'tests::diagnostic::vtree_remove_leaf_creates_span' (1368210) panicked at packages/mudlark/src/graph_plateau.rs:193:13:
POST-EVICT-SINGLE-1: dynamic-contour-tracking mirror diverged from static rebuild
left (dynamic): {
    BasisEdge(
        0,
    ): Plateau {
        basis_edge: BasisEdge(
            0,
        ),
        start: 0,
        end: 128,
        depth: 3,

failures:
    tests::diagnostic::evict_tip_creates_span
    tests::diagnostic::eviction_pipeline_creates_spans
    tests::diagnostic::vtree_remove_leaf_creates_span
    tests::observe::observe_invariants_hold_after_eviction_cycle

test result: FAILED. 342 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.11s

*** result: Failure(101)
