*** packages/mudlark/src/evict.rs:573:22: replace > with < in scan_dfs

*** mutation diff:
--- packages/mudlark/src/evict.rs
+++ replace > with < in scan_dfs
@@ -565,17 +565,17 @@
     graph: &GvGraph<C, V, N>,
     v_id: VNodeId,
     depth: u32,
     candidates: &mut Vec<VNodeId>,
 ) {
     let node = graph.vnodes.get(v_id.index());
     match &node.kind {
         VKind::Entry { gnode, is_evictable, .. } => {
-            if depth > graph.live_depth_evict && *is_evictable && *gnode != graph.g_root {
+            if depth < /* ~ changed by cargo-mutants ~ */ graph.live_depth_evict && *is_evictable && *gnode != graph.g_root {
                 candidates.push(v_id);
             }
         }
         VKind::Structural { children, has_evictable } => {
             // Prune: no evictable entries in this subtree.
             if !has_evictable {
                 return;
             }

---- tests::diagnostic::evict_tip_creates_span stdout ----

thread 'tests::diagnostic::evict_tip_creates_span' (1385046) panicked at packages/mudlark/src/tests/diagnostic.rs:348:5:

---- tests::evict::finds_candidates_past_d_evict stdout ----

thread 'tests::evict::finds_candidates_past_d_evict' (1385067) panicked at packages/mudlark/src/tests/evict.rs:167:5:
should find candidates past D_evict=2

---- tests::evict::no_candidates_when_within_d_evict stdout ----

thread 'tests::evict::no_candidates_when_within_d_evict' (1385068) panicked at packages/mudlark/src/tests/evict.rs:140:5:
assertion failed: candidates.is_empty()

failures:
    tests::diagnostic::evict_tip_creates_span
    tests::diagnostic::vtree_remove_leaf_creates_span
    tests::evict::finds_candidates_past_d_evict
    tests::evict::no_candidates_when_within_d_evict
    tests::graph::check_evictions_unbounded_evicts_all
    tests::graph::get_semi_internal_left_child_trims_right
    tests::graph::get_semi_internal_right_child_trims_left

test result: FAILED. 339 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
