*** packages/mudlark/src/evict.rs:573:64: replace && with || in scan_dfs

*** mutation diff:
--- packages/mudlark/src/evict.rs
+++ replace && with || in scan_dfs
@@ -565,17 +565,17 @@
     graph: &GvGraph<C, V, N>,
     v_id: VNodeId,
     depth: u32,
     candidates: &mut Vec<VNodeId>,
 ) {
     let node = graph.vnodes.get(v_id.index());
     match &node.kind {
         VKind::Entry { gnode, is_evictable, .. } => {
-            if depth > graph.live_depth_evict && *is_evictable && *gnode != graph.g_root {
+            if depth > graph.live_depth_evict && *is_evictable || /* ~ changed by cargo-mutants ~ */ *gnode != graph.g_root {
                 candidates.push(v_id);
             }
         }
         VKind::Structural { children, has_evictable } => {
             // Prune: no evictable entries in this subtree.
             if !has_evictable {
                 return;
             }

---- tests::evict::no_candidates_when_within_d_evict stdout ----

thread 'tests::evict::no_candidates_when_within_d_evict' (1375576) panicked at packages/mudlark/src/tests/evict.rs:140:5:
assertion failed: candidates.is_empty()

failures:
    tests::evict::no_candidates_when_within_d_evict

test result: FAILED. 345 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
