*** packages/mudlark/src/evict.rs:573:74: replace != with == in scan_dfs

*** mutation diff:
--- packages/mudlark/src/evict.rs
+++ replace != with == in scan_dfs
@@ -565,17 +565,17 @@
     graph: &GvGraph<C, V, N>,
     v_id: VNodeId,
     depth: u32,
     candidates: &mut Vec<VNodeId>,
 ) {
     let node = graph.vnodes.get(v_id.index());
     match &node.kind {
         VKind::Entry { gnode, is_evictable, .. } => {
-            if depth > graph.live_depth_evict && *is_evictable && *gnode != graph.g_root {
+            if depth > graph.live_depth_evict && *is_evictable && *gnode == /* ~ changed by cargo-mutants ~ */ graph.g_root {
                 candidates.push(v_id);
             }
         }
         VKind::Structural { children, has_evictable } => {
             // Prune: no evictable entries in this subtree.
             if !has_evictable {
                 return;
             }

---- tests::diagnostic::evict_tip_creates_span stdout ----

thread 'tests::diagnostic::evict_tip_creates_span' (1389137) panicked at packages/mudlark/src/tests/diagnostic.rs:348:5:

---- tests::graph::check_evictions_unbounded_evicts_all stdout ----

thread 'tests::graph::check_evictions_unbounded_evicts_all' (1389188) panicked at packages/mudlark/src/tests/graph.rs:257:5:
should evict at least one candidate

---- tests::graph::get_semi_internal_left_child_trims_right stdout ----

thread 'tests::graph::get_semi_internal_left_child_trims_right' (1389206) panicked at packages/mudlark/src/tests/graph.rs:355:5:
expected at least one semi-internal after eviction

failures:
    tests::diagnostic::evict_tip_creates_span
    tests::diagnostic::vtree_remove_leaf_creates_span
    tests::evict::finds_candidates_past_d_evict
    tests::graph::check_evictions_unbounded_evicts_all
    tests::graph::get_semi_internal_left_child_trims_right
    tests::graph::get_semi_internal_right_child_trims_left

test result: FAILED. 340 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.17s

*** result: Failure(101)
