*** packages/mudlark/src/evict.rs:584:49: replace + with - in scan_dfs

*** mutation diff:
--- packages/mudlark/src/evict.rs
+++ replace + with - in scan_dfs
@@ -576,16 +576,16 @@
         }
         VKind::Structural { children, has_evictable } => {
             // Prune: no evictable entries in this subtree.
             if !has_evictable {
                 return;
             }
             for i in 0..children.len() {
                 let (child_id, _) = children.get(i);
-                scan_dfs(graph, child_id, depth + 1, candidates);
+                scan_dfs(graph, child_id, depth - /* ~ changed by cargo-mutants ~ */ 1, candidates);
             }
         }
     }
 }
 
 #[cfg(test)]
 mod tests {}

---- tests::diagnostic::eviction_pipeline_creates_spans stdout ----

thread 'tests::diagnostic::eviction_pipeline_creates_spans' (1394403) panicked at packages/mudlark/src/evict.rs:584:43:
attempt to subtract with overflow

---- tests::diagnostic::evict_tip_creates_span stdout ----

thread 'tests::diagnostic::evict_tip_creates_span' (1394402) panicked at packages/mudlark/src/evict.rs:584:43:
attempt to subtract with overflow

---- tests::diagnostic::vtree_remove_leaf_creates_span stdout ----

thread 'tests::diagnostic::vtree_remove_leaf_creates_span' (1394417) panicked at packages/mudlark/src/evict.rs:584:43:
attempt to subtract with overflow

failures:
    tests::diagnostic::evict_tip_creates_span
    tests::diagnostic::eviction_pipeline_creates_spans
    tests::diagnostic::vtree_remove_leaf_creates_span
    tests::evict::finds_candidates_past_d_evict
    tests::evict::no_candidates_when_within_d_evict
    tests::evict::prunes_subtrees_without_evictable
    tests::graph::check_evictions_bounded_respects_limit
    tests::graph::check_evictions_noop_when_none_eligible
    tests::graph::check_evictions_return_value_matches_count_delta
    tests::graph::check_evictions_trailing_rebalance_clears_violations
    tests::graph::check_evictions_unbounded_evicts_all
    tests::graph::get_semi_internal_depth_is_trimmed_depth

test result: FAILED. 328 passed; 18 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
