*** packages/mudlark/src/evict.rs:584:49: replace + with * in scan_dfs

*** mutation diff:
--- packages/mudlark/src/evict.rs
+++ replace + with * in scan_dfs
@@ -576,16 +576,16 @@
         }
         VKind::Structural { children, has_evictable } => {
             // Prune: no evictable entries in this subtree.
             if !has_evictable {
                 return;
             }
             for i in 0..children.len() {
                 let (child_id, _) = children.get(i);
-                scan_dfs(graph, child_id, depth + 1, candidates);
+                scan_dfs(graph, child_id, depth * /* ~ changed by cargo-mutants ~ */ 1, candidates);
             }
         }
     }
 }
 
 #[cfg(test)]
 mod tests {}

---- tests::diagnostic::evict_tip_creates_span stdout ----

thread 'tests::diagnostic::evict_tip_creates_span' (1395244) panicked at packages/mudlark/src/tests/diagnostic.rs:348:5:

---- tests::graph::get_semi_internal_right_child_trims_left stdout ----

thread 'tests::graph::get_semi_internal_right_child_trims_left' (1395297) panicked at packages/mudlark/src/tests/graph.rs:387:5:
expected at least one semi-internal after eviction

---- tests::graph::check_evictions_unbounded_evicts_all stdout ----

thread 'tests::graph::check_evictions_unbounded_evicts_all' (1395284) panicked at packages/mudlark/src/tests/graph.rs:257:5:
should evict at least one candidate

failures:
    tests::diagnostic::evict_tip_creates_span
    tests::diagnostic::vtree_remove_leaf_creates_span
    tests::evict::finds_candidates_past_d_evict
    tests::graph::check_evictions_unbounded_evicts_all
    tests::graph::get_semi_internal_left_child_trims_right
    tests::graph::get_semi_internal_right_child_trims_left

test result: FAILED. 340 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
