*** packages/mudlark/src/evict.rs:74:19: replace == with != in evict_tip

*** mutation diff:
--- packages/mudlark/src/evict.rs
+++ replace == with != in evict_tip
@@ -66,17 +66,17 @@
     let child_sum = graph.gnodes.get(gnode_id.index()).sum;
     let parent_sum_before = graph.gnodes.get(parent_id.index()).sum;
 
     graph.gnodes.get_mut(parent_id.index()).own = V::add(graph.gnodes.get(parent_id.index()).own, child_sum);
 
     // ── 2. Unlink child from parent ─────────────────────────────
     {
         let p = graph.gnodes.get_mut(parent_id.index());
-        if p.left == Some(gnode_id) {
+        if p.left != /* ~ changed by cargo-mutants ~ */ Some(gnode_id) {
             p.left = None;
         } else if p.right == Some(gnode_id) {
             p.right = None;
         } else {
             panic!(
                 "evict_tip: G-node {} is not a child of parent {}",
                 gnode_id.index(),
                 parent_id.index()

---- tests::evict::evict_single_terminal_child stdout ----

thread 'tests::evict::evict_single_terminal_child' (1279970) panicked at packages/mudlark/src/evict.rs:79:13:
evict_tip: G-node 1 is not a child of parent 0

---- tests::evict::evict_to_semi_internal_creates_thatch stdout ----

thread 'tests::evict::evict_to_semi_internal_creates_thatch' (1279971) panicked at packages/mudlark/src/evict.rs:79:13:
evict_tip: G-node 1 is not a child of parent 0

---- tests::evict::evict_after_observations_conserves_energy stdout ----

thread 'tests::evict::evict_after_observations_conserves_energy' (1279968) panicked at packages/mudlark/src/evict.rs:79:13:
evict_tip: G-node 1 is not a child of parent 0

failures:
    tests::diagnostic::evict_tip_creates_span
    tests::diagnostic::eviction_pipeline_creates_spans
    tests::diagnostic::vtree_remove_leaf_creates_span
    tests::evict::evict_after_observations_conserves_energy
    tests::evict::evict_both_children_makes_parent_terminal
    tests::evict::evict_single_terminal_child
    tests::evict::evict_to_semi_internal_creates_thatch
    tests::evict::evict_to_terminal_destroys_thatch
    tests::graph::check_evictions_bounded_respects_limit
    tests::graph::check_evictions_return_value_matches_count_delta
    tests::graph::check_evictions_trailing_rebalance_clears_violations
    tests::graph::check_evictions_unbounded_evicts_all

test result: FAILED. 327 passed; 19 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
