*** packages/mudlark/src/evict.rs:76:27: replace == with != in evict_tip

*** mutation diff:
--- packages/mudlark/src/evict.rs
+++ replace == with != in evict_tip
@@ -68,17 +68,17 @@
 
     graph.gnodes.get_mut(parent_id.index()).own = V::add(graph.gnodes.get(parent_id.index()).own, child_sum);
 
     // ── 2. Unlink child from parent ─────────────────────────────
     {
         let p = graph.gnodes.get_mut(parent_id.index());
         if p.left == Some(gnode_id) {
             p.left = None;
-        } else if p.right == Some(gnode_id) {
+        } else if p.right != /* ~ changed by cargo-mutants ~ */ Some(gnode_id) {
             p.right = None;
         } else {
             panic!(
                 "evict_tip: G-node {} is not a child of parent {}",
                 gnode_id.index(),
                 parent_id.index()
             );
         }

---- tests::diagnostic::eviction_pipeline_creates_spans stdout ----

thread 'tests::diagnostic::eviction_pipeline_creates_spans' (1282412) panicked at packages/mudlark/src/evict.rs:79:13:
evict_tip: G-node 10 is not a child of parent 6

---- tests::diagnostic::evict_tip_creates_span stdout ----

thread 'tests::diagnostic::evict_tip_creates_span' (1282411) panicked at packages/mudlark/src/evict.rs:79:13:
evict_tip: G-node 10 is not a child of parent 6

---- tests::evict::evict_both_children_makes_parent_terminal stdout ----

thread 'tests::evict::evict_both_children_makes_parent_terminal' (1282428) panicked at packages/mudlark/src/evict.rs:79:13:
evict_tip: G-node 2 is not a child of parent 0

failures:
    tests::diagnostic::evict_tip_creates_span
    tests::diagnostic::eviction_pipeline_creates_spans
    tests::diagnostic::vtree_remove_leaf_creates_span
    tests::evict::evict_both_children_makes_parent_terminal
    tests::evict::evict_to_terminal_destroys_thatch
    tests::graph::check_evictions_return_value_matches_count_delta
    tests::graph::check_evictions_trailing_rebalance_clears_violations
    tests::graph::check_evictions_unbounded_evicts_all
    tests::graph::get_semi_internal_depth_is_trimmed_depth
    tests::graph::get_semi_internal_left_child_trims_right
    tests::graph::get_semi_internal_right_child_trims_left
    tests::observe::observe_invariants_hold_after_eviction_cycle

test result: FAILED. 332 passed; 14 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
