*** packages/mudlark/src/gnode.rs:132:13: delete match arm (Some(_), Some(_)) in GNode<C, V>::state

*** mutation diff:
--- packages/mudlark/src/gnode.rs
+++ delete match arm (Some(_), Some(_)) in GNode<C, V>::state
@@ -124,17 +124,17 @@
 
 impl<C, V> GNode<C, V> {
     /// Derive the categorical state from child pointers (ADR-M-016).
     #[inline]
     #[must_use]
     pub const fn state(&self) -> GState {
         match (self.left, self.right) {
             (None, None) => GState::Terminal,
-            (Some(_), Some(_)) => GState::Internal,
+             /* ~ changed by cargo-mutants ~ */
             _ => GState::SemiInternal,
         }
     }
 
     /// True iff this node has zero G-children.
     #[inline]
     #[must_use]
     pub const fn is_terminal(&self) -> bool {

---- tests::decay::decay_amplification_above_one stdout ----

thread 'tests::decay::decay_amplification_above_one' (683746) panicked at packages/mudlark/src/graph_plateau.rs:193:13:
POST-SPLIT: dynamic-contour-tracking mirror diverged from static rebuild
left (dynamic): {
    BasisEdge(
        8,
    ): Plateau {
        basis_edge: BasisEdge(
            8,
        ),
        start: 0,
        end: 16,
        depth: 1,

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (683747) panicked at packages/mudlark/src/graph_plateau.rs:193:13:
POST-SPLIT: dynamic-contour-tracking mirror diverged from static rebuild
left (dynamic): {
    BasisEdge(
        8,
    ): Plateau {
        basis_edge: BasisEdge(
            8,
        ),
        start: 0,
        end: 16,
        depth: 1,

---- tests::decay::decay_energy_conservation_selective stdout ----

thread 'tests::decay::decay_energy_conservation_selective' (683748) panicked at packages/mudlark/src/graph_plateau.rs:193:13:
POST-SPLIT: dynamic-contour-tracking mirror diverged from static rebuild
left (dynamic): {
    BasisEdge(
        8,
    ): Plateau {
        basis_edge: BasisEdge(
            8,
        ),
        start: 0,
        end: 16,
        depth: 1,

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 232 passed; 114 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
