*** packages/mudlark/src/gnode.rs:141:29: replace && with || in GNode<C, V>::is_terminal

*** mutation diff:
--- packages/mudlark/src/gnode.rs
+++ replace && with || in GNode<C, V>::is_terminal
@@ -133,17 +133,17 @@
             _ => GState::SemiInternal,
         }
     }
 
     /// True iff this node has zero G-children.
     #[inline]
     #[must_use]
     pub const fn is_terminal(&self) -> bool {
-        self.left.is_none() && self.right.is_none()
+        self.left.is_none() || /* ~ changed by cargo-mutants ~ */ self.right.is_none()
     }
 
     /// True iff this node has at least one G-child.
     /// Inverse of `is_terminal()`.
     #[inline]
     #[must_use]
     #[allow(dead_code)] // used in tests
     pub const fn has_dependents(&self) -> bool {

---- tests::diagnostic::evict_tip_creates_span stdout ----

thread 'tests::diagnostic::evict_tip_creates_span' (692992) panicked at packages/mudlark/src/arena.rs:93:9:
Arena::get: slot 9 is not occupied

---- tests::diagnostic::eviction_pipeline_creates_spans stdout ----

thread 'tests::diagnostic::eviction_pipeline_creates_spans' (692993) panicked at packages/mudlark/src/arena.rs:93:9:
Arena::get: slot 9 is not occupied

---- tests::evict::evict_single_terminal_child stdout ----

thread 'tests::evict::evict_single_terminal_child' (693010) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
P-I5 thatch depth: at x=8, thatch_depth=2 > d_geo=0 + 1

failures:
    tests::diagnostic::evict_tip_creates_span
    tests::diagnostic::eviction_pipeline_creates_spans
    tests::diagnostic::vtree_remove_leaf_creates_span
    tests::evict::evict_after_observations_conserves_energy
    tests::evict::evict_both_children_makes_parent_terminal
    tests::evict::evict_single_terminal_child
    tests::evict::evict_to_semi_internal_creates_thatch
    tests::evict::evict_to_terminal_destroys_thatch
    tests::gnode::state_semi_internal_left
    tests::gnode::state_semi_internal_right
    tests::graph::check_evictions_trailing_rebalance_clears_violations
    tests::graph::check_evictions_unbounded_evicts_all

test result: FAILED. 328 passed; 18 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
