*** packages/mudlark/src/gnode.rs:141:9: replace GNode<C, V>::is_terminal -> bool with true

*** mutation diff:
--- packages/mudlark/src/gnode.rs
+++ replace GNode<C, V>::is_terminal -> bool with true
@@ -133,17 +133,17 @@
             _ => GState::SemiInternal,
         }
     }
 
     /// True iff this node has zero G-children.
     #[inline]
     #[must_use]
     pub const fn is_terminal(&self) -> bool {
-        self.left.is_none() && self.right.is_none()
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     /// True iff this node has at least one G-child.
     /// Inverse of `is_terminal()`.
     #[inline]
     #[must_use]
     #[allow(dead_code)] // used in tests
     pub const fn has_dependents(&self) -> bool {

---- tests::decay::decay_noop_at_attenuation_one stdout ----

thread 'tests::decay::decay_noop_at_attenuation_one' (686139) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (10 total):
V-I6b violated at V-node 0: is_evictable=false, expected=true (state=Internal)
V-I6b violated at V-node 1: is_evictable=false, expected=true (state=Internal)
V-I6b violated at V-node 2: is_evictable=false, expected=true (state=Internal)
V-I6b violated at V-node 5: is_evictable=false, expected=true (state=Internal)
V-I6b violated at V-node 6: is_evictable=false, expected=true (state=Internal)
V-I6b violated at V-node 9: is_evictable=false, expected=true (state=Internal)
V-I6b violated at V-node 13: is_evictable=false, expected=true (state=Internal)
V-I6b violated at V-node 16: is_evictable=false, expected=true (state=Internal)
V-I6b violated at V-node 19: is_evictable=false, expecte

---- tests::decay::decay_preserves_plateau_structure stdout ----

thread 'tests::decay::decay_preserves_plateau_structure' (686146) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (10 total):
V-I6b violated at V-node 0: is_evictable=false, expected=true (state=Internal)
V-I6b violated at V-node 1: is_evictable=false, expected=true (state=Internal)
V-I6b violated at V-node 2: is_evictable=false, expected=true (state=Internal)
V-I6b violated at V-node 5: is_evictable=false, expected=true (state=Internal)
V-I6b violated at V-node 6: is_evictable=false, expected=true (state=Internal)
V-I6b violated at V-node 9: is_evictable=false, expected=true (state=Internal)
V-I6b violated at V-node 13: is_evictable=false, expected=true (state=Internal)
V-I6b violated at V-node 16: is_evictable=false, expected=true (state=Internal)
V-I6b violated at V-node 19: is_evictable=false,

---- tests::decay::decay_panics_negative_q stdout ----

thread 'tests::decay::decay_panics_negative_q' (686143) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (10 total):
V-I6b violated at V-node 0: is_evictable=false, expected=true (state=Internal)
V-I6b violated at V-node 1: is_evictable=false, expected=true (state=Internal)
V-I6b violated at V-node 2: is_evictable=false, expected=true (state=Internal)
V-I6b violated at V-node 5: is_evictable=false, expected=true (state=Internal)
V-I6b violated at V-node 6: is_evictable=false, expected=true (state=Internal)
V-I6b violated at V-node 9: is_evictable=false, expected=true (state=Internal)
V-I6b violated at V-node 13: is_evictable=false, expected=true (state=Internal)
V-I6b violated at V-node 16: is_evictable=false, expected=true (state=Internal)
V-I6b violated at V-node 19: is_evictable=false, expected=true (stat

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 258 passed; 88 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
