*** packages/mudlark/src/gnode.rs:141:9: replace GNode<C, V>::is_terminal -> bool with false

*** mutation diff:
--- packages/mudlark/src/gnode.rs
+++ replace GNode<C, V>::is_terminal -> bool with false
@@ -133,17 +133,17 @@
             _ => GState::SemiInternal,
         }
     }
 
     /// True iff this node has zero G-children.
     #[inline]
     #[must_use]
     pub const fn is_terminal(&self) -> bool {
-        self.left.is_none() && self.right.is_none()
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     /// True iff this node has at least one G-child.
     /// Inverse of `is_terminal()`.
     #[inline]
     #[must_use]
     #[allow(dead_code)] // used in tests
     pub const fn has_dependents(&self) -> bool {

---- tests::decay::decay_amplification_above_one stdout ----

thread 'tests::decay::decay_amplification_above_one' (690868) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (11 total):
V-I6b violated at V-node 3: is_evictable=true, expected=false (state=Terminal)
V-I6b violated at V-node 7: is_evictable=true, expected=false (state=Terminal)
V-I6b violated at V-node 10: is_evictable=true, expected=false (state=Terminal)
V-I6b violated at V-node 15: is_evictable=true, expected=false (state=Terminal)
V-I6b violated at V-node 17: is_evictable=true, expected=false (state=Terminal)
V-I6b violated at V-node 23: is_evictable=true, expected=false (state=Terminal)
V-I6b violated at V-node 24: is_evictable=true, expected=false (state=Terminal)
V-I6b violated at V-node 26: is_evictable=true, expected=false (state=Terminal)
V-I6b violated at V-node 29: is_evictable=true, expe

---- tests::decay::decay_multiple_selective_preserves_invariants stdout ----

thread 'tests::decay::decay_multiple_selective_preserves_invariants' (690873) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (11 total):
V-I6b violated at V-node 3: is_evictable=true, expected=false (state=Terminal)
V-I6b violated at V-node 7: is_evictable=true, expected=false (state=Terminal)
V-I6b violated at V-node 10: is_evictable=true, expected=false (state=Terminal)
V-I6b violated at V-node 15: is_evictable=true, expected=false (state=Terminal)
V-I6b violated at V-node 17: is_evictable=true, expected=false (state=Terminal)
V-I6b violated at V-node 23: is_evictable=true, expected=false (state=Terminal)
V-I6b violated at V-node 24: is_evictable=true, expected=false (state=Terminal)
V-I6b violated at V-node 26: is_evictable=true, expected=false (state=Terminal)
V-I6b violated at V-

---- tests::decay::decay_multiple_uniform_preserves_invariants stdout ----

thread 'tests::decay::decay_multiple_uniform_preserves_invariants' (690874) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (11 total):
V-I6b violated at V-node 3: is_evictable=true, expected=false (state=Terminal)
V-I6b violated at V-node 7: is_evictable=true, expected=false (state=Terminal)
V-I6b violated at V-node 10: is_evictable=true, expected=false (state=Terminal)
V-I6b violated at V-node 15: is_evictable=true, expected=false (state=Terminal)
V-I6b violated at V-node 17: is_evictable=true, expected=false (state=Terminal)
V-I6b violated at V-node 23: is_evictable=true, expected=false (state=Terminal)
V-I6b violated at V-node 24: is_evictable=true, expected=false (state=Terminal)
V-I6b violated at V-node 26: is_evictable=true, expected=false (state=Terminal)
V-I6b violated at V-node

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 260 passed; 86 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
