*** packages/mudlark/src/gnode.rs:150:9: replace GNode<C, V>::has_dependents -> bool with false

*** mutation diff:
--- packages/mudlark/src/gnode.rs
+++ replace GNode<C, V>::has_dependents -> bool with false
@@ -142,17 +142,17 @@
     }
 
     /// True iff this node has at least one G-child.
     /// Inverse of `is_terminal()`.
     #[inline]
     #[must_use]
     #[allow(dead_code)] // used in tests
     pub const fn has_dependents(&self) -> bool {
-        self.left.is_some() || self.right.is_some()
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     /// True iff exactly one G-child is present.
     #[inline]
     #[must_use]
     pub const fn is_semi_internal(&self) -> bool {
         matches!(self.state(), GState::SemiInternal)
     }

---- tests::gnode::has_dependents_matches_state stdout ----

thread 'tests::gnode::has_dependents_matches_state' (698273) panicked at packages/mudlark/src/tests/gnode.rs:69:5:
assertion failed: semi_left.has_dependents()

failures:
    tests::gnode::has_dependents_matches_state

test result: FAILED. 345 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
