*** packages/mudlark/src/gnode.rs:157:9: replace GNode<C, V>::is_semi_internal -> bool with true

*** mutation diff:
--- packages/mudlark/src/gnode.rs
+++ replace GNode<C, V>::is_semi_internal -> bool with true
@@ -149,17 +149,17 @@
     pub const fn has_dependents(&self) -> bool {
         self.left.is_some() || self.right.is_some()
     }
 
     /// True iff exactly one G-child is present.
     #[inline]
     #[must_use]
     pub const fn is_semi_internal(&self) -> bool {
-        matches!(self.state(), GState::SemiInternal)
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns the uncovered half-interval, or `None` for internal nodes.
     ///
     /// - Terminal: entire range `(lo, hi)`.
     /// - Semi-internal (left present): right half `(mid, hi)`.
     /// - Semi-internal (right present): left half `(lo, mid)`.
     /// - Internal: `None`.

---- tests::decay::decay_amplification_above_one stdout ----

thread 'tests::decay::decay_amplification_above_one' (708144) panicked at packages/mudlark/src/rebalance.rs:571:10:
legacy_promote: semi-internal must have uncovered range

---- tests::decay::decay_energy_conservation_selective stdout ----

thread 'tests::decay::decay_energy_conservation_selective' (708146) panicked at packages/mudlark/src/rebalance.rs:571:10:
legacy_promote: semi-internal must have uncovered range

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (708145) panicked at packages/mudlark/src/rebalance.rs:571:10:
legacy_promote: semi-internal must have uncovered range

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 281 passed; 65 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
