*** packages/mudlark/src/gnode.rs:157:9: replace GNode<C, V>::is_semi_internal -> bool with false

*** mutation diff:
--- packages/mudlark/src/gnode.rs
+++ replace GNode<C, V>::is_semi_internal -> bool with false
@@ -149,17 +149,17 @@
     pub const fn has_dependents(&self) -> bool {
         self.left.is_some() || self.right.is_some()
     }
 
     /// True iff exactly one G-child is present.
     #[inline]
     #[must_use]
     pub const fn is_semi_internal(&self) -> bool {
-        matches!(self.state(), GState::SemiInternal)
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns the uncovered half-interval, or `None` for internal nodes.
     ///
     /// - Terminal: entire range `(lo, hi)`.
     /// - Semi-internal (left present): right half `(mid, hi)`.
     /// - Semi-internal (right present): left half `(lo, mid)`.
     /// - Internal: `None`.

---- tests::gnode::is_semi_internal_matches_state stdout ----

thread 'tests::gnode::is_semi_internal_matches_state' (711844) panicked at packages/mudlark/src/tests/gnode.rs:91:5:
assertion failed: semi.is_semi_internal()

failures:
    tests::gnode::is_semi_internal_matches_state

test result: FAILED. 345 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
