*** packages/mudlark/src/gnode.rs:171:9: replace GNode<C, V>::uncovered_range -> Option<(C, C)> with None

*** mutation diff:
--- packages/mudlark/src/gnode.rs
+++ replace GNode<C, V>::uncovered_range -> Option<(C, C)> with None
@@ -163,28 +163,17 @@
     /// - Semi-internal (left present): right half `(mid, hi)`.
     /// - Semi-internal (right present): left half `(lo, mid)`.
     /// - Internal: `None`.
     #[must_use]
     pub fn uncovered_range(&self) -> Option<(C, C)>
     where
         C: crate::traits::Coordinate,
     {
-        match (self.left, self.right) {
-            (None, None) => Some((self.lo, self.hi)),
-            (Some(_), None) => {
-                let mid = C::midpoint(self.lo, self.hi);
-                Some((mid, self.hi))
-            }
-            (None, Some(_)) => {
-                let mid = C::midpoint(self.lo, self.hi);
-                Some((self.lo, mid))
-            }
-            (Some(_), Some(_)) => None,
-        }
+        None /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl<C: Default, V: Default> Default for GNode<C, V> {
     fn default() -> Self {
         Self {
             lo: C::default(),
             hi: C::default(),

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (711255) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (10 total):
V-I6 violated at V-node 3: is_exposed=true, expected=false (state=Terminal)
V-I6 violated at V-node 7: is_exposed=true, expected=false (state=Terminal)
V-I6 violated at V-node 10: is_exposed=true, expected=false (state=Terminal)
V-I6 violated at V-node 15: is_exposed=true, expected=false (state=Terminal)
V-I6 violated at V-node 17: is_exposed=true, expected=false (state=Terminal)
V-I6 violated at V-node 23: is_exposed=true, expected=false (state=Terminal)
V-I6 violated at V-node 24: is_exposed=true, expected=false (state=Terminal)
V-I6 violated at V-node 26: is_exposed=true, expected=false (state=Terminal)
V-I6 violated at V-node 29: is_exposed=true, expected=false (state=Terminal)
V-I6 vi

---- tests::decay::decay_energy_conservation_uniform stdout ----

thread 'tests::decay::decay_energy_conservation_uniform' (711257) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (10 total):
V-I6 violated at V-node 3: is_exposed=true, expected=false (state=Terminal)
V-I6 violated at V-node 7: is_exposed=true, expected=false (state=Terminal)
V-I6 violated at V-node 10: is_exposed=true, expected=false (state=Terminal)
V-I6 violated at V-node 15: is_exposed=true, expected=false (state=Terminal)
V-I6 violated at V-node 17: is_exposed=true, expected=false (state=Terminal)
V-I6 violated at V-node 23: is_exposed=true, expected=false (state=Terminal)
V-I6 violated at V-node 24: is_exposed=true, expected=false (state=Terminal)
V-I6 violated at V-node 26: is_exposed=true, expected=false (state=Terminal)
V-I6 violated at V-node 29: is_exposed=true, expected=false (state=T

---- tests::decay::decay_panics_negative_attenuation stdout ----

thread 'tests::decay::decay_panics_negative_attenuation' (711264) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (10 total):
V-I6 violated at V-node 3: is_exposed=true, expected=false (state=Terminal)
V-I6 violated at V-node 7: is_exposed=true, expected=false (state=Terminal)
V-I6 violated at V-node 10: is_exposed=true, expected=false (state=Terminal)
V-I6 violated at V-node 15: is_exposed=true, expected=false (state=Terminal)
V-I6 violated at V-node 17: is_exposed=true, expected=false (state=Terminal)
V-I6 violated at V-node 23: is_exposed=true, expected=false (state=Terminal)
V-I6 violated at V-node 24: is_exposed=true, expected=false (state=Terminal)
V-I6 violated at V-node 26: is_exposed=true, expected=false (state=Terminal)
V-I6 violated at V-node 29: is_exposed=true, expected=false (state=T

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 254 passed; 92 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
