*** packages/mudlark/src/graph.rs:1000:9: replace GvGraph<C, V, N>::headroom -> usize with 1

*** mutation diff:
--- packages/mudlark/src/graph.rs
+++ replace GvGraph<C, V, N>::headroom -> usize with 1
@@ -992,17 +992,17 @@
     /// # let g = GvGraph::<u64, u64, 8>::new(cfg);
     /// // buffer = 3, so headroom = 3^(3+1) = 81.
     /// assert_eq!(g.headroom(), 81);
     /// assert_eq!(g.headroom(), 3usize.pow(g.depth_buffer() + 1));
     /// ```
     #[must_use]
     #[inline]
     pub const fn headroom(&self) -> usize {
-        self.headroom
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Internal soft limit, or `None` if no budget
     ///
     #[allow(clippy::doc_markdown)]
     /// $S = \text{budget} - \max(\text{headroom},\; 2(D_c - 1))$
     ///
     /// When `node_count` exceeds the soft limit, depth-gate

---- tests::graph::shadow_fields_match_config_on_construction stdout ----

thread 'tests::graph::shadow_fields_match_config_on_construction' (951697) panicked at packages/mudlark/src/tests/graph.rs:158:5:
assertion `left == right` failed
  left: 1
 right: 81

---- tests::graph::soft_limit_computed_correctly stdout ----

thread 'tests::graph::soft_limit_computed_correctly' (951698) panicked at packages/mudlark/src/tests/graph.rs:164:5:
assertion `left == right` failed
  left: 1
 right: 81

failures:
    tests::graph::shadow_fields_match_config_on_construction
    tests::graph::soft_limit_computed_correctly

test result: FAILED. 344 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
