*** packages/mudlark/src/graph.rs:1045:9: replace GvGraph<C, V, N>::soft_limit -> Option<usize> with None

*** mutation diff:
--- packages/mudlark/src/graph.rs
+++ replace GvGraph<C, V, N>::soft_limit -> Option<usize> with None
@@ -1037,17 +1037,17 @@
     /// # let g2 = GvGraph::<u64, u64, 8>::new(cfg2);
     /// let s = g2.soft_limit().unwrap();
     /// assert!(s < 500);
     /// assert_eq!(s, 500 - g2.headroom()); // headroom = 81 > 2*(3−1)
     /// ```
     #[must_use]
     #[inline]
     pub const fn soft_limit(&self) -> Option<usize> {
-        self.soft_limit
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     // ── Shared helpers (Phase 4) ────────────────────────────────
 
     /// Compute the G-Tree depth of a node by its interval width.
     ///
     /// Thin wrapper around [`gtree::gnode_depth_from_interval`] that
     /// captures the const-generic `N`.

---- tests::graph::soft_limit_computed_correctly stdout ----

thread 'tests::graph::soft_limit_computed_correctly' (958687) panicked at packages/mudlark/src/tests/graph.rs:165:5:
assertion `left == right` failed
  left: None
 right: Some(19)

failures:
    tests::graph::soft_limit_computed_correctly

test result: FAILED. 345 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
