*** packages/mudlark/src/graph.rs:1045:9: replace GvGraph<C, V, N>::soft_limit -> Option<usize> with Some(0)

*** mutation diff:
--- packages/mudlark/src/graph.rs
+++ replace GvGraph<C, V, N>::soft_limit -> Option<usize> with Some(0)
@@ -1037,17 +1037,17 @@
     /// # let g2 = GvGraph::<u64, u64, 8>::new(cfg2);
     /// let s = g2.soft_limit().unwrap();
     /// assert!(s < 500);
     /// assert_eq!(s, 500 - g2.headroom()); // headroom = 81 > 2*(3−1)
     /// ```
     #[must_use]
     #[inline]
     pub const fn soft_limit(&self) -> Option<usize> {
-        self.soft_limit
+        Some(0) /* ~ changed by cargo-mutants ~ */
     }
 
     // ── Shared helpers (Phase 4) ────────────────────────────────
 
     /// Compute the G-Tree depth of a node by its interval width.
     ///
     /// Thin wrapper around [`gtree::gnode_depth_from_interval`] that
     /// captures the const-generic `N`.

---- tests::graph::shadow_fields_match_config_on_construction stdout ----

thread 'tests::graph::shadow_fields_match_config_on_construction' (968067) panicked at packages/mudlark/src/tests/graph.rs:157:5:
assertion `left == right` failed
  left: Some(0)
 right: None

---- tests::graph::soft_limit_computed_correctly stdout ----

thread 'tests::graph::soft_limit_computed_correctly' (968068) panicked at packages/mudlark/src/tests/graph.rs:165:5:
assertion `left == right` failed
  left: Some(0)
 right: Some(19)

---- tests::worked_example::depth_gates_unchanged_without_budget stdout ----

thread 'tests::worked_example::depth_gates_unchanged_without_budget' (968298) panicked at packages/mudlark/src/tests/worked_example.rs:412:5:
assertion `left == right` failed: no soft limit without budget
  left: Some(0)
 right: None

failures:
    tests::graph::shadow_fields_match_config_on_construction
    tests::graph::soft_limit_computed_correctly
    tests::worked_example::depth_gates_unchanged_without_budget

test result: FAILED. 343 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
