*** packages/mudlark/src/graph.rs:1107:12: delete ! in GvGraph<C, V, N>::gnode_info

*** mutation diff:
--- packages/mudlark/src/graph.rs
+++ delete ! in GvGraph<C, V, N>::gnode_info
@@ -1099,17 +1099,17 @@
     /// // Root is always live.
     /// let info = g.gnode_info(g.g_root()).unwrap();
     /// assert_eq!(info.start, 0);
     /// assert_eq!(info.end, 256);
     /// assert!(info.parent.is_none());
     /// ```
     #[must_use]
     pub fn gnode_info(&self, id: GNodeId) -> Option<GNodeInfo<C, V>> {
-        if !self.gnodes.is_occupied(id.index()) {
+        if  /* ~ changed by cargo-mutants ~ */self.gnodes.is_occupied(id.index()) {
             return None;
         }
         let g = self.gnodes.get(id.index());
         Some(GNodeInfo {
             start: g.lo,
             end: g.hi,
             own: g.own,
             sum: g.sum,

---- gnode_info_sum_equals_own_plus_children stdout ----

thread 'gnode_info_sum_equals_own_plus_children' (961422) panicked at packages/mudlark/tests/sentinel_api.rs:192:48:
called `Option::unwrap()` on a `None` value

---- is_ancestor_of_parent_child stdout ----

thread 'is_ancestor_of_parent_child' (961423) panicked at packages/mudlark/tests/sentinel_api.rs:264:48:
called `Option::unwrap()` on a `None` value

---- gnode_info_children_consistent stdout ----

thread 'gnode_info_children_consistent' (961417) panicked at packages/mudlark/tests/sentinel_api.rs:101:48:
called `Option::unwrap()` on a `None` value

failures:
    gnode_info_children_consistent
    gnode_info_dead_handle
    gnode_info_live_node
    gnode_info_root_has_no_parent
    gnode_info_sum_equals_own_plus_children
    is_ancestor_of_parent_child
    is_ancestor_of_sibling_is_false
    is_ancestor_of_transitive
    node_carries_gnode_id
    range_tree_gnode_ids_consistent

test result: FAILED. 4 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
