*** packages/mudlark/src/graph.rs:1167:55: replace || with && in GvGraph<C, V, N>::is_ancestor_of

*** mutation diff:
--- packages/mudlark/src/graph.rs
+++ replace || with && in GvGraph<C, V, N>::is_ancestor_of
@@ -1159,17 +1159,17 @@
     ///         assert!(g.is_ancestor_of(root, node.gnode_id));
     ///     }
     /// }
     /// // A node is not its own proper ancestor.
     /// assert!(!g.is_ancestor_of(root, root));
     /// ```
     #[must_use]
     pub fn is_ancestor_of(&self, ancestor: GNodeId, descendant: GNodeId) -> bool {
-        if !self.gnodes.is_occupied(ancestor.index()) || !self.gnodes.is_occupied(descendant.index()) {
+        if !self.gnodes.is_occupied(ancestor.index()) && /* ~ changed by cargo-mutants ~ */ !self.gnodes.is_occupied(descendant.index()) {
             return false;
         }
         let a = self.gnodes.get(ancestor.index());
         let d = self.gnodes.get(descendant.index());
         a.lo <= d.lo && a.hi >= d.hi && (a.lo != d.lo || a.hi != d.hi)
     }
 }

---- is_ancestor_of_stale_handles stdout ----

thread 'is_ancestor_of_stale_handles' (968965) panicked at packages/mudlark/src/arena.rs:93:9:
Arena::get: slot 3 is not occupied

failures:
    is_ancestor_of_stale_handles

test result: FAILED. 13 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
