*** packages/mudlark/src/graph.rs:1167:58: delete ! in GvGraph<C, V, N>::is_ancestor_of

*** mutation diff:
--- packages/mudlark/src/graph.rs
+++ delete ! in GvGraph<C, V, N>::is_ancestor_of
@@ -1159,17 +1159,17 @@
     ///         assert!(g.is_ancestor_of(root, node.gnode_id));
     ///     }
     /// }
     /// // A node is not its own proper ancestor.
     /// assert!(!g.is_ancestor_of(root, root));
     /// ```
     #[must_use]
     pub fn is_ancestor_of(&self, ancestor: GNodeId, descendant: GNodeId) -> bool {
-        if !self.gnodes.is_occupied(ancestor.index()) || !self.gnodes.is_occupied(descendant.index()) {
+        if !self.gnodes.is_occupied(ancestor.index()) ||  /* ~ changed by cargo-mutants ~ */self.gnodes.is_occupied(descendant.index()) {
             return false;
         }
         let a = self.gnodes.get(ancestor.index());
         let d = self.gnodes.get(descendant.index());
         a.lo <= d.lo && a.hi >= d.hi && (a.lo != d.lo || a.hi != d.hi)
     }
 }

---- is_ancestor_of_parent_child stdout ----

thread 'is_ancestor_of_parent_child' (974336) panicked at packages/mudlark/tests/sentinel_api.rs:267:13:
assertion failed: g.is_ancestor_of(node.gnode_id, left)

---- is_ancestor_of_root_ancestors_all stdout ----

thread 'is_ancestor_of_root_ancestors_all' (974337) panicked at packages/mudlark/tests/sentinel_api.rs:218:13:
root should be ancestor of GNodeId(13)

---- is_ancestor_of_transitive stdout ----

thread 'is_ancestor_of_transitive' (974368) panicked at packages/mudlark/tests/sentinel_api.rs:338:17:
GNodeId(3) (depth j=1) should be ancestor of GNodeId(12) (depth i=0)

failures:
    is_ancestor_of_parent_child
    is_ancestor_of_root_ancestors_all
    is_ancestor_of_stale_handles
    is_ancestor_of_transitive

test result: FAILED. 10 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
