*** packages/mudlark/src/graph.rs:1172:47: replace != with == in GvGraph<C, V, N>::is_ancestor_of

*** mutation diff:
--- packages/mudlark/src/graph.rs
+++ replace != with == in GvGraph<C, V, N>::is_ancestor_of
@@ -1164,14 +1164,14 @@
     /// ```
     #[must_use]
     pub fn is_ancestor_of(&self, ancestor: GNodeId, descendant: GNodeId) -> bool {
         if !self.gnodes.is_occupied(ancestor.index()) || !self.gnodes.is_occupied(descendant.index()) {
             return false;
         }
         let a = self.gnodes.get(ancestor.index());
         let d = self.gnodes.get(descendant.index());
-        a.lo <= d.lo && a.hi >= d.hi && (a.lo != d.lo || a.hi != d.hi)
+        a.lo <= d.lo && a.hi >= d.hi && (a.lo == /* ~ changed by cargo-mutants ~ */ d.lo || a.hi != d.hi)
     }
 }
 
 // SpatialRead, SpatialWrite, and WeightedSampler trait impls live in
 // graph_traits.rs — see ADR-M-030 Phase F.

---- is_ancestor_of_self_is_false stdout ----

thread 'is_ancestor_of_self_is_false' (992837) panicked at packages/mudlark/tests/sentinel_api.rs:233:5:
assertion failed: !g.is_ancestor_of(root, root)

---- is_ancestor_of_root_ancestors_all stdout ----

thread 'is_ancestor_of_root_ancestors_all' (992836) panicked at packages/mudlark/tests/sentinel_api.rs:218:13:
root should be ancestor of GNodeId(13)

---- is_ancestor_of_parent_child stdout ----

thread 'is_ancestor_of_parent_child' (992835) panicked at packages/mudlark/tests/sentinel_api.rs:271:13:
assertion failed: g.is_ancestor_of(node.gnode_id, right)

failures:
    is_ancestor_of_parent_child
    is_ancestor_of_root_ancestors_all
    is_ancestor_of_self_is_false
    is_ancestor_of_transitive

test result: FAILED. 10 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
