*** packages/mudlark/src/graph.rs:1172:55: replace || with && in GvGraph<C, V, N>::is_ancestor_of

*** mutation diff:
--- packages/mudlark/src/graph.rs
+++ replace || with && in GvGraph<C, V, N>::is_ancestor_of
@@ -1164,14 +1164,14 @@
     /// ```
     #[must_use]
     pub fn is_ancestor_of(&self, ancestor: GNodeId, descendant: GNodeId) -> bool {
         if !self.gnodes.is_occupied(ancestor.index()) || !self.gnodes.is_occupied(descendant.index()) {
             return false;
         }
         let a = self.gnodes.get(ancestor.index());
         let d = self.gnodes.get(descendant.index());
-        a.lo <= d.lo && a.hi >= d.hi && (a.lo != d.lo || a.hi != d.hi)
+        a.lo <= d.lo && a.hi >= d.hi && (a.lo != d.lo && /* ~ changed by cargo-mutants ~ */ a.hi != d.hi)
     }
 }
 
 // SpatialRead, SpatialWrite, and WeightedSampler trait impls live in
 // graph_traits.rs — see ADR-M-030 Phase F.

---- is_ancestor_of_parent_child stdout ----

thread 'is_ancestor_of_parent_child' (992878) panicked at packages/mudlark/tests/sentinel_api.rs:267:13:
assertion failed: g.is_ancestor_of(node.gnode_id, left)

---- is_ancestor_of_root_ancestors_all stdout ----

thread 'is_ancestor_of_root_ancestors_all' (992879) panicked at packages/mudlark/tests/sentinel_api.rs:218:13:
root should be ancestor of GNodeId(13)

---- is_ancestor_of_transitive stdout ----

thread 'is_ancestor_of_transitive' (992883) panicked at packages/mudlark/tests/sentinel_api.rs:338:17:
GNodeId(3) (depth j=1) should be ancestor of GNodeId(12) (depth i=0)

failures:
    is_ancestor_of_parent_child
    is_ancestor_of_root_ancestors_all
    is_ancestor_of_transitive

test result: FAILED. 11 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
