*** packages/mudlark/src/graph.rs:241:9: replace Config<V>::validate with ()

*** mutation diff:
--- packages/mudlark/src/graph.rs
+++ replace Config<V>::validate with ()
@@ -233,44 +233,17 @@
 impl<V: Accumulator> Config<V> {
     /// Validate the configuration.
     ///
     /// Checks:
     /// - D-I3: `D_create < D_evict`.
     /// - `D_create ≥ 1` (root must be able to subdivide).
     /// - `alpha_relax ∈ (0.0, 1.0)`.
     fn validate(&self) {
-        assert!(
-            self.depth_create < self.depth_evict,
-            "Config: D_create ({}) must be < D_evict ({}) (idea.md D-I3)",
-            self.depth_create,
-            self.depth_evict
-        );
-        assert!(
-            self.depth_create >= 1,
-            "Config: D_create ({}) must be >= 1",
-            self.depth_create
-        );
-        assert!(
-            self.alpha_relax > 0.0 && self.alpha_relax < 1.0,
-            "Config: alpha_relax ({}) must be in (0.0, 1.0)",
-            self.alpha_relax
-        );
-        if let Some(budget) = self.budget {
-            let buffer = self.depth_evict - self.depth_create;
-            let headroom = 3usize.pow(buffer + 1);
-            let convergence = 2 * (self.depth_create as usize).saturating_sub(1);
-            let required = headroom.max(convergence);
-            assert!(
-                budget > required,
-                "Config: budget ({budget}) must be > max(3^(buffer+1), 2*(D_c-1)) \
-                 = {required} (ADR-M-018: budget must exceed required headroom \
-                 for hard ceiling guarantee)"
-            );
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 }
 
 // ── Uniform contour depth helper ──────────────────────────────────
 
 /// Check whether a G-node's subtree has uniform contour depth.
 ///
 /// Returns `Some(d)` if *every* contour cell (terminal or uncovered

---- tests::graph::config_rejects_budget_below_headroom stdout ----

thread 'tests::graph::config_rejects_budget_below_headroom' (859030) panicked at packages/mudlark/src/graph.rs:538:21:
attempt to subtract with overflow
note: panic did not contain expected string
      panic message: "attempt to subtract with overflow"
 expected substring: "budget"

---- tests::graph::config_validates_alpha_relax_one stdout ----
note: test did not panic as expected at packages/mudlark/src/tests/graph.rs:93:4

---- tests::graph::config_validates_alpha_relax_zero stdout ----
note: test did not panic as expected at packages/mudlark/src/tests/graph.rs:79:4

failures:
    tests::graph::config_rejects_budget_below_headroom
    tests::graph::config_validates_alpha_relax_one
    tests::graph::config_validates_alpha_relax_zero
    tests::graph::config_validates_depth_create_zero
    tests::graph::config_validates_depth_gate

test result: FAILED. 341 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
