*** packages/mudlark/src/graph.rs:258:43: replace - with + in Config<V>::validate

*** mutation diff:
--- packages/mudlark/src/graph.rs
+++ replace - with + in Config<V>::validate
@@ -250,17 +250,17 @@
             self.depth_create
         );
         assert!(
             self.alpha_relax > 0.0 && self.alpha_relax < 1.0,
             "Config: alpha_relax ({}) must be in (0.0, 1.0)",
             self.alpha_relax
         );
         if let Some(budget) = self.budget {
-            let buffer = self.depth_evict - self.depth_create;
+            let buffer = self.depth_evict + /* ~ changed by cargo-mutants ~ */ self.depth_create;
             let headroom = 3usize.pow(buffer + 1);
             let convergence = 2 * (self.depth_create as usize).saturating_sub(1);
             let required = headroom.max(convergence);
             assert!(
                 budget > required,
                 "Config: budget ({budget}) must be > max(3^(buffer+1), 2*(D_c-1)) \
                  = {required} (ADR-M-018: budget must exceed required headroom \
                  for hard ceiling guarantee)"

---- tests::diagnostic::evict_tip_creates_span stdout ----

thread 'tests::diagnostic::evict_tip_creates_span' (858528) panicked at packages/mudlark/src/graph.rs:262:13:
Config: budget (20) must be > max(3^(buffer+1), 2*(D_c-1)) = 6561 (ADR-M-018: budget must exceed required headroom for hard ceiling guarantee)

---- tests::diagnostic::eviction_pipeline_creates_spans stdout ----

thread 'tests::diagnostic::eviction_pipeline_creates_spans' (858529) panicked at packages/mudlark/src/graph.rs:262:13:
Config: budget (20) must be > max(3^(buffer+1), 2*(D_c-1)) = 6561 (ADR-M-018: budget must exceed required headroom for hard ceiling guarantee)

---- tests::diagnostic::vtree_remove_leaf_creates_span stdout ----

thread 'tests::diagnostic::vtree_remove_leaf_creates_span' (858543) panicked at packages/mudlark/src/graph.rs:262:13:
Config: budget (20) must be > max(3^(buffer+1), 2*(D_c-1)) = 6561 (ADR-M-018: budget must exceed required headroom for hard ceiling guarantee)

failures:
    tests::diagnostic::evict_tip_creates_span
    tests::diagnostic::eviction_pipeline_creates_spans
    tests::diagnostic::vtree_remove_leaf_creates_span
    tests::graph::dead_zone_no_change
    tests::graph::di3_maintained_through_full_tighten_relax_cycle
    tests::graph::floor_prevents_excessive_tightening
    tests::graph::no_ceiling_relax_above_initial
    tests::graph::relax_when_under_alpha_budget
    tests::graph::soft_limit_computed_correctly
    tests::graph::tighten_when_over_budget
    tests::observe::observe_invariants_hold_after_eviction_cycle
    tests::observe::observe_triggers_eviction_when_over_budget

test result: FAILED. 332 passed; 14 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
