*** packages/mudlark/src/graph.rs:259:46: replace + with - in Config<V>::validate

*** mutation diff:
--- packages/mudlark/src/graph.rs
+++ replace + with - in Config<V>::validate
@@ -251,17 +251,17 @@
         );
         assert!(
             self.alpha_relax > 0.0 && self.alpha_relax < 1.0,
             "Config: alpha_relax ({}) must be in (0.0, 1.0)",
             self.alpha_relax
         );
         if let Some(budget) = self.budget {
             let buffer = self.depth_evict - self.depth_create;
-            let headroom = 3usize.pow(buffer + 1);
+            let headroom = 3usize.pow(buffer - /* ~ changed by cargo-mutants ~ */ 1);
             let convergence = 2 * (self.depth_create as usize).saturating_sub(1);
             let required = headroom.max(convergence);
             assert!(
                 budget > required,
                 "Config: budget ({budget}) must be > max(3^(buffer+1), 2*(D_c-1)) \
                  = {required} (ADR-M-018: budget must exceed required headroom \
                  for hard ceiling guarantee)"
             );

---- tests::graph::config_rejects_budget_below_headroom stdout ----

thread 'tests::graph::config_rejects_budget_below_headroom' (863770) panicked at packages/mudlark/src/graph.rs:565:21:
attempt to subtract with overflow
note: panic did not contain expected string
      panic message: "attempt to subtract with overflow"
 expected substring: "budget"

failures:
    tests::graph::config_rejects_budget_below_headroom

test result: FAILED. 345 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.15s

*** result: Failure(101)
