*** packages/mudlark/src/graph.rs:294:19: replace == with != in uniform_contour_depth_of

*** mutation diff:
--- packages/mudlark/src/graph.rs
+++ replace == with != in uniform_contour_depth_of
@@ -286,17 +286,17 @@
     use crate::gtree::gnode_depth_from_interval;
     let g = gnodes.get(gid.index());
     match g.state() {
         GState::Terminal => Some(gnode_depth_from_interval(g.lo, g.hi, n)),
         GState::SemiInternal => None,
         GState::Internal => {
             let ld = g.left.and_then(|l| uniform_contour_depth_of(gnodes, l, n))?;
             let rd = g.right.and_then(|r| uniform_contour_depth_of(gnodes, r, n))?;
-            if ld == rd {
+            if ld != /* ~ changed by cargo-mutants ~ */ rd {
                 Some(ld)
             } else {
                 None
             }
         }
     }
 }

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (888320) panicked at packages/mudlark/src/graph_plateau.rs:193:13:
POST-SPLIT: dynamic-contour-tracking mirror diverged from static rebuild
left (dynamic): {
    BasisEdge(
        0,
    ): Plateau {
        basis_edge: BasisEdge(
            0,
        ),
        start: 0,
        end: 16,
        depth: 1,

---- tests::decay::decay_amplification_above_one stdout ----

thread 'tests::decay::decay_amplification_above_one' (888319) panicked at packages/mudlark/src/graph_plateau.rs:193:13:
POST-SPLIT: dynamic-contour-tracking mirror diverged from static rebuild
left (dynamic): {
    BasisEdge(
        0,
    ): Plateau {
        basis_edge: BasisEdge(
            0,
        ),
        start: 0,
        end: 16,
        depth: 1,

---- tests::decay::decay_energy_conservation_uniform stdout ----

thread 'tests::decay::decay_energy_conservation_uniform' (888322) panicked at packages/mudlark/src/graph_plateau.rs:193:13:
POST-SPLIT: dynamic-contour-tracking mirror diverged from static rebuild
left (dynamic): {
    BasisEdge(
        0,
    ): Plateau {
        basis_edge: BasisEdge(
            0,
        ),
        start: 0,
        end: 16,
        depth: 1,

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 244 passed; 102 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
