*** packages/mudlark/src/graph.rs:648:9: replace GvGraph<C, V, N>::node_count -> u32 with 0

*** mutation diff:
--- packages/mudlark/src/graph.rs
+++ replace GvGraph<C, V, N>::node_count -> u32 with 0
@@ -640,17 +640,17 @@
     /// for _ in 0..10 {
     ///     g.observe(42, 1u64);
     /// }
     /// assert!(g.node_count() > 1);
     /// ```
     #[must_use]
     #[inline]
     pub const fn node_count(&self) -> u32 {
-        self.node_count
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Number of terminal G-nodes (leaves with zero G-children).
     ///
     /// Maintained incrementally: +1 net per split, −1 per eviction
     /// (unless the parent becomes terminal, in which case net 0).
     ///
     /// # Examples

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (890662) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
Node count: graph.node_count()=0, arena count=19

---- tests::decay::decay_panics_nan_attenuation stdout ----

thread 'tests::decay::decay_panics_nan_attenuation' (890672) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
Node count: graph.node_count()=0, arena count=19
note: panic did not contain expected string
      panic message: "Invariant violations (1 total):\nNode count: graph.node_count()=0, arena count=19"
 expected substring: "attenuation must be > 0"

---- tests::decay::decay_multiple_uniform_preserves_invariants stdout ----

thread 'tests::decay::decay_multiple_uniform_preserves_invariants' (890670) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
Node count: graph.node_count()=0, arena count=19

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 253 passed; 93 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
