*** packages/mudlark/src/graph.rs:681:9: replace GvGraph<C, V, N>::terminal_count -> u32 with 1

*** mutation diff:
--- packages/mudlark/src/graph.rs
+++ replace GvGraph<C, V, N>::terminal_count -> u32 with 1
@@ -673,17 +673,17 @@
     /// for _ in 0..10 {
     ///     g.observe(42, 1u64);
     /// }
     /// assert!(g.terminal_count() >= 2);
     /// ```
     #[must_use]
     #[inline]
     pub const fn terminal_count(&self) -> u32 {
-        self.terminal_count
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     // Plateau tracking methods (plateaus, build_plateaus, plateau_basis,
     // debug_plateau_basis, recompute_plateau, place_basis_element,
     // place_subtree_basis_elements, consolidate_basis_up, normalize_plateaus,
     // consolidate_all_basis, debug_check_plateau_sums,
     // fixup_plateau, repair_p_i4, split_for_p_i4, find_boundary_node,
     // plateau_after_observe, plateau_after_bootstrap_split,

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (903113) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
Terminal count: graph.terminal_count()=1, arena walk=10

---- tests::decay::decay_f64_tree stdout ----

thread 'tests::decay::decay_f64_tree' (903116) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
Terminal count: graph.terminal_count()=1, arena walk=8

---- tests::decay::decay_amplification_above_one stdout ----

thread 'tests::decay::decay_amplification_above_one' (903112) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
Terminal count: graph.terminal_count()=1, arena walk=10

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 266 passed; 80 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
