*** packages/mudlark/src/graph.rs:759:9: replace GvGraph<C, V, N>::budget -> Option<usize> with None

*** mutation diff:
--- packages/mudlark/src/graph.rs
+++ replace GvGraph<C, V, N>::budget -> Option<usize> with None
@@ -751,17 +751,17 @@
     /// #     bounded_eviction: true,
     /// # };
     /// # let g2 = GvGraph::<u64, u64, 8>::new(config2);
     /// assert_eq!(g2.budget(), Some(500));
     /// ```
     #[must_use]
     #[inline]
     pub const fn budget(&self) -> Option<usize> {
-        self.config.budget
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     // Budget enforcement, depth-gate adjustment, eviction orchestration,
     // and handle_legacy_promotes live in graph_budget.rs — see ADR-M-030
     // Phase E.
 
     /// The G-Tree root handle (always valid).
     ///

error: doctest failed, to rerun pass `-p torrust-mudlark --doc`

---- packages/mudlark/src/graph.rs - graph::GvGraph<C,V,N>::budget (line 730) stdout ----
Test executable failed (exit status: 101).

stderr:

thread 'main' (907020) panicked at packages/mudlark/src/graph.rs:28:1:
assertion `left == right` failed
  left: None
 right: Some(500)

---- packages/mudlark/src/graph.rs - graph::Config (line 165) stdout ----
Test executable failed (exit status: 101).

stderr:

thread 'main' (907227) panicked at packages/mudlark/src/graph.rs:21:1:
assertion `left == right` failed
  left: None
 right: Some(128)

failures:
    packages/mudlark/src/graph.rs - graph::Config (line 165)
    packages/mudlark/src/graph.rs - graph::GvGraph<C,V,N>::budget (line 730)

test result: FAILED. 104 passed; 2 failed; 1 ignored; 0 measured; 0 filtered out; finished in 5.16s

*** result: Failure(101)
