*** packages/mudlark/src/graph.rs:818:9: replace GvGraph<C, V, N>::v_root -> Option<VNodeId> with None

*** mutation diff:
--- packages/mudlark/src/graph.rs
+++ replace GvGraph<C, V, N>::v_root -> Option<VNodeId> with None
@@ -810,17 +810,17 @@
     /// # };
     /// # let g = GvGraph::<u64, u64, 8>::new(cfg);
     /// // Always present after construction.
     /// assert!(g.v_root().is_some());
     /// ```
     #[must_use]
     #[inline]
     pub const fn v_root(&self) -> Option<VNodeId> {
-        self.v_root
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// Total accumulated value across the entire domain.
     ///
     /// Equivalent to the G-root's `sum` field — the aggregate of
     /// every observation ever applied to the graph.  O(1).
     ///
     /// # Examples

---- tests::graph_init::initialize_single_root stdout ----

thread 'tests::graph_init::initialize_single_root' (920783) panicked at packages/mudlark/src/tests/graph_init.rs:14:5:
assertion failed: graph.v_root().is_some()

---- tests::split::bootstrap_split_creates_correct_structure stdout ----

thread 'tests::split::bootstrap_split_creates_correct_structure' (920937) panicked at packages/mudlark/src/tests/split.rs:115:33:
called `Option::unwrap()` on a `None` value

---- tests::worked_example::step1_v_tree_structure stdout ----

thread 'tests::worked_example::step1_v_tree_structure' (921052) panicked at packages/mudlark/src/tests/worked_example.rs:88:25:
v_root should exist

failures:
    tests::graph_init::initialize_single_root
    tests::split::bootstrap_split_creates_correct_structure
    tests::worked_example::step1_v_tree_structure
    tests::worked_example::step2_v_tree_after_skip_promote
    tests::worked_example::step3_v_tree_uncle_shield
    tests::worked_example::worked_example_full_sequence

test result: FAILED. 340 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
