*** packages/mudlark/src/graph.rs:848:9: replace GvGraph<C, V, N>::total_sum -> V with Default::default()

*** mutation diff:
--- packages/mudlark/src/graph.rs
+++ replace GvGraph<C, V, N>::total_sum -> V with Default::default()
@@ -840,17 +840,17 @@
     ///
     /// g.observe(10, 3u64);
     /// g.observe(20, 7u64);
     /// assert_eq!(g.total_sum(), 10u64);
     /// ```
     #[must_use]
     #[inline]
     pub fn total_sum(&self) -> V {
-        self.gnodes.get(self.g_root.index()).sum
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Read-only access to the G-node arena.
     ///
     /// `pub(crate)` — Surface 3 (Emulsion). External consumers use
     /// the public query surface (`get`, `range_sum`, `plateaus`,
     /// `sample`, `extract`, `layers`) instead.
     #[must_use]

---- energy_conserved_at_hard_budget_limit stdout ----

thread 'energy_conserved_at_hard_budget_limit' (923654) panicked at packages/mudlark/tests/budget.rs:200:5:
assertion `left == right` failed: energy conservation violated at hard budget minimum
  left: 0
 right: 1994

---- energy_conserved_with_budget stdout ----

thread 'energy_conserved_with_budget' (923655) panicked at packages/mudlark/tests/budget.rs:96:5:
assertion `left == right` failed: G-root sum must equal total observation energy
  left: 0
 right: 1197

---- skewed_load_under_budget stdout ----

thread 'skewed_load_under_budget' (923666) panicked at packages/mudlark/tests/budget.rs:242:5:
assertion `left == right` failed
  left: 0
 right: 2406

failures:
    bounded_and_unbounded_both_respect_hard_limit
    energy_conserved_at_hard_budget_limit
    energy_conserved_with_budget
    skewed_load_under_budget

test result: FAILED. 20 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
