*** packages/mudlark/src/graph.rs:911:9: replace GvGraph<C, V, N>::depth_evict -> u32 with 1

*** mutation diff:
--- packages/mudlark/src/graph.rs
+++ replace GvGraph<C, V, N>::depth_evict -> u32 with 1
@@ -903,17 +903,17 @@
     /// #     bounded_eviction: true,
     /// # };
     /// # let g = GvGraph::<u64, u64, 8>::new(cfg);
     /// assert_eq!(g.depth_evict(), 6);
     /// ```
     #[must_use]
     #[inline]
     pub const fn depth_evict(&self) -> u32 {
-        self.live_depth_evict
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Current (dynamic) `D_create` depth gate
     ///
     /// Splits are only authorized when the target entry's V-depth
     /// is at most `D_create`.  Starts at [`Config::depth_create`]
     /// and moves in lockstep with `D_evict` to preserve the buffer
     /// zone (ADR-M-017).

---- tests::decay::decay_f64_tree stdout ----

thread 'tests::decay::decay_f64_tree' (934593) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (2 total):
D-I3: live_depth_create (3) must be < live_depth_evict (1)
D-I3 floor: live_depth_evict (1) < depth_buffer (5) + 1

---- tests::decay::decay_amplification_above_one stdout ----

thread 'tests::decay::decay_amplification_above_one' (934589) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (2 total):
D-I3: live_depth_create (3) must be < live_depth_evict (1)
D-I3 floor: live_depth_evict (1) < depth_buffer (5) + 1

---- tests::decay::decay_energy_conservation_uniform stdout ----

thread 'tests::decay::decay_energy_conservation_uniform' (934592) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (2 total):
D-I3: live_depth_create (3) must be < live_depth_evict (1)
D-I3 floor: live_depth_evict (1) < depth_buffer (5) + 1

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 248 passed; 98 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
