*** packages/mudlark/src/graph.rs:940:9: replace GvGraph<C, V, N>::depth_create -> u32 with 1

*** mutation diff:
--- packages/mudlark/src/graph.rs
+++ replace GvGraph<C, V, N>::depth_create -> u32 with 1
@@ -932,17 +932,17 @@
     /// # };
     /// # let g = GvGraph::<u64, u64, 8>::new(cfg);
     /// assert_eq!(g.depth_create(), 3);
     /// assert!(g.depth_create() < g.depth_evict());
     /// ```
     #[must_use]
     #[inline]
     pub const fn depth_create(&self) -> u32 {
-        self.live_depth_create
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Buffer zone width (`D_evict − D_create`), fixed at construction
     ///
     /// The buffer zone separates the creation and eviction gates so
     /// that newly-split entries have room to prove their significance
     /// before becoming eviction-eligible.
     ///

---- tests::decay::decay_f64_tree stdout ----

thread 'tests::decay::decay_f64_tree' (940326) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
D-I3 buffer: live_depth_create (1) != live_depth_evict (8) - depth_buffer (5)

---- tests::decay::decay_energy_conservation_selective stdout ----

thread 'tests::decay::decay_energy_conservation_selective' (940324) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
D-I3 buffer: live_depth_create (1) != live_depth_evict (8) - depth_buffer (5)

---- tests::decay::decay_energy_conservation_uniform stdout ----

thread 'tests::decay::decay_energy_conservation_uniform' (940325) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
D-I3 buffer: live_depth_create (1) != live_depth_evict (8) - depth_buffer (5)

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 259 passed; 87 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
