*** packages/mudlark/src/graph.rs:969:9: replace GvGraph<C, V, N>::depth_buffer -> u32 with 1

*** mutation diff:
--- packages/mudlark/src/graph.rs
+++ replace GvGraph<C, V, N>::depth_buffer -> u32 with 1
@@ -961,17 +961,17 @@
     /// # let g = GvGraph::<u64, u64, 8>::new(cfg);
     /// // buffer = D_evict − D_create = 6 − 3 = 3.
     /// assert_eq!(g.depth_buffer(), 3);
     /// assert_eq!(g.depth_buffer(), g.depth_evict() - g.depth_create());
     /// ```
     #[must_use]
     #[inline]
     pub const fn depth_buffer(&self) -> u32 {
-        self.depth_buffer
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Headroom: $3^{(\text{buffer}+1)}$ — worst-case entries immune
     /// to eviction at the depth floor (ADR-M-018)
     ///
     /// With V-Tree branching factor up to 3, at most
     /// $3^{(\text{buffer}+1)}$ entries can reside between the root
     /// and `D_evict`.  These entries are not evictable, so any

---- tests::decay::decay_energy_conservation_uniform stdout ----

thread 'tests::decay::decay_energy_conservation_uniform' (948552) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
D-I3 buffer: live_depth_create (3) != live_depth_evict (8) - depth_buffer (1)

---- tests::decay::decay_energy_conservation_selective stdout ----

thread 'tests::decay::decay_energy_conservation_selective' (948551) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
D-I3 buffer: live_depth_create (3) != live_depth_evict (8) - depth_buffer (1)

---- tests::decay::decay_amplification_above_one stdout ----

thread 'tests::decay::decay_amplification_above_one' (948549) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
D-I3 buffer: live_depth_create (3) != live_depth_evict (8) - depth_buffer (1)

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 265 passed; 81 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
