*** packages/mudlark/src/graph_budget.rs:139:9: replace GvGraph<C, V, N>::check_evictions -> u32 with 0

*** mutation diff:
--- packages/mudlark/src/graph_budget.rs
+++ replace GvGraph<C, V, N>::check_evictions -> u32 with 0
@@ -131,18 +131,17 @@
     ///
     /// // After some observations, eviction may still return 0 if
     /// // no entry exceeds the depth gate.
     /// g.observe(42, 10u64);
     /// let evicted = g.check_evictions();
     /// assert_eq!(evicted, 0);
     /// ```
     pub fn check_evictions(&mut self) -> u32 {
-        let _span = tracing::debug_span!("check_evictions", d_evict = self.live_depth_evict).entered();
-        self.evict_candidates(None)
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Evict candidates up to a budget-derived limit (bounded mode).
     ///
     /// Like `check_evictions()` but stops after `stop_at` evictions.
     pub(crate) fn check_evictions_bounded(&mut self, stop_at: usize) -> u32 {
         self.evict_candidates(Some(stop_at))
     }

---- tests::graph::check_evictions_unbounded_evicts_all stdout ----

thread 'tests::graph::check_evictions_unbounded_evicts_all' (1498043) panicked at packages/mudlark/src/tests/graph.rs:257:5:
should evict at least one candidate

---- tests::graph::get_semi_internal_right_child_trims_left stdout ----

thread 'tests::graph::get_semi_internal_right_child_trims_left' (1498055) panicked at packages/mudlark/src/tests/graph.rs:387:5:
expected at least one semi-internal after eviction

---- tests::graph::get_semi_internal_left_child_trims_right stdout ----

thread 'tests::graph::get_semi_internal_left_child_trims_right' (1498054) panicked at packages/mudlark/src/tests/graph.rs:355:5:
expected at least one semi-internal after eviction

failures:
    tests::graph::check_evictions_unbounded_evicts_all
    tests::graph::get_semi_internal_left_child_trims_right
    tests::graph::get_semi_internal_right_child_trims_left

test result: FAILED. 343 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
