*** packages/mudlark/src/graph_budget.rs:174:16: delete ! in GvGraph<C, V, N>::evict_candidates

*** mutation diff:
--- packages/mudlark/src/graph_budget.rs
+++ delete ! in GvGraph<C, V, N>::evict_candidates
@@ -166,17 +166,17 @@
             if let Some(limit) = stop_at {
                 if evicted as usize >= limit {
                     break;
                 }
             }
 
             // Re-verify eligibility: the slot may have been
             // invalidated by a prior eviction in this batch.
-            if !self.vnodes.is_occupied(v_id.index()) {
+            if  /* ~ changed by cargo-mutants ~ */self.vnodes.is_occupied(v_id.index()) {
                 continue;
             }
             match &self.vnodes.get(v_id.index()).kind {
                 crate::vnode::VKind::Entry { gnode, is_evictable, .. } => {
                     if !is_evictable {
                         continue;
                     }
                     if *gnode == self.g_root {

---- tests::diagnostic::evict_tip_creates_span stdout ----

thread 'tests::diagnostic::evict_tip_creates_span' (1505461) panicked at packages/mudlark/src/tests/diagnostic.rs:348:5:

---- tests::diagnostic::vtree_remove_leaf_creates_span stdout ----

thread 'tests::diagnostic::vtree_remove_leaf_creates_span' (1505476) panicked at packages/mudlark/src/tests/diagnostic.rs:413:5:

---- tests::graph::check_evictions_unbounded_evicts_all stdout ----

thread 'tests::graph::check_evictions_unbounded_evicts_all' (1505500) panicked at packages/mudlark/src/tests/graph.rs:257:5:
should evict at least one candidate

failures:
    tests::diagnostic::evict_tip_creates_span
    tests::diagnostic::vtree_remove_leaf_creates_span
    tests::graph::check_evictions_unbounded_evicts_all
    tests::graph::get_semi_internal_left_child_trims_right
    tests::graph::get_semi_internal_right_child_trims_left

test result: FAILED. 341 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
