*** packages/mudlark/src/graph_budget.rs:182:31: replace == with != in GvGraph<C, V, N>::evict_candidates

*** mutation diff:
--- packages/mudlark/src/graph_budget.rs
+++ replace == with != in GvGraph<C, V, N>::evict_candidates
@@ -174,17 +174,17 @@
             if !self.vnodes.is_occupied(v_id.index()) {
                 continue;
             }
             match &self.vnodes.get(v_id.index()).kind {
                 crate::vnode::VKind::Entry { gnode, is_evictable, .. } => {
                     if !is_evictable {
                         continue;
                     }
-                    if *gnode == self.g_root {
+                    if *gnode != /* ~ changed by cargo-mutants ~ */ self.g_root {
                         continue;
                     }
                     // Depth may have changed due to V-tree mutations.
                     let depth = vtree::v_depth(&self.vnodes, v_id);
                     if depth <= self.live_depth_evict {
                         continue;
                     }
                 }

---- tests::diagnostic::vtree_remove_leaf_creates_span stdout ----

thread 'tests::diagnostic::vtree_remove_leaf_creates_span' (1509108) panicked at packages/mudlark/src/tests/diagnostic.rs:413:5:

---- tests::diagnostic::evict_tip_creates_span stdout ----

thread 'tests::diagnostic::evict_tip_creates_span' (1509093) panicked at packages/mudlark/src/tests/diagnostic.rs:348:5:

---- tests::graph::get_semi_internal_right_child_trims_left stdout ----

thread 'tests::graph::get_semi_internal_right_child_trims_left' (1509145) panicked at packages/mudlark/src/tests/graph.rs:387:5:
expected at least one semi-internal after eviction

failures:
    tests::diagnostic::evict_tip_creates_span
    tests::diagnostic::vtree_remove_leaf_creates_span
    tests::graph::check_evictions_unbounded_evicts_all
    tests::graph::get_semi_internal_left_child_trims_right
    tests::graph::get_semi_internal_right_child_trims_left

test result: FAILED. 341 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
