*** packages/mudlark/src/graph_budget.rs:187:30: replace <= with > in GvGraph<C, V, N>::evict_candidates

*** mutation diff:
--- packages/mudlark/src/graph_budget.rs
+++ replace <= with > in GvGraph<C, V, N>::evict_candidates
@@ -179,17 +179,17 @@
                     if !is_evictable {
                         continue;
                     }
                     if *gnode == self.g_root {
                         continue;
                     }
                     // Depth may have changed due to V-tree mutations.
                     let depth = vtree::v_depth(&self.vnodes, v_id);
-                    if depth <= self.live_depth_evict {
+                    if depth > /* ~ changed by cargo-mutants ~ */ self.live_depth_evict {
                         continue;
                     }
                 }
                 crate::vnode::VKind::Structural { .. } => continue,
             }
 
             evict::evict_tip(self, v_id);
             evicted += 1;

---- tests::diagnostic::evict_tip_creates_span stdout ----

thread 'tests::diagnostic::evict_tip_creates_span' (1510273) panicked at packages/mudlark/src/tests/diagnostic.rs:348:5:

---- tests::graph::get_semi_internal_left_child_trims_right stdout ----

thread 'tests::graph::get_semi_internal_left_child_trims_right' (1510325) panicked at packages/mudlark/src/tests/graph.rs:355:5:
expected at least one semi-internal after eviction

---- tests::graph::get_semi_internal_right_child_trims_left stdout ----

thread 'tests::graph::get_semi_internal_right_child_trims_left' (1510327) panicked at packages/mudlark/src/tests/graph.rs:387:5:
expected at least one semi-internal after eviction

failures:
    tests::diagnostic::evict_tip_creates_span
    tests::diagnostic::vtree_remove_leaf_creates_span
    tests::graph::check_evictions_unbounded_evicts_all
    tests::graph::get_semi_internal_left_child_trims_right
    tests::graph::get_semi_internal_right_child_trims_left

test result: FAILED. 341 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
