*** packages/mudlark/src/graph_budget.rs:195:21: replace += with -= in GvGraph<C, V, N>::evict_candidates

*** mutation diff:
--- packages/mudlark/src/graph_budget.rs
+++ replace += with -= in GvGraph<C, V, N>::evict_candidates
@@ -187,17 +187,17 @@
                     if depth <= self.live_depth_evict {
                         continue;
                     }
                 }
                 crate::vnode::VKind::Structural { .. } => continue,
             }
 
             evict::evict_tip(self, v_id);
-            evicted += 1;
+            evicted -= /* ~ changed by cargo-mutants ~ */ 1;
 
             // Post-eviction audit: find violations not in the queue.
             if tracing::enabled!(tracing::Level::DEBUG) {
                 crate::diagnostic::audit_violations(&self.vnodes, &self.violations, "POST-EVICT");
             }
 
             // Per-eviction mirror check — pinpoints which eviction
             // in a batch caused a divergence (the batch-level

---- tests::diagnostic::evict_tip_creates_span stdout ----

thread 'tests::diagnostic::evict_tip_creates_span' (1512039) panicked at packages/mudlark/src/graph_budget.rs:195:13:
attempt to subtract with overflow

---- tests::diagnostic::eviction_pipeline_creates_spans stdout ----

thread 'tests::diagnostic::eviction_pipeline_creates_spans' (1512040) panicked at packages/mudlark/src/graph_budget.rs:195:13:
attempt to subtract with overflow

---- tests::graph::check_evictions_bounded_respects_limit stdout ----

thread 'tests::graph::check_evictions_bounded_respects_limit' (1512074) panicked at packages/mudlark/src/graph_budget.rs:195:13:
attempt to subtract with overflow

failures:
    tests::diagnostic::evict_tip_creates_span
    tests::diagnostic::eviction_pipeline_creates_spans
    tests::diagnostic::vtree_remove_leaf_creates_span
    tests::graph::check_evictions_bounded_respects_limit
    tests::graph::check_evictions_return_value_matches_count_delta
    tests::graph::check_evictions_trailing_rebalance_clears_violations
    tests::graph::check_evictions_unbounded_evicts_all
    tests::graph::get_semi_internal_depth_is_trimmed_depth
    tests::graph::get_semi_internal_left_child_trims_right
    tests::graph::get_semi_internal_right_child_trims_left
    tests::observe::observe_invariants_hold_after_eviction_cycle
    tests::observe::observe_triggers_eviction_when_over_budget

test result: FAILED. 332 passed; 14 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
