*** packages/mudlark/src/graph_budget.rs:195:21: replace += with *= in GvGraph<C, V, N>::evict_candidates

*** mutation diff:
--- packages/mudlark/src/graph_budget.rs
+++ replace += with *= in GvGraph<C, V, N>::evict_candidates
@@ -187,17 +187,17 @@
                     if depth <= self.live_depth_evict {
                         continue;
                     }
                 }
                 crate::vnode::VKind::Structural { .. } => continue,
             }
 
             evict::evict_tip(self, v_id);
-            evicted += 1;
+            evicted *= /* ~ changed by cargo-mutants ~ */ 1;
 
             // Post-eviction audit: find violations not in the queue.
             if tracing::enabled!(tracing::Level::DEBUG) {
                 crate::diagnostic::audit_violations(&self.vnodes, &self.violations, "POST-EVICT");
             }
 
             // Per-eviction mirror check — pinpoints which eviction
             // in a batch caused a divergence (the batch-level

---- tests::graph::check_evictions_return_value_matches_count_delta stdout ----

thread 'tests::graph::check_evictions_return_value_matches_count_delta' (1516710) panicked at packages/mudlark/src/tests/graph.rs:275:5:
assertion `left == right` failed
  left: 7
 right: 0

---- tests::graph::check_evictions_unbounded_evicts_all stdout ----

thread 'tests::graph::check_evictions_unbounded_evicts_all' (1516712) panicked at packages/mudlark/src/tests/graph.rs:257:5:
should evict at least one candidate

failures:
    tests::graph::check_evictions_return_value_matches_count_delta
    tests::graph::check_evictions_unbounded_evicts_all

test result: FAILED. 344 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
