*** packages/mudlark/src/graph_budget.rs:213:20: replace > with == in GvGraph<C, V, N>::evict_candidates

*** mutation diff:
--- packages/mudlark/src/graph_budget.rs
+++ replace > with == in GvGraph<C, V, N>::evict_candidates
@@ -205,17 +205,17 @@
             // batch diverged, not *which* eviction).
             #[cfg(feature = "dynamic-contour-tracking")]
             if cfg!(debug_assertions) {
                 self.debug_assert_plateau_mirror_consistency(&format!("POST-EVICT-SINGLE-{evicted}"));
             }
         }
 
         // Trailing rebalance to resolve any absorption violations.
-        if evicted > 0 {
+        if evicted == /* ~ changed by cargo-mutants ~ */ 0 {
             let new_gnodes = rebalance::rebalance(
                 &mut self.vnodes,
                 &mut self.gnodes,
                 &mut self.violations,
                 self.live_depth_evict,
             );
             if !new_gnodes.is_empty() {
                 self.handle_legacy_promotes(&new_gnodes);

---- bench_mirrors::lifecycle::mirror_lifecycle_decay_evict stdout ----

thread 'bench_mirrors::lifecycle::mirror_lifecycle_decay_evict' (1520969) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
V-I3 violated at V-node 337: intensity=37, max_uncle=33

---- bench_mirrors::lifecycle::mirror_lifecycle_eviction stdout ----

thread 'bench_mirrors::lifecycle::mirror_lifecycle_eviction' (1520972) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
V-I3 violated at V-node 337: intensity=42, max_uncle=36

failures:
    bench_mirrors::lifecycle::mirror_lifecycle_decay_evict
    bench_mirrors::lifecycle::mirror_lifecycle_eviction

test result: FAILED. 41 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.39s

*** result: Failure(101)
