*** packages/mudlark/src/graph_budget.rs:31:29: replace += with -= in GvGraph<C, V, N>::handle_legacy_promotes

*** mutation diff:
--- packages/mudlark/src/graph_budget.rs
+++ replace += with -= in GvGraph<C, V, N>::handle_legacy_promotes
@@ -23,17 +23,17 @@
     ///    new terminal child at the appropriate depth.
     ///
     /// ADR-M-031: all removals are performed first, then all collected
     /// elements are sorted by `BasisEdge` and placed left-to-right
     /// in a single batch.  This prevents cross-promote ordering
     /// issues when multiple legacy promotes occur in one `observe()`.
     pub(crate) fn handle_legacy_promotes(&mut self, new_gnodes: &[GNodeId]) {
         for &_new_gid in new_gnodes {
-            self.node_count += 1;
+            self.node_count -= /* ~ changed by cargo-mutants ~ */ 1;
             // Legacy promote creates a new terminal child and transitions
             // its parent from semi-internal → internal.  The parent was
             // not a terminal, so net terminal change = +1.
             self.terminal_count += 1;
         }
         self.plateau_after_legacy_promotes_batched(new_gnodes);
     }

---- tests::observe::observe_invariants_hold_after_eviction_cycle stdout ----

thread 'tests::observe::observe_invariants_hold_after_eviction_cycle' (1401579) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
Node count: graph.node_count()=3, arena count=5

---- tests::observe::observe_violations_empty_after_eviction stdout ----

thread 'tests::observe::observe_violations_empty_after_eviction' (1401589) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
Node count: graph.node_count()=3, arena count=5

---- tests::structural::semi_internal_surviving_child_unaffected stdout ----

thread 'tests::structural::semi_internal_surviving_child_unaffected' (1401712) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
Node count: graph.node_count()=5, arena count=7

failures:
    tests::observe::observe_invariants_hold_after_eviction_cycle
    tests::observe::observe_violations_empty_after_eviction
    tests::structural::semi_internal_surviving_child_unaffected

test result: FAILED. 343 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
