*** packages/mudlark/src/graph_budget.rs:58:35: replace * with / in GvGraph<C, V, N>::adjust_depth_gates

*** mutation diff:
--- packages/mudlark/src/graph_budget.rs
+++ replace * with / in GvGraph<C, V, N>::adjust_depth_gates
@@ -50,17 +50,17 @@
     pub(crate) fn adjust_depth_gates(&mut self) {
         let Some(budget) = self.config.budget else {
             return;
         };
         let count = self.node_count as usize;
 
         // Dynamic headroom: max(structural ceiling, convergence bound).
         // ADR-M-018: ensures S + 2(D_c − 1) ≤ H at every step.
-        let convergence_bound = 2 * (self.live_depth_create as usize).saturating_sub(1);
+        let convergence_bound = 2 / /* ~ changed by cargo-mutants ~ */ (self.live_depth_create as usize).saturating_sub(1);
         let required_headroom = self.headroom.max(convergence_bound);
         let soft_limit = budget - required_headroom;
         assert!(
             soft_limit >= 1,
             "soft_limit must be >= 1 (budget={budget}, headroom={required_headroom}, \
              D_c={}, buffer={})",
             self.live_depth_create,
             self.depth_buffer

---- tests::diagnostic::eviction_pipeline_creates_spans stdout ----

thread 'tests::diagnostic::eviction_pipeline_creates_spans' (1423308) panicked at packages/mudlark/src/graph_budget.rs:58:33:
attempt to divide by zero

---- tests::diagnostic::evict_tip_creates_span stdout ----

thread 'tests::diagnostic::evict_tip_creates_span' (1423307) panicked at packages/mudlark/src/graph_budget.rs:58:33:
attempt to divide by zero

---- tests::graph::floor_prevents_excessive_tightening stdout ----

thread 'tests::graph::floor_prevents_excessive_tightening' (1423366) panicked at packages/mudlark/src/graph_budget.rs:58:33:
attempt to divide by zero

failures:
    tests::diagnostic::evict_tip_creates_span
    tests::diagnostic::eviction_pipeline_creates_spans
    tests::diagnostic::vtree_remove_leaf_creates_span
    tests::graph::di3_maintained_through_full_tighten_relax_cycle
    tests::graph::floor_prevents_excessive_tightening
    tests::observe::observe_invariants_hold_after_eviction_cycle
    tests::observe::observe_violations_empty_after_eviction
    tests::structural::semi_internal_surviving_child_unaffected

test result: FAILED. 338 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
