*** packages/mudlark/src/graph_budget.rs:60:33: replace - with + in GvGraph<C, V, N>::adjust_depth_gates

*** mutation diff:
--- packages/mudlark/src/graph_budget.rs
+++ replace - with + in GvGraph<C, V, N>::adjust_depth_gates
@@ -52,17 +52,17 @@
             return;
         };
         let count = self.node_count as usize;
 
         // Dynamic headroom: max(structural ceiling, convergence bound).
         // ADR-M-018: ensures S + 2(D_c − 1) ≤ H at every step.
         let convergence_bound = 2 * (self.live_depth_create as usize).saturating_sub(1);
         let required_headroom = self.headroom.max(convergence_bound);
-        let soft_limit = budget - required_headroom;
+        let soft_limit = budget + /* ~ changed by cargo-mutants ~ */ required_headroom;
         assert!(
             soft_limit >= 1,
             "soft_limit must be >= 1 (budget={budget}, headroom={required_headroom}, \
              D_c={}, buffer={})",
             self.live_depth_create,
             self.depth_buffer
         );
         self.soft_limit = Some(soft_limit);

---- tests::diagnostic::eviction_pipeline_creates_spans stdout ----

thread 'tests::diagnostic::eviction_pipeline_creates_spans' (1427491) panicked at packages/mudlark/src/tests/diagnostic.rs:387:5:

---- tests::diagnostic::vtree_remove_leaf_creates_span stdout ----

thread 'tests::diagnostic::vtree_remove_leaf_creates_span' (1427505) panicked at packages/mudlark/src/tests/diagnostic.rs:413:5:

---- tests::diagnostic::evict_tip_creates_span stdout ----

thread 'tests::diagnostic::evict_tip_creates_span' (1427490) panicked at packages/mudlark/src/tests/diagnostic.rs:348:5:

failures:
    tests::diagnostic::evict_tip_creates_span
    tests::diagnostic::eviction_pipeline_creates_spans
    tests::diagnostic::vtree_remove_leaf_creates_span
    tests::graph::dead_zone_no_change
    tests::graph::floor_prevents_excessive_tightening
    tests::graph::tighten_when_over_budget
    tests::observe::observe_invariants_hold_after_eviction_cycle
    tests::observe::observe_violations_empty_after_eviction
    tests::structural::semi_internal_surviving_child_unaffected

test result: FAILED. 337 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
