*** packages/mudlark/src/graph_budget.rs:60:33: replace - with / in GvGraph<C, V, N>::adjust_depth_gates

*** mutation diff:
--- packages/mudlark/src/graph_budget.rs
+++ replace - with / in GvGraph<C, V, N>::adjust_depth_gates
@@ -52,17 +52,17 @@
             return;
         };
         let count = self.node_count as usize;
 
         // Dynamic headroom: max(structural ceiling, convergence bound).
         // ADR-M-018: ensures S + 2(D_c − 1) ≤ H at every step.
         let convergence_bound = 2 * (self.live_depth_create as usize).saturating_sub(1);
         let required_headroom = self.headroom.max(convergence_bound);
-        let soft_limit = budget - required_headroom;
+        let soft_limit = budget / /* ~ changed by cargo-mutants ~ */ required_headroom;
         assert!(
             soft_limit >= 1,
             "soft_limit must be >= 1 (budget={budget}, headroom={required_headroom}, \
              D_c={}, buffer={})",
             self.live_depth_create,
             self.depth_buffer
         );
         self.soft_limit = Some(soft_limit);

---- tests::graph::di3_maintained_through_full_tighten_relax_cycle stdout ----

thread 'tests::graph::di3_maintained_through_full_tighten_relax_cycle' (1426827) panicked at packages/mudlark/src/tests/graph.rs:247:5:
assertion failed: g.depth_evict() > at_floor

---- tests::graph::dead_zone_no_change stdout ----

thread 'tests::graph::dead_zone_no_change' (1426826) panicked at packages/mudlark/src/tests/graph.rs:193:5:
assertion `left == right` failed
  left: 5
 right: 6

---- tests::graph::relax_when_under_alpha_budget stdout ----

thread 'tests::graph::relax_when_under_alpha_budget' (1426836) panicked at packages/mudlark/src/tests/graph.rs:184:5:
assertion `left == right` failed
  left: 5
 right: 7

failures:
    tests::graph::dead_zone_no_change
    tests::graph::di3_maintained_through_full_tighten_relax_cycle
    tests::graph::no_ceiling_relax_above_initial
    tests::graph::relax_when_under_alpha_budget

test result: FAILED. 342 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
