*** packages/mudlark/src/graph_budget.rs:70:18: replace > with == in GvGraph<C, V, N>::adjust_depth_gates

*** mutation diff:
--- packages/mudlark/src/graph_budget.rs
+++ replace > with == in GvGraph<C, V, N>::adjust_depth_gates
@@ -62,17 +62,17 @@
             soft_limit >= 1,
             "soft_limit must be >= 1 (budget={budget}, headroom={required_headroom}, \
              D_c={}, buffer={})",
             self.live_depth_create,
             self.depth_buffer
         );
         self.soft_limit = Some(soft_limit);
 
-        if count > soft_limit {
+        if count == /* ~ changed by cargo-mutants ~ */ soft_limit {
             // Tighten: lower D_evict by 1, floor at buffer + 1.
             let floor = self.depth_buffer + 1;
             if self.live_depth_evict > floor {
                 self.live_depth_evict -= 1;
                 self.live_depth_create = self.live_depth_evict - self.depth_buffer;
                 tracing::debug!(
                     new_d_evict = self.live_depth_evict,
                     new_d_create = self.live_depth_create,

---- tests::diagnostic::evict_tip_creates_span stdout ----

thread 'tests::diagnostic::evict_tip_creates_span' (1432482) panicked at packages/mudlark/src/tests/diagnostic.rs:348:5:

---- tests::diagnostic::vtree_remove_leaf_creates_span stdout ----

thread 'tests::diagnostic::vtree_remove_leaf_creates_span' (1432497) panicked at packages/mudlark/src/tests/diagnostic.rs:413:5:

---- tests::graph::tighten_when_over_budget stdout ----

thread 'tests::graph::tighten_when_over_budget' (1432552) panicked at packages/mudlark/src/tests/graph.rs:175:5:
assertion `left == right` failed
  left: 6
 right: 5

failures:
    tests::diagnostic::evict_tip_creates_span
    tests::diagnostic::vtree_remove_leaf_creates_span
    tests::graph::floor_prevents_excessive_tightening
    tests::graph::tighten_when_over_budget
    tests::structural::semi_internal_surviving_child_unaffected

test result: FAILED. 341 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
