*** packages/mudlark/src/graph_budget.rs:70:18: replace > with >= in GvGraph<C, V, N>::adjust_depth_gates

*** mutation diff:
--- packages/mudlark/src/graph_budget.rs
+++ replace > with >= in GvGraph<C, V, N>::adjust_depth_gates
@@ -62,17 +62,17 @@
             soft_limit >= 1,
             "soft_limit must be >= 1 (budget={budget}, headroom={required_headroom}, \
              D_c={}, buffer={})",
             self.live_depth_create,
             self.depth_buffer
         );
         self.soft_limit = Some(soft_limit);
 
-        if count > soft_limit {
+        if count >= /* ~ changed by cargo-mutants ~ */ soft_limit {
             // Tighten: lower D_evict by 1, floor at buffer + 1.
             let floor = self.depth_buffer + 1;
             if self.live_depth_evict > floor {
                 self.live_depth_evict -= 1;
                 self.live_depth_create = self.live_depth_evict - self.depth_buffer;
                 tracing::debug!(
                     new_d_evict = self.live_depth_evict,
                     new_d_create = self.live_depth_create,

---- hard_budget_split_guard_prevents_overshoot stdout ----

thread 'hard_budget_split_guard_prevents_overshoot' (1442448) panicked at packages/mudlark/tests/budget.rs:186:5:
tree should exceed soft_limit (11) under load: max was 11

failures:
    hard_budget_split_guard_prevents_overshoot

test result: FAILED. 23 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
