*** packages/mudlark/src/graph_budget.rs:73:38: replace > with == in GvGraph<C, V, N>::adjust_depth_gates

*** mutation diff:
--- packages/mudlark/src/graph_budget.rs
+++ replace > with == in GvGraph<C, V, N>::adjust_depth_gates
@@ -65,17 +65,17 @@
             self.live_depth_create,
             self.depth_buffer
         );
         self.soft_limit = Some(soft_limit);
 
         if count > soft_limit {
             // Tighten: lower D_evict by 1, floor at buffer + 1.
             let floor = self.depth_buffer + 1;
-            if self.live_depth_evict > floor {
+            if self.live_depth_evict == /* ~ changed by cargo-mutants ~ */ floor {
                 self.live_depth_evict -= 1;
                 self.live_depth_create = self.live_depth_evict - self.depth_buffer;
                 tracing::debug!(
                     new_d_evict = self.live_depth_evict,
                     new_d_create = self.live_depth_create,
                     count,
                     soft_limit,
                     "depth gates tightened",

---- tests::diagnostic::evict_tip_creates_span stdout ----

thread 'tests::diagnostic::evict_tip_creates_span' (1447340) panicked at packages/mudlark/src/tests/diagnostic.rs:348:5:

---- tests::diagnostic::vtree_remove_leaf_creates_span stdout ----

thread 'tests::diagnostic::vtree_remove_leaf_creates_span' (1447370) panicked at packages/mudlark/src/tests/diagnostic.rs:413:5:

---- tests::graph::tighten_when_over_budget stdout ----

thread 'tests::graph::tighten_when_over_budget' (1447419) panicked at packages/mudlark/src/tests/graph.rs:175:5:
assertion `left == right` failed
  left: 6
 right: 5

failures:
    tests::diagnostic::evict_tip_creates_span
    tests::diagnostic::vtree_remove_leaf_creates_span
    tests::graph::floor_prevents_excessive_tightening
    tests::graph::tighten_when_over_budget
    tests::observe::observe_invariants_hold_after_eviction_cycle
    tests::structural::semi_internal_surviving_child_unaffected

test result: FAILED. 340 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
