*** packages/mudlark/src/graph_budget.rs:73:38: replace > with >= in GvGraph<C, V, N>::adjust_depth_gates

*** mutation diff:
--- packages/mudlark/src/graph_budget.rs
+++ replace > with >= in GvGraph<C, V, N>::adjust_depth_gates
@@ -65,17 +65,17 @@
             self.live_depth_create,
             self.depth_buffer
         );
         self.soft_limit = Some(soft_limit);
 
         if count > soft_limit {
             // Tighten: lower D_evict by 1, floor at buffer + 1.
             let floor = self.depth_buffer + 1;
-            if self.live_depth_evict > floor {
+            if self.live_depth_evict >= /* ~ changed by cargo-mutants ~ */ floor {
                 self.live_depth_evict -= 1;
                 self.live_depth_create = self.live_depth_evict - self.depth_buffer;
                 tracing::debug!(
                     new_d_evict = self.live_depth_evict,
                     new_d_create = self.live_depth_create,
                     count,
                     soft_limit,
                     "depth gates tightened",

---- tests::graph::floor_prevents_excessive_tightening stdout ----

thread 'tests::graph::floor_prevents_excessive_tightening' (1453916) panicked at packages/mudlark/src/tests/graph.rs:204:5:
assertion `left == right` failed
  left: 3
 right: 4

---- tests::observe::observe_invariants_hold_after_eviction_cycle stdout ----

thread 'tests::observe::observe_invariants_hold_after_eviction_cycle' (1453955) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
D-I3 floor: live_depth_evict (1) < depth_buffer (1) + 1

---- tests::observe::observe_violations_empty_after_eviction stdout ----

thread 'tests::observe::observe_violations_empty_after_eviction' (1453965) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
D-I3 floor: live_depth_evict (1) < depth_buffer (1) + 1

failures:
    tests::graph::floor_prevents_excessive_tightening
    tests::observe::observe_invariants_hold_after_eviction_cycle
    tests::observe::observe_violations_empty_after_eviction
    tests::structural::semi_internal_surviving_child_unaffected

test result: FAILED. 342 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
