*** packages/mudlark/src/graph_budget.rs:74:39: replace -= with += in GvGraph<C, V, N>::adjust_depth_gates

*** mutation diff:
--- packages/mudlark/src/graph_budget.rs
+++ replace -= with += in GvGraph<C, V, N>::adjust_depth_gates
@@ -66,17 +66,17 @@
             self.depth_buffer
         );
         self.soft_limit = Some(soft_limit);
 
         if count > soft_limit {
             // Tighten: lower D_evict by 1, floor at buffer + 1.
             let floor = self.depth_buffer + 1;
             if self.live_depth_evict > floor {
-                self.live_depth_evict -= 1;
+                self.live_depth_evict += /* ~ changed by cargo-mutants ~ */ 1;
                 self.live_depth_create = self.live_depth_evict - self.depth_buffer;
                 tracing::debug!(
                     new_d_evict = self.live_depth_evict,
                     new_d_create = self.live_depth_create,
                     count,
                     soft_limit,
                     "depth gates tightened",
                 );

---- tests::diagnostic::eviction_pipeline_creates_spans stdout ----

thread 'tests::diagnostic::eviction_pipeline_creates_spans' (1456814) panicked at packages/mudlark/src/graph_budget.rs:61:9:
soft_limit must be >= 1 (budget=20, headroom=20, D_c=11, buffer=1)

---- tests::graph::tighten_when_over_budget stdout ----

thread 'tests::graph::tighten_when_over_budget' (1456874) panicked at packages/mudlark/src/tests/graph.rs:175:5:
assertion `left == right` failed
  left: 7
 right: 5

---- tests::graph::floor_prevents_excessive_tightening stdout ----

thread 'tests::graph::floor_prevents_excessive_tightening' (1456863) panicked at packages/mudlark/src/tests/graph.rs:204:5:
assertion `left == right` failed
  left: 9
 right: 4

failures:
    tests::diagnostic::evict_tip_creates_span
    tests::diagnostic::eviction_pipeline_creates_spans
    tests::diagnostic::vtree_remove_leaf_creates_span
    tests::graph::floor_prevents_excessive_tightening
    tests::graph::tighten_when_over_budget
    tests::observe::observe_invariants_hold_after_eviction_cycle
    tests::observe::observe_violations_empty_after_eviction
    tests::structural::semi_internal_surviving_child_unaffected

test result: FAILED. 338 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
