*** packages/mudlark/src/graph_budget.rs:74:39: replace -= with /= in GvGraph<C, V, N>::adjust_depth_gates

*** mutation diff:
--- packages/mudlark/src/graph_budget.rs
+++ replace -= with /= in GvGraph<C, V, N>::adjust_depth_gates
@@ -66,17 +66,17 @@
             self.depth_buffer
         );
         self.soft_limit = Some(soft_limit);
 
         if count > soft_limit {
             // Tighten: lower D_evict by 1, floor at buffer + 1.
             let floor = self.depth_buffer + 1;
             if self.live_depth_evict > floor {
-                self.live_depth_evict -= 1;
+                self.live_depth_evict /= /* ~ changed by cargo-mutants ~ */ 1;
                 self.live_depth_create = self.live_depth_evict - self.depth_buffer;
                 tracing::debug!(
                     new_d_evict = self.live_depth_evict,
                     new_d_create = self.live_depth_create,
                     count,
                     soft_limit,
                     "depth gates tightened",
                 );

---- tests::diagnostic::vtree_remove_leaf_creates_span stdout ----

thread 'tests::diagnostic::vtree_remove_leaf_creates_span' (1458933) panicked at packages/mudlark/src/tests/diagnostic.rs:413:5:

---- tests::diagnostic::evict_tip_creates_span stdout ----

thread 'tests::diagnostic::evict_tip_creates_span' (1458918) panicked at packages/mudlark/src/tests/diagnostic.rs:348:5:

---- tests::observe::observe_invariants_hold_after_eviction_cycle stdout ----

thread 'tests::observe::observe_invariants_hold_after_eviction_cycle' (1459064) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
Hard budget violated (ADR-M-018): node_count (13) > budget (12)

failures:
    tests::diagnostic::evict_tip_creates_span
    tests::diagnostic::vtree_remove_leaf_creates_span
    tests::graph::floor_prevents_excessive_tightening
    tests::graph::tighten_when_over_budget
    tests::observe::observe_invariants_hold_after_eviction_cycle
    tests::structural::semi_internal_surviving_child_unaffected

test result: FAILED. 340 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
