*** packages/mudlark/src/graph_budget.rs:75:64: replace - with + in GvGraph<C, V, N>::adjust_depth_gates

*** mutation diff:
--- packages/mudlark/src/graph_budget.rs
+++ replace - with + in GvGraph<C, V, N>::adjust_depth_gates
@@ -67,17 +67,17 @@
         );
         self.soft_limit = Some(soft_limit);
 
         if count > soft_limit {
             // Tighten: lower D_evict by 1, floor at buffer + 1.
             let floor = self.depth_buffer + 1;
             if self.live_depth_evict > floor {
                 self.live_depth_evict -= 1;
-                self.live_depth_create = self.live_depth_evict - self.depth_buffer;
+                self.live_depth_create = self.live_depth_evict + /* ~ changed by cargo-mutants ~ */ self.depth_buffer;
                 tracing::debug!(
                     new_d_evict = self.live_depth_evict,
                     new_d_create = self.live_depth_create,
                     count,
                     soft_limit,
                     "depth gates tightened",
                 );
             }

---- tests::graph::di3_maintained_through_full_tighten_relax_cycle stdout ----

thread 'tests::graph::di3_maintained_through_full_tighten_relax_cycle' (1461836) panicked at packages/mudlark/src/tests/graph.rs:236:9:
D-I3 during tighten

---- tests::graph::floor_prevents_excessive_tightening stdout ----

thread 'tests::graph::floor_prevents_excessive_tightening' (1461837) panicked at packages/mudlark/src/tests/graph.rs:205:5:
assertion `left == right` failed
  left: 7
 right: 1

---- tests::graph::tighten_when_over_budget stdout ----

thread 'tests::graph::tighten_when_over_budget' (1461847) panicked at packages/mudlark/src/tests/graph.rs:176:5:
assertion `left == right` failed
  left: 8
 right: 2

failures:
    tests::graph::di3_maintained_through_full_tighten_relax_cycle
    tests::graph::floor_prevents_excessive_tightening
    tests::graph::tighten_when_over_budget
    tests::observe::observe_invariants_hold_after_eviction_cycle
    tests::observe::observe_triggers_eviction_when_over_budget
    tests::observe::observe_violations_empty_after_eviction
    tests::structural::semi_internal_surviving_child_unaffected

test result: FAILED. 339 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
