*** packages/mudlark/src/graph_budget.rs:86:47: replace * with / in GvGraph<C, V, N>::adjust_depth_gates

*** mutation diff:
--- packages/mudlark/src/graph_budget.rs
+++ replace * with / in GvGraph<C, V, N>::adjust_depth_gates
@@ -78,17 +78,17 @@
                     new_d_create = self.live_depth_create,
                     count,
                     soft_limit,
                     "depth gates tightened",
                 );
             }
         } else {
             #[allow(clippy::cast_precision_loss)] // node counts fit in f64 mantissa
-            let threshold = soft_limit as f64 * self.config.alpha_relax;
+            let threshold = soft_limit as f64 / /* ~ changed by cargo-mutants ~ */ self.config.alpha_relax;
             #[allow(clippy::cast_precision_loss)]
             let count_f = count as f64;
             if count_f < threshold {
                 // Relax: raise D_evict by 1 (no ceiling).
                 self.live_depth_evict += 1;
                 self.live_depth_create = self.live_depth_evict - self.depth_buffer;
                 tracing::debug!(
                     new_d_evict = self.live_depth_evict,

---- tests::graph::dead_zone_no_change stdout ----

thread 'tests::graph::dead_zone_no_change' (1472659) panicked at packages/mudlark/src/tests/graph.rs:193:5:
assertion `left == right` failed
  left: 7
 right: 6

failures:
    tests::graph::dead_zone_no_change

test result: FAILED. 345 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
