*** packages/mudlark/src/graph_budget.rs:89:24: replace < with <= in GvGraph<C, V, N>::adjust_depth_gates

*** mutation diff:
--- packages/mudlark/src/graph_budget.rs
+++ replace < with <= in GvGraph<C, V, N>::adjust_depth_gates
@@ -81,17 +81,17 @@
                     "depth gates tightened",
                 );
             }
         } else {
             #[allow(clippy::cast_precision_loss)] // node counts fit in f64 mantissa
             let threshold = soft_limit as f64 * self.config.alpha_relax;
             #[allow(clippy::cast_precision_loss)]
             let count_f = count as f64;
-            if count_f < threshold {
+            if count_f <= /* ~ changed by cargo-mutants ~ */ threshold {
                 // Relax: raise D_evict by 1 (no ceiling).
                 self.live_depth_evict += 1;
                 self.live_depth_create = self.live_depth_evict - self.depth_buffer;
                 tracing::debug!(
                     new_d_evict = self.live_depth_evict,
                     new_d_create = self.live_depth_create,
                     count,
                     soft_limit,

*** result: Success
