*** packages/mudlark/src/graph_budget.rs:91:39: replace += with -= in GvGraph<C, V, N>::adjust_depth_gates

*** mutation diff:
--- packages/mudlark/src/graph_budget.rs
+++ replace += with -= in GvGraph<C, V, N>::adjust_depth_gates
@@ -83,17 +83,17 @@
             }
         } else {
             #[allow(clippy::cast_precision_loss)] // node counts fit in f64 mantissa
             let threshold = soft_limit as f64 * self.config.alpha_relax;
             #[allow(clippy::cast_precision_loss)]
             let count_f = count as f64;
             if count_f < threshold {
                 // Relax: raise D_evict by 1 (no ceiling).
-                self.live_depth_evict += 1;
+                self.live_depth_evict -= /* ~ changed by cargo-mutants ~ */ 1;
                 self.live_depth_create = self.live_depth_evict - self.depth_buffer;
                 tracing::debug!(
                     new_d_evict = self.live_depth_evict,
                     new_d_create = self.live_depth_create,
                     count,
                     soft_limit,
                     "depth gates relaxed",
                 );

---- tests::diagnostic::evict_tip_creates_span stdout ----

thread 'tests::diagnostic::evict_tip_creates_span' (1487483) panicked at packages/mudlark/src/graph_budget.rs:92:42:
attempt to subtract with overflow

---- tests::diagnostic::eviction_pipeline_creates_spans stdout ----

thread 'tests::diagnostic::eviction_pipeline_creates_spans' (1487484) panicked at packages/mudlark/src/graph_budget.rs:92:42:
attempt to subtract with overflow

---- tests::diagnostic::vtree_remove_leaf_creates_span stdout ----

thread 'tests::diagnostic::vtree_remove_leaf_creates_span' (1487498) panicked at packages/mudlark/src/graph_budget.rs:92:42:
attempt to subtract with overflow

failures:
    tests::diagnostic::evict_tip_creates_span
    tests::diagnostic::eviction_pipeline_creates_spans
    tests::diagnostic::vtree_remove_leaf_creates_span
    tests::graph::di3_maintained_through_full_tighten_relax_cycle
    tests::graph::no_ceiling_relax_above_initial
    tests::graph::relax_when_under_alpha_budget

test result: FAILED. 340 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
