*** packages/mudlark/src/graph_budget.rs:92:64: replace - with / in GvGraph<C, V, N>::adjust_depth_gates

*** mutation diff:
--- packages/mudlark/src/graph_budget.rs
+++ replace - with / in GvGraph<C, V, N>::adjust_depth_gates
@@ -84,17 +84,17 @@
         } else {
             #[allow(clippy::cast_precision_loss)] // node counts fit in f64 mantissa
             let threshold = soft_limit as f64 * self.config.alpha_relax;
             #[allow(clippy::cast_precision_loss)]
             let count_f = count as f64;
             if count_f < threshold {
                 // Relax: raise D_evict by 1 (no ceiling).
                 self.live_depth_evict += 1;
-                self.live_depth_create = self.live_depth_evict - self.depth_buffer;
+                self.live_depth_create = self.live_depth_evict / /* ~ changed by cargo-mutants ~ */ self.depth_buffer;
                 tracing::debug!(
                     new_d_evict = self.live_depth_evict,
                     new_d_create = self.live_depth_create,
                     count,
                     soft_limit,
                     "depth gates relaxed",
                 );
             }

---- tests::graph::di3_maintained_through_full_tighten_relax_cycle stdout ----

thread 'tests::graph::di3_maintained_through_full_tighten_relax_cycle' (1496223) panicked at packages/mudlark/src/tests/graph.rs:245:9:
assertion `left == right` failed
  left: 3
 right: 4

---- tests::graph::no_ceiling_relax_above_initial stdout ----

thread 'tests::graph::no_ceiling_relax_above_initial' (1496229) panicked at packages/mudlark/src/tests/graph.rs:217:5:
assertion `left == right` failed
  left: 3
 right: 6

---- tests::graph::relax_when_under_alpha_budget stdout ----

thread 'tests::graph::relax_when_under_alpha_budget' (1496231) panicked at packages/mudlark/src/tests/graph.rs:185:5:
assertion `left == right` failed
  left: 2
 right: 4

failures:
    tests::graph::di3_maintained_through_full_tighten_relax_cycle
    tests::graph::no_ceiling_relax_above_initial
    tests::graph::relax_when_under_alpha_budget
    tests::observe::observe_invariants_hold_after_eviction_cycle

test result: FAILED. 342 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
