*** packages/mudlark/src/graph_extract.rs:127:62: replace + with - in GvGraph<C, V, N>::extract

*** mutation diff:
--- packages/mudlark/src/graph_extract.rs
+++ replace + with - in GvGraph<C, V, N>::extract
@@ -119,17 +119,17 @@
                                 v_depth: bfs_depth,
                             });
                         }
                     }
                 }
                 VKind::Structural { children, .. } => {
                     for i in 0..children.len() {
                         let (child_id, _intensity) = children.get(i);
-                        queue.push_back((child_id, bfs_depth + 1));
+                        queue.push_back((child_id, bfs_depth - /* ~ changed by cargo-mutants ~ */ 1));
                     }
                 }
             }
         }
 
         Pewei {
             domain_start,
             domain_end,

---- tests::decay::decay_then_extract_roundtrip stdout ----

thread 'tests::decay::decay_then_extract_roundtrip' (1533857) panicked at packages/mudlark/src/graph_extract.rs:127:52:
attempt to subtract with overflow

---- tests::structural::extract_multi_node_classification stdout ----

thread 'tests::structural::extract_multi_node_classification' (1534086) panicked at packages/mudlark/src/graph_extract.rs:127:52:
attempt to subtract with overflow

---- tests::structural::extract_semi_internal_is_transition stdout ----

thread 'tests::structural::extract_semi_internal_is_transition' (1534087) panicked at packages/mudlark/src/graph_extract.rs:127:52:
attempt to subtract with overflow

failures:
    tests::decay::decay_then_extract_roundtrip
    tests::structural::extract_multi_node_classification
    tests::structural::extract_semi_internal_is_transition

test result: FAILED. 343 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
