*** packages/mudlark/src/graph_extract.rs:127:62: replace + with * in GvGraph<C, V, N>::extract

*** mutation diff:
--- packages/mudlark/src/graph_extract.rs
+++ replace + with * in GvGraph<C, V, N>::extract
@@ -119,17 +119,17 @@
                                 v_depth: bfs_depth,
                             });
                         }
                     }
                 }
                 VKind::Structural { children, .. } => {
                     for i in 0..children.len() {
                         let (child_id, _intensity) = children.get(i);
-                        queue.push_back((child_id, bfs_depth + 1));
+                        queue.push_back((child_id, bfs_depth * /* ~ changed by cargo-mutants ~ */ 1));
                     }
                 }
             }
         }
 
         Pewei {
             domain_start,
             domain_end,

---- tests::structural::extract_multi_node_classification stdout ----

thread 'tests::structural::extract_multi_node_classification' (1539133) panicked at packages/mudlark/src/tests/structural.rs:79:5:
multi-node tree should produce multiple layers

failures:
    tests::structural::extract_multi_node_classification

test result: FAILED. 345 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
