*** packages/mudlark/src/graph_extract.rs:275:67: replace + with * in <impl Iterator for Layers<'_, C, V, N>>::next

*** mutation diff:
--- packages/mudlark/src/graph_extract.rs
+++ replace + with * in <impl Iterator for Layers<'_, C, V, N>>::next
@@ -267,17 +267,17 @@
         loop {
             let (vid, bfs_depth) = self.queue.pop_front()?;
             let vnode = self.graph.vnodes.get(vid.index());
 
             match &vnode.kind {
                 VKind::Structural { children, .. } => {
                     for i in 0..children.len() {
                         let (child_id, _) = children.get(i);
-                        self.queue.push_back((child_id, bfs_depth + 1));
+                        self.queue.push_back((child_id, bfs_depth * /* ~ changed by cargo-mutants ~ */ 1));
                     }
                     // Skip structural nodes — continue loop.
                 }
                 VKind::Entry { gnode, .. } => {
                     let g = self.graph.gnodes.get(gnode.index());
                     let g_depth = self.graph.gnode_depth(*gnode);
                     let node = crate::view::Node {
                         start: g.lo,

---- layers_matches_extract_entries stdout ----

thread 'layers_matches_extract_entries' (1542564) panicked at packages/mudlark/tests/graph_layers.rs:56:17:
transition not found in extract layer 0: Node { start: 128, end: 256, own: 20, sum: 20, depth: 1, state: Internal, gnode_id: GNodeId(3) }

---- layers_order_matches_extract stdout ----

thread 'layers_order_matches_extract' (1542565) panicked at packages/mudlark/tests/graph_layers.rs:201:5:
assertion `left == right` failed: layer indices should match
  left: [0]
 right: [1, 2, 3]

---- layers_budget_constrained stdout ----

thread 'layers_budget_constrained' (1542559) panicked at packages/mudlark/tests/graph_layers.rs:45:17:
terminal not found in extract layer 0: Node { start: 8, end: 16, own: 120, sum: 120, depth: 1, state: Terminal, gnode_id: GNodeId(3) }

failures:
    layers_budget_constrained
    layers_matches_extract_entries
    layers_order_matches_extract

test result: FAILED. 12 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
