*** packages/mudlark/src/graph_plateau.rs:1017:26: replace < with == in GvGraph<C, V, N>::consolidate_all_basis

*** mutation diff:
--- packages/mudlark/src/graph_plateau.rs
+++ replace < with == in GvGraph<C, V, N>::consolidate_all_basis
@@ -1009,17 +1009,17 @@
         let mut merged = 0u32;
         for gid in basis_snapshot {
             // The element may have been consumed by a prior iteration's
             // consolidation (its sibling was processed first).
             if self.plateau_basis.plateau_key(gid).is_some() {
                 let before = self.plateau_basis.basis_count();
                 self.consolidate_basis_up(gid);
                 let after = self.plateau_basis.basis_count();
-                if after < before {
+                if after == /* ~ changed by cargo-mutants ~ */ before {
                     #[allow(clippy::cast_possible_truncation)]
                     {
                         merged += (before - after) as u32;
                     }
                 }
             }
         }
         if merged > 0 {

*** result: Success
