*** packages/mudlark/src/graph_plateau.rs:101:26: replace != with == in GvGraph<C, V, N>::debug_assert_plateau_mirror_consistency

*** mutation diff:
--- packages/mudlark/src/graph_plateau.rs
+++ replace != with == in GvGraph<C, V, N>::debug_assert_plateau_mirror_consistency
@@ -93,17 +93,17 @@
     pub(crate) fn debug_assert_plateau_mirror_consistency(&self, label: &str) {
         // Always run in debug builds (cargo test); optionally in
         // release when a tracing subscriber is active at DEBUG.
         if !cfg!(debug_assertions) && !tracing::enabled!(tracing::Level::DEBUG) {
             return;
         }
 
         let rebuilt = self.build_plateaus();
-        if self.plateaus != rebuilt {
+        if self.plateaus == /* ~ changed by cargo-mutants ~ */ rebuilt {
             // Find differing keys
             let dyn_keys: std::collections::BTreeSet<_> = self.plateaus.keys().collect();
             let stat_keys: std::collections::BTreeSet<_> = rebuilt.keys().collect();
             let only_dynamic: Vec<_> = dyn_keys.difference(&stat_keys).collect();
             let only_static: Vec<_> = stat_keys.difference(&dyn_keys).collect();
             let both: Vec<_> = dyn_keys.intersection(&stat_keys).collect();
             let differing: Vec<_> = both.iter().filter(|&&k| self.plateaus.get(k) != rebuilt.get(k)).collect();

---- tests::decay::decay_amplification_above_one stdout ----

thread 'tests::decay::decay_amplification_above_one' (1568825) panicked at packages/mudlark/src/graph_plateau.rs:193:13:
POST-SPLIT: dynamic-contour-tracking mirror diverged from static rebuild
left (dynamic): {
    BasisEdge(
        0,
    ): Plateau {
        basis_edge: BasisEdge(
            0,
        ),
        start: 0,
        end: 16,
        depth: 1,

---- tests::decay::decay_f64_tree stdout ----

thread 'tests::decay::decay_f64_tree' (1568829) panicked at packages/mudlark/src/graph_plateau.rs:193:13:
POST-SPLIT: dynamic-contour-tracking mirror diverged from static rebuild
left (dynamic): {
    BasisEdge(
        0.0,
    ): Plateau {
        basis_edge: BasisEdge(
            0.0,
        ),
        start: 0.0,
        end: 16.0,
        depth: 1,

---- tests::decay::decay_energy_conservation_selective stdout ----

thread 'tests::decay::decay_energy_conservation_selective' (1568827) panicked at packages/mudlark/src/graph_plateau.rs:193:13:
POST-SPLIT: dynamic-contour-tracking mirror diverged from static rebuild
left (dynamic): {
    BasisEdge(
        0,
    ): Plateau {
        basis_edge: BasisEdge(
            0,
        ),
        start: 0,
        end: 16,
        depth: 1,

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 243 passed; 103 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
