*** packages/mudlark/src/graph_plateau.rs:1025:19: replace > with == in GvGraph<C, V, N>::consolidate_all_basis

*** mutation diff:
--- packages/mudlark/src/graph_plateau.rs
+++ replace > with == in GvGraph<C, V, N>::consolidate_all_basis
@@ -1017,17 +1017,17 @@
                 if after < before {
                     #[allow(clippy::cast_possible_truncation)]
                     {
                         merged += (before - after) as u32;
                     }
                 }
             }
         }
-        if merged > 0 {
+        if merged == /* ~ changed by cargo-mutants ~ */ 0 {
             tracing::debug!(
                 basis_before = count,
                 basis_after = self.plateau_basis.basis_count(),
                 merged,
                 "consolidate_all_basis: completed",
             );
         }
     }

*** result: Success
