*** packages/mudlark/src/graph_plateau.rs:1050:39: delete ! in GvGraph<C, V, N>::debug_check_plateau_sums

*** mutation diff:
--- packages/mudlark/src/graph_plateau.rs
+++ delete ! in GvGraph<C, V, N>::debug_check_plateau_sums
@@ -1042,17 +1042,17 @@
 
     /// Debug-only: assert that every plateau's tracked sum matches
     /// recomputed `Σ basis_elements.sum`. Panics with a labelled
     /// message identifying the offending plateau.
     #[cfg(feature = "dynamic-contour-tracking")]
     pub(crate) fn debug_check_plateau_sums(&self, label: &str) {
         // Always run in debug builds (cargo test); optionally in
         // release when a tracing subscriber is active at DEBUG.
-        if !cfg!(debug_assertions) && !tracing::enabled!(tracing::Level::DEBUG) {
+        if !cfg!(debug_assertions) &&  /* ~ changed by cargo-mutants ~ */tracing::enabled!(tracing::Level::DEBUG) {
             return;
         }
 
         for (&key, plateau) in &self.plateaus {
             let elems: Vec<_> = self
                 .plateau_basis
                 .basis_elements(&key)
                 .iter()

*** result: Success
