*** packages/mudlark/src/graph_plateau.rs:1112:30: replace > with == in GvGraph<C, V, N>::fixup_plateau

*** mutation diff:
--- packages/mudlark/src/graph_plateau.rs
+++ replace > with == in GvGraph<C, V, N>::fixup_plateau
@@ -1104,17 +1104,17 @@
         // incorrectly absorb unrelated elements.
         //
         // Detect this by sorting the remaining elements by `lo` and
         // checking that each element's `lo` equals its predecessor's
         // `hi` (i.e. they tile without gaps).  When a gap is found,
         // evacuate every element and re-place the whole set via
         // `place_sorted` — this is O(k log P) where k is the
         // (typically small) number of co-basis members.
-        if element_ids.len() > 1 {
+        if element_ids.len() == /* ~ changed by cargo-mutants ~ */ 1 {
             let mut intervals: Vec<(GNodeId, C, C)> = element_ids
                 .iter()
                 .map(|&gid| {
                     let g = self.gnodes.get(gid.index());
                     (gid, g.lo, g.hi)
                 })
                 .collect();
             intervals.sort_by(|a, b| a.1.total_cmp(&b.1));

---- bench_mirrors::spray::mirror_spray_scaling_budget stdout ----
2026-03-16T21:23:27.996325Z ERROR torrust_mudlark::graph_plateau: PLATEAU DIVERGENCE DETECTED label="POST-EVICT-SINGLE-1" only_dynamic=[] only_static=[] differing=[BasisEdge(68), BasisEdge(78)]
2026-03-16T21:23:27.996340Z ERROR torrust_mudlark::graph_plateau: DIFFERS key=BasisEdge(68) dyn_depth=7 dyn_start=68 dyn_end=88 dyn_sum=30 stat_depth=7 stat_start=68 stat_end=76 stat_sum=12 basis=[37, 39, 62]
2026-03-16T21:23:27.996345Z ERROR torrust_mudlark::graph_plateau:   basis element gid=37 state=Internal lo=80 hi=88 sum=18 uniform_depth=Some(7)
2026-03-16T21:23:27.996348Z ERROR torrust_mudlark::graph_plateau:   basis element gid=39 state=Internal lo=72 hi=76 sum=6 uniform_depth=Some(7)
2026-03-16T21:23:27.996350Z ERROR torrust_mudlark::graph_plateau:   basis element gid=62 state=Internal lo=68 hi=72 sum=6 uniform_depth=Some(

---- bench_mirrors::spray::mirror_spray_interleave stdout ----
2026-03-16T21:23:28.032040Z ERROR torrust_mudlark::graph_plateau: PLATEAU DIVERGENCE DETECTED label="POST-EVICT-SINGLE-4" only_dynamic=[] only_static=[] differing=[BasisEdge(3), BasisEdge(5)]
2026-03-16T21:23:28.032054Z ERROR torrust_mudlark::graph_plateau: DIFFERS key=BasisEdge(3) dyn_depth=8 dyn_start=3 dyn_end=16 dyn_sum=42 stat_depth=8 stat_start=3 stat_end=4 stat_sum=0 basis=[50, 358]
2026-03-16T21:23:28.032059Z ERROR torrust_mudlark::graph_plateau:   basis element gid=50 state=Internal lo=8 hi=16 sum=42 uniform_depth=Some(8)
2026-03-16T21:23:28.032063Z ERROR torrust_mudlark::graph_plateau:   basis element gid=358 state=Terminal lo=3 hi=4 sum=0 uniform_depth=Some(8)
2026-03-16T21:23:28.032065Z ERROR torrust_mudlark::graph_plateau: DIFFERS key=BasisEdge(5) dyn_depth=8 dyn_start=5 dyn_end=8 dyn_sum=6 stat_depth=8 stat_star

---- bench_mirrors::spray::mirror_spray_steady_state stdout ----
2026-03-16T21:23:28.062846Z ERROR torrust_mudlark::graph_plateau: PLATEAU DIVERGENCE DETECTED label="POST-EVICT-SINGLE-4" only_dynamic=[] only_static=[] differing=[BasisEdge(3), BasisEdge(5)]
2026-03-16T21:23:28.062860Z ERROR torrust_mudlark::graph_plateau: DIFFERS key=BasisEdge(3) dyn_depth=8 dyn_start=3 dyn_end=16 dyn_sum=42 stat_depth=8 stat_start=3 stat_end=4 stat_sum=0 basis=[50, 358]
2026-03-16T21:23:28.062867Z ERROR torrust_mudlark::graph_plateau:   basis element gid=50 state=Internal lo=8 hi=16 sum=42 uniform_depth=Some(8)
2026-03-16T21:23:28.062870Z ERROR torrust_mudlark::graph_plateau:   basis element gid=358 state=Terminal lo=3 hi=4 sum=0 uniform_depth=Some(8)
2026-03-16T21:23:28.062873Z ERROR torrust_mudlark::graph_plateau: DIFFERS key=BasisEdge(5) dyn_depth=8 dyn_start=5 dyn_end=8 dyn_sum=6 stat_depth=8 stat_st

failures:
    bench_mirrors::spray::mirror_spray_interleave
    bench_mirrors::spray::mirror_spray_scaling_budget
    bench_mirrors::spray::mirror_spray_steady_state

test result: FAILED. 40 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.36s

*** result: Failure(101)
