*** packages/mudlark/src/graph_plateau.rs:1126:16: delete ! in GvGraph<C, V, N>::fixup_plateau

*** mutation diff:
--- packages/mudlark/src/graph_plateau.rs
+++ delete ! in GvGraph<C, V, N>::fixup_plateau
@@ -1118,17 +1118,17 @@
                 })
                 .collect();
             intervals.sort_by(|a, b| a.1.total_cmp(&b.1));
 
             let contiguous = intervals
                 .windows(2)
                 .all(|w| w[0].2.total_cmp(&w[1].1) == std::cmp::Ordering::Equal);
 
-            if !contiguous {
+            if  /* ~ changed by cargo-mutants ~ */contiguous {
                 tracing::debug!(
                     ?old_key,
                     n_elements = element_ids.len(),
                     "fixup_plateau: non-contiguous remainder, evacuating"
                 );
                 let mut displaced: Vec<(GNodeId, u32)> = Vec::with_capacity(element_ids.len());
                 for &gid in &element_ids {
                     self.plateau_basis.remove(gid);

---- bench_mirrors::spray::mirror_spray_scaling_budget stdout ----
2026-03-16T21:24:01.581478Z ERROR torrust_mudlark::graph_plateau: PLATEAU DIVERGENCE DETECTED label="POST-EVICT-SINGLE-1" only_dynamic=[] only_static=[] differing=[BasisEdge(68), BasisEdge(78)]
2026-03-16T21:24:01.581491Z ERROR torrust_mudlark::graph_plateau: DIFFERS key=BasisEdge(68) dyn_depth=7 dyn_start=68 dyn_end=88 dyn_sum=30 stat_depth=7 stat_start=68 stat_end=76 stat_sum=12 basis=[62, 37, 39]
2026-03-16T21:24:01.581496Z ERROR torrust_mudlark::graph_plateau:   basis element gid=62 state=Internal lo=68 hi=72 sum=6 uniform_depth=Some(7)
2026-03-16T21:24:01.581499Z ERROR torrust_mudlark::graph_plateau:   basis element gid=37 state=Internal lo=80 hi=88 sum=18 uniform_depth=Some(7)
2026-03-16T21:24:01.581501Z ERROR torrust_mudlark::graph_plateau:   basis element gid=39 state=Internal lo=72 hi=76 sum=6 uniform_depth=Some(

---- bench_mirrors::spray::mirror_spray_interleave stdout ----
2026-03-16T21:24:01.617610Z ERROR torrust_mudlark::graph_plateau: PLATEAU DIVERGENCE DETECTED label="POST-EVICT-SINGLE-4" only_dynamic=[] only_static=[] differing=[BasisEdge(3), BasisEdge(5)]
2026-03-16T21:24:01.617624Z ERROR torrust_mudlark::graph_plateau: DIFFERS key=BasisEdge(3) dyn_depth=8 dyn_start=3 dyn_end=16 dyn_sum=42 stat_depth=8 stat_start=3 stat_end=4 stat_sum=0 basis=[358, 50]
2026-03-16T21:24:01.617630Z ERROR torrust_mudlark::graph_plateau:   basis element gid=358 state=Terminal lo=3 hi=4 sum=0 uniform_depth=Some(8)
2026-03-16T21:24:01.617633Z ERROR torrust_mudlark::graph_plateau:   basis element gid=50 state=Internal lo=8 hi=16 sum=42 uniform_depth=Some(8)
2026-03-16T21:24:01.617636Z ERROR torrust_mudlark::graph_plateau: DIFFERS key=BasisEdge(5) dyn_depth=8 dyn_start=5 dyn_end=8 dyn_sum=6 stat_depth=8 stat_star

---- bench_mirrors::spray::mirror_spray_steady_state stdout ----
2026-03-16T21:24:01.641872Z ERROR torrust_mudlark::graph_plateau: PLATEAU DIVERGENCE DETECTED label="POST-EVICT-SINGLE-4" only_dynamic=[] only_static=[] differing=[BasisEdge(3), BasisEdge(5)]
2026-03-16T21:24:01.641886Z ERROR torrust_mudlark::graph_plateau: DIFFERS key=BasisEdge(3) dyn_depth=8 dyn_start=3 dyn_end=16 dyn_sum=42 stat_depth=8 stat_start=3 stat_end=4 stat_sum=0 basis=[50, 358]
2026-03-16T21:24:01.641891Z ERROR torrust_mudlark::graph_plateau:   basis element gid=50 state=Internal lo=8 hi=16 sum=42 uniform_depth=Some(8)
2026-03-16T21:24:01.641894Z ERROR torrust_mudlark::graph_plateau:   basis element gid=358 state=Terminal lo=3 hi=4 sum=0 uniform_depth=Some(8)
2026-03-16T21:24:01.641896Z ERROR torrust_mudlark::graph_plateau: DIFFERS key=BasisEdge(5) dyn_depth=8 dyn_start=5 dyn_end=8 dyn_sum=6 stat_depth=8 stat_st

failures:
    bench_mirrors::spray::mirror_spray_interleave
    bench_mirrors::spray::mirror_spray_scaling_budget
    bench_mirrors::spray::mirror_spray_steady_state

test result: FAILED. 40 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.34s

*** result: Failure(101)
