*** packages/mudlark/src/graph_plateau.rs:1158:20: replace == with != in GvGraph<C, V, N>::fixup_plateau

*** mutation diff:
--- packages/mudlark/src/graph_plateau.rs
+++ replace == with != in GvGraph<C, V, N>::fixup_plateau
@@ -1150,17 +1150,17 @@
 
         // ── Contiguous remainder — normal recompute / re-key ────
         let min_key: BasisEdge<C> = element_ids
             .iter()
             .map(|&gid| basis_edge_of(self.gnodes.get(gid.index())))
             .min()
             .unwrap();
 
-        if min_key == old_key {
+        if min_key != /* ~ changed by cargo-mutants ~ */ old_key {
             self.recompute_plateau(&old_key);
         } else {
             // Re-key: move all elements to the new key.
             for &eid in &element_ids {
                 self.plateau_basis.remove(eid);
             }
             self.plateaus.remove(&old_key);
             for &eid in &element_ids {

---- tests::diagnostic::evict_tip_creates_span stdout ----

thread 'tests::diagnostic::evict_tip_creates_span' (1786164) panicked at packages/mudlark/src/graph_plateau.rs:193:13:
POST-EVICT-SINGLE-1: dynamic-contour-tracking mirror diverged from static rebuild
left (dynamic): {
    BasisEdge(
        0,
    ): Plateau {
        basis_edge: BasisEdge(
            0,
        ),
        start: 0,
        end: 48,
        depth: 4,

---- tests::graph::check_evictions_trailing_rebalance_clears_violations stdout ----
2026-03-16T21:24:14.737727Z ERROR torrust_mudlark::graph_plateau: PLATEAU DIVERGENCE DETECTED label="POST-EVICT-SINGLE-2" only_dynamic=[BasisEdge(160)] only_static=[BasisEdge(192)] differing=[]
2026-03-16T21:24:14.737744Z ERROR torrust_mudlark::graph_plateau: DYNAMIC-ONLY plateau key=BasisEdge(160) depth=3 start=192 end=256 sum=12 basis=[4]
2026-03-16T21:24:14.737750Z ERROR torrust_mudlark::graph_plateau:   basis element gid=4 state=Internal lo=192 hi=256 sum=12
2026-03-16T21:24:14.737753Z ERROR torrust_mudlark::graph_plateau: STATIC-ONLY plateau key=BasisEdge(192) depth=3 start=192 end=256 sum=12
2026-03-16T21:24:14.737776Z ERROR torrust_mudlark::graph_plateau: G-TREE DUMP dump=═══ G-Tree dump (root=GNodeId(0), 11 nodes) ═══
  G(  0) I [   0.0,  256.0)  d=0  par=None  L=1 R=2  sum=    48.0 own=     6.0

---- tests::graph::check_evictions_return_value_matches_count_delta stdout ----
2026-03-16T21:24:14.737782Z ERROR torrust_mudlark::graph_plateau: PLATEAU DIVERGENCE DETECTED label="POST-EVICT-SINGLE-2" only_dynamic=[BasisEdge(160)] only_static=[BasisEdge(192)] differing=[]
2026-03-16T21:24:14.737794Z ERROR torrust_mudlark::graph_plateau: DYNAMIC-ONLY plateau key=BasisEdge(160) depth=3 start=192 end=256 sum=12 basis=[4]
2026-03-16T21:24:14.737797Z ERROR torrust_mudlark::graph_plateau:   basis element gid=4 state=Internal lo=192 hi=256 sum=12
2026-03-16T21:24:14.737800Z ERROR torrust_mudlark::graph_plateau: STATIC-ONLY plateau key=BasisEdge(192) depth=3 start=192 end=256 sum=12
2026-03-16T21:24:14.737819Z ERROR torrust_mudlark::graph_plateau: G-TREE DUMP dump=═══ G-Tree dump (root=GNodeId(0), 11 nodes) ═══
  G(  0) I [   0.0,  256.0)  d=0  par=None  L=1 R=2  sum=    48.0 own=     6.0  (not

failures:
    tests::diagnostic::evict_tip_creates_span
    tests::diagnostic::eviction_pipeline_creates_spans
    tests::diagnostic::vtree_remove_leaf_creates_span
    tests::graph::check_evictions_return_value_matches_count_delta
    tests::graph::check_evictions_trailing_rebalance_clears_violations
    tests::graph::check_evictions_unbounded_evicts_all
    tests::graph::get_semi_internal_depth_is_trimmed_depth
    tests::graph::get_semi_internal_left_child_trims_right
    tests::graph::get_semi_internal_right_child_trims_left

test result: FAILED. 337 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
