*** packages/mudlark/src/graph_plateau.rs:1241:16: delete ! in GvGraph<C, V, N>::repair_p_i4

*** mutation diff:
--- packages/mudlark/src/graph_plateau.rs
+++ delete ! in GvGraph<C, V, N>::repair_p_i4
@@ -1233,17 +1233,17 @@
         // split_for_p_i4 may push new candidates via
         // pending_p_i4 — the while-let naturally drains them.
         while let Some((gid, pk)) = self.pending_p_i4.pop() {
             // Guard: a prior fix may have moved this node to a
             // different plateau or changed its state.
             if self.plateau_basis.plateau_key(gid) != Some(pk) {
                 continue;
             }
-            if !self.gnodes.is_occupied(gid.index()) {
+            if  /* ~ changed by cargo-mutants ~ */self.gnodes.is_occupied(gid.index()) {
                 continue;
             }
             let g = self.gnodes.get(gid.index());
             if g.state() != GState::SemiInternal {
                 continue;
             }
 
             let Some(child_id) = g.left.or(g.right) else {

*** result: Success
