*** packages/mudlark/src/graph_plateau.rs:1255:25: replace == with != in GvGraph<C, V, N>::repair_p_i4

*** mutation diff:
--- packages/mudlark/src/graph_plateau.rs
+++ replace == with != in GvGraph<C, V, N>::repair_p_i4
@@ -1247,17 +1247,17 @@
             }
 
             let Some(child_id) = g.left.or(g.right) else {
                 continue;
             };
             let child_lo = self.gnodes.get(child_id.index()).lo;
             let child_pk = self.plateaus.range(..=BasisEdge(child_lo)).next_back().map(|(&k, _)| k);
 
-            if child_pk == Some(pk) {
+            if child_pk != /* ~ changed by cargo-mutants ~ */ Some(pk) {
                 self.split_for_p_i4(pk, child_id);
             }
         }
     }
 
     /// No-op stub when plateau tracking is compiled out.
     #[cfg(not(feature = "dynamic-contour-tracking"))]
     #[inline(always)]

---- tests::graph::check_evictions_trailing_rebalance_clears_violations stdout ----
2026-03-16T21:24:53.750037Z ERROR torrust_mudlark::graph_plateau: PLATEAU DIVERGENCE DETECTED label="POST-EVICT" only_dynamic=[BasisEdge(128)] only_static=[] differing=[BasisEdge(64)]
2026-03-16T21:24:53.750056Z ERROR torrust_mudlark::graph_plateau: DYNAMIC-ONLY plateau key=BasisEdge(128) depth=2 start=128 end=256 sum=24 basis=[2]
2026-03-16T21:24:53.750062Z ERROR torrust_mudlark::graph_plateau:   basis element gid=2 state=Internal lo=128 hi=256 sum=24
2026-03-16T21:24:53.750065Z ERROR torrust_mudlark::graph_plateau: DIFFERS key=BasisEdge(64) dyn_depth=2 dyn_start=64 dyn_end=128 dyn_sum=6 stat_depth=2 stat_start=64 stat_end=256 stat_sum=30 basis=[6]
2026-03-16T21:24:53.750070Z ERROR torrust_mudlark::graph_plateau:   basis element gid=6 state=Terminal lo=64 hi=128 sum=6 uniform_depth=Some(2)
2026-03-16T21:

---- tests::diagnostic::evict_tip_creates_span stdout ----

thread 'tests::diagnostic::evict_tip_creates_span' (1820296) panicked at packages/mudlark/src/graph_plateau.rs:193:13:
POST-EVICT: dynamic-contour-tracking mirror diverged from static rebuild
left (dynamic): {
    BasisEdge(
        0,
    ): Plateau {
        basis_edge: BasisEdge(
            0,
        ),
        start: 0,
        end: 32,
        depth: 3,

---- tests::diagnostic::eviction_pipeline_creates_spans stdout ----

thread 'tests::diagnostic::eviction_pipeline_creates_spans' (1820297) panicked at packages/mudlark/src/graph_plateau.rs:193:13:
POST-EVICT: dynamic-contour-tracking mirror diverged from static rebuild
left (dynamic): {
    BasisEdge(
        0,
    ): Plateau {
        basis_edge: BasisEdge(
            0,
        ),
        start: 0,
        end: 32,
        depth: 3,

failures:
    tests::diagnostic::evict_tip_creates_span
    tests::diagnostic::eviction_pipeline_creates_spans
    tests::diagnostic::vtree_remove_leaf_creates_span
    tests::graph::check_evictions_bounded_respects_limit
    tests::graph::check_evictions_return_value_matches_count_delta
    tests::graph::check_evictions_trailing_rebalance_clears_violations
    tests::graph::check_evictions_unbounded_evicts_all
    tests::graph::get_semi_internal_depth_is_trimmed_depth
    tests::graph::get_semi_internal_left_child_trims_right
    tests::graph::get_semi_internal_right_child_trims_left
    tests::observe::observe_invariants_hold_after_eviction_cycle

test result: FAILED. 335 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
