*** packages/mudlark/src/graph_plateau.rs:1435:23: replace == with != in GvGraph<C, V, N>::plateau_after_bootstrap_split

*** mutation diff:
--- packages/mudlark/src/graph_plateau.rs
+++ replace == with != in GvGraph<C, V, N>::plateau_after_bootstrap_split
@@ -1427,17 +1427,17 @@
         let left_depth =
             crate::gtree::gnode_depth_from_interval(self.gnodes.get(left_id.index()).lo, self.gnodes.get(left_id.index()).hi, N);
         let right_depth = crate::gtree::gnode_depth_from_interval(
             self.gnodes.get(right_id.index()).lo,
             self.gnodes.get(right_id.index()).hi,
             N,
         );
 
-        if left_depth == right_depth {
+        if left_depth != /* ~ changed by cargo-mutants ~ */ right_depth {
             // Power-of-2 domain: parent subtree is uniform, place
             // parent as a single basis element.
             self.place_basis_element(g_id, left_depth);
         } else {
             // Non-power-of-2 domain (e.g. u8/N=8, domain_max=255):
             // children have different depths, so the parent subtree
             // is not uniform. Place each child individually.
             tracing::debug!(

---- u8_u64_observe_and_split stdout ----
2026-03-16T21:25:42.080252Z ERROR torrust_mudlark::graph_plateau: PLATEAU DIVERGENCE DETECTED label="POST-SPLIT" only_dynamic=[] only_static=[BasisEdge(127)] differing=[BasisEdge(0)]
2026-03-16T21:25:42.080268Z ERROR torrust_mudlark::graph_plateau: STATIC-ONLY plateau key=BasisEdge(127) depth=1 start=127 end=255 sum=0
2026-03-16T21:25:42.080273Z ERROR torrust_mudlark::graph_plateau: DIFFERS key=BasisEdge(0) dyn_depth=2 dyn_start=0 dyn_end=255 dyn_sum=10 stat_depth=2 stat_start=0 stat_end=127 stat_sum=0 basis=[0]
2026-03-16T21:25:42.080278Z ERROR torrust_mudlark::graph_plateau:   basis element gid=0 state=Internal lo=0 hi=255 sum=10 uniform_depth=None
2026-03-16T21:25:42.080291Z ERROR torrust_mudlark::graph_plateau: G-TREE DUMP dump=═══ G-Tree dump (root=GNodeId(0), 3 nodes) ═══
  G(  0) I [   0.0,  255.0)  d=1  par=None  L=1 R=2  sum=    10.0 own

---- u8_u64_many_observations stdout ----
2026-03-16T21:25:42.080735Z ERROR torrust_mudlark::graph_plateau: PLATEAU DIVERGENCE DETECTED label="POST-SPLIT" only_dynamic=[] only_static=[BasisEdge(127)] differing=[BasisEdge(0)]
2026-03-16T21:25:42.080744Z ERROR torrust_mudlark::graph_plateau: STATIC-ONLY plateau key=BasisEdge(127) depth=1 start=127 end=255 sum=0
2026-03-16T21:25:42.080748Z ERROR torrust_mudlark::graph_plateau: DIFFERS key=BasisEdge(0) dyn_depth=2 dyn_start=0 dyn_end=255 dyn_sum=6 stat_depth=2 stat_start=0 stat_end=127 stat_sum=0 basis=[0]
2026-03-16T21:25:42.080751Z ERROR torrust_mudlark::graph_plateau:   basis element gid=0 state=Internal lo=0 hi=255 sum=6 uniform_depth=None
2026-03-16T21:25:42.080760Z ERROR torrust_mudlark::graph_plateau: G-TREE DUMP dump=═══ G-Tree dump (root=GNodeId(0), 3 nodes) ═══
  G(  0) I [   0.0,  255.0)  d=1  par=None  L=1 R=2  sum=     6.0 own=

failures:
    u8_u64_many_observations
    u8_u64_observe_and_split

test result: FAILED. 12 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
