*** packages/mudlark/src/graph_plateau.rs:1521:50: replace == with != in GvGraph<C, V, N>::plateau_after_catalytic_split

*** mutation diff:
--- packages/mudlark/src/graph_plateau.rs
+++ replace == with != in GvGraph<C, V, N>::plateau_after_catalytic_split
@@ -1513,17 +1513,17 @@
                     let mut displaced: Vec<GNodeId> = Vec::new();
                     for &path_node in &path {
                         let par = self
                             .gnodes
                             .get(path_node.index())
                             .parent
                             .expect("path node must have a parent");
                         let pg = self.gnodes.get(par.index());
-                        let sibling = if pg.left == Some(path_node) { pg.right } else { pg.left };
+                        let sibling = if pg.left != /* ~ changed by cargo-mutants ~ */ Some(path_node) { pg.right } else { pg.left };
                         if let Some(sib_id) = sibling {
                             displaced.push(sib_id);
                         }
                     }
                     // Also evacuate remaining co-basis elements of the
                     // same plateau (they may become non-contiguous after
                     // the ancestor's removal).
                     let co_members: Vec<GNodeId> = self.plateau_basis.basis_elements(&key).iter().copied().collect();

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (1863095) panicked at packages/mudlark/src/plateau.rs:334:9:
PlateauBasis::insert: gnode GNodeId(3) already in basis of plateau Some(BasisEdge(8))

---- tests::decay::decay_amplification_above_one stdout ----

thread 'tests::decay::decay_amplification_above_one' (1863084) panicked at packages/mudlark/src/plateau.rs:334:9:
PlateauBasis::insert: gnode GNodeId(3) already in basis of plateau Some(BasisEdge(8))

---- tests::decay::decay_energy_conservation_uniform stdout ----

thread 'tests::decay::decay_energy_conservation_uniform' (1863097) panicked at packages/mudlark/src/plateau.rs:334:9:
PlateauBasis::insert: gnode GNodeId(3) already in basis of plateau Some(BasisEdge(8))

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 270 passed; 76 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
