*** packages/mudlark/src/graph_plateau.rs:1553:23: replace == with != in GvGraph<C, V, N>::plateau_after_catalytic_split

*** mutation diff:
--- packages/mudlark/src/graph_plateau.rs
+++ replace == with != in GvGraph<C, V, N>::plateau_after_catalytic_split
@@ -1545,17 +1545,17 @@
         self.fixup_plateau(old_key);
 
         // Step 3+4 combined — collect all displaced + target into one
         // vec, sort by BasisEdge, place left-to-right (ADR-M-031 §2a).
         let mut to_place = Vec::new();
         for &sib_id in &displaced {
             self.collect_subtree_basis_elements(sib_id, &mut to_place);
         }
-        if left_depth == right_depth {
+        if left_depth != /* ~ changed by cargo-mutants ~ */ right_depth {
             to_place.push((g_id, left_depth));
         } else {
             to_place.push((left_id, left_depth));
             to_place.push((right_id, right_depth));
         }
         self.place_sorted(&mut to_place);
     }

---- u8_u64_many_observations stdout ----
2026-03-16T21:25:50.075914Z ERROR torrust_mudlark::graph_plateau: PLATEAU DIVERGENCE DETECTED label="POST-SPLIT" only_dynamic=[] only_static=[BasisEdge(63)] differing=[BasisEdge(0)]
2026-03-16T21:25:50.075931Z ERROR torrust_mudlark::graph_plateau: STATIC-ONLY plateau key=BasisEdge(63) depth=2 start=63 end=127 sum=0
2026-03-16T21:25:50.075937Z ERROR torrust_mudlark::graph_plateau: DIFFERS key=BasisEdge(0) dyn_depth=3 dyn_start=0 dyn_end=127 dyn_sum=4 stat_depth=3 stat_start=0 stat_end=63 stat_sum=0 basis=[1]
2026-03-16T21:25:50.075941Z ERROR torrust_mudlark::graph_plateau:   basis element gid=1 state=Internal lo=0 hi=127 sum=4 uniform_depth=None
2026-03-16T21:25:50.075957Z ERROR torrust_mudlark::graph_plateau: G-TREE DUMP dump=═══ G-Tree dump (root=GNodeId(0), 5 nodes) ═══
  G(  0) I [   0.0,  255.0)  d=1  par=None  L=1 R=2  sum=    10.0 own=

failures:
    u8_u64_many_observations

test result: FAILED. 13 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
