*** packages/mudlark/src/graph_plateau.rs:287:31: replace == with != in GvGraph<C, V, N>::build_plateaus

*** mutation diff:
--- packages/mudlark/src/graph_plateau.rs
+++ replace == with != in GvGraph<C, V, N>::build_plateaus
@@ -279,17 +279,17 @@
         // 2. Sort by basis edge (left-to-right spatial order).
         basis.sort_by_key(|a| a.0);
 
         // 3. Left-to-right sweep: merge adjacent same-depth entries.
         //    Matches `place_basis_element`'s left-neighbour merge rule.
         let mut result: BTreeMap<BasisEdge<C>, Plateau<C, V>> = BTreeMap::new();
         for (be, depth, lo, hi, sum) in basis {
             let merged = if let Some((_, prev)) = result.iter_mut().next_back() {
-                if prev.depth == depth {
+                if prev.depth != /* ~ changed by cargo-mutants ~ */ depth {
                     if hi.total_cmp(&prev.end) == std::cmp::Ordering::Greater {
                         prev.end = hi;
                     }
                     if lo.total_cmp(&prev.start) == std::cmp::Ordering::Less {
                         prev.start = lo;
                     }
                     prev.sum = V::add(prev.sum, sum);
                     true

---- tests::decay::decay_energy_conservation_uniform stdout ----

thread 'tests::decay::decay_energy_conservation_uniform' (1584892) panicked at packages/mudlark/src/graph_plateau.rs:193:13:
POST-SPLIT: dynamic-contour-tracking mirror diverged from static rebuild
left (dynamic): {
    BasisEdge(
        0,
    ): Plateau {
        basis_edge: BasisEdge(
            0,
        ),
        start: 0,
        end: 8,
        depth: 1,

---- tests::decay::decay_amplification_above_one stdout ----

thread 'tests::decay::decay_amplification_above_one' (1584889) panicked at packages/mudlark/src/graph_plateau.rs:193:13:
POST-SPLIT: dynamic-contour-tracking mirror diverged from static rebuild
left (dynamic): {
    BasisEdge(
        0,
    ): Plateau {
        basis_edge: BasisEdge(
            0,
        ),
        start: 0,
        end: 8,
        depth: 1,

---- tests::decay::decay_f64_tree stdout ----

thread 'tests::decay::decay_f64_tree' (1584893) panicked at packages/mudlark/src/graph_plateau.rs:193:13:
POST-SPLIT: dynamic-contour-tracking mirror diverged from static rebuild
left (dynamic): {
    BasisEdge(
        0.0,
    ): Plateau {
        basis_edge: BasisEdge(
            0.0,
        ),
        start: 0.0,
        end: 8.0,
        depth: 2,

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 261 passed; 85 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
