*** packages/mudlark/src/graph_plateau.rs:291:50: replace == with != in GvGraph<C, V, N>::build_plateaus

*** mutation diff:
--- packages/mudlark/src/graph_plateau.rs
+++ replace == with != in GvGraph<C, V, N>::build_plateaus
@@ -283,17 +283,17 @@
         //    Matches `place_basis_element`'s left-neighbour merge rule.
         let mut result: BTreeMap<BasisEdge<C>, Plateau<C, V>> = BTreeMap::new();
         for (be, depth, lo, hi, sum) in basis {
             let merged = if let Some((_, prev)) = result.iter_mut().next_back() {
                 if prev.depth == depth {
                     if hi.total_cmp(&prev.end) == std::cmp::Ordering::Greater {
                         prev.end = hi;
                     }
-                    if lo.total_cmp(&prev.start) == std::cmp::Ordering::Less {
+                    if lo.total_cmp(&prev.start) != /* ~ changed by cargo-mutants ~ */ std::cmp::Ordering::Less {
                         prev.start = lo;
                     }
                     prev.sum = V::add(prev.sum, sum);
                     true
                 } else {
                     false
                 }
             } else {

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (1586217) panicked at packages/mudlark/src/graph_plateau.rs:193:13:
POST-SPLIT: dynamic-contour-tracking mirror diverged from static rebuild
left (dynamic): {
    BasisEdge(
        0,
    ): Plateau {
        basis_edge: BasisEdge(
            0,
        ),
        start: 0,
        end: 4,
        depth: 3,

---- tests::decay::decay_f64_tree stdout ----

thread 'tests::decay::decay_f64_tree' (1586220) panicked at packages/mudlark/src/graph_plateau.rs:193:13:
POST-SPLIT: dynamic-contour-tracking mirror diverged from static rebuild
left (dynamic): {
    BasisEdge(
        0.0,
    ): Plateau {
        basis_edge: BasisEdge(
            0.0,
        ),
        start: 0.0,
        end: 4.0,
        depth: 3,

---- tests::decay::decay_panics_negative_attenuation stdout ----

thread 'tests::decay::decay_panics_negative_attenuation' (1586226) panicked at packages/mudlark/src/graph_plateau.rs:193:13:
POST-SPLIT: dynamic-contour-tracking mirror diverged from static rebuild
left (dynamic): {
    BasisEdge(
        0,
    ): Plateau {
        basis_edge: BasisEdge(
            0,
        ),
        start: 0,
        end: 4,
        depth: 3,

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 290 passed; 56 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
