*** packages/mudlark/src/graph_plateau.rs:385:40: replace == with != in GvGraph<C, V, N>::recompute_plateau

*** mutation diff:
--- packages/mudlark/src/graph_plateau.rs
+++ replace == with != in GvGraph<C, V, N>::recompute_plateau
@@ -377,17 +377,17 @@
         let first = *elements.iter().next().unwrap();
         let mut min_lo = self.gnodes.get(first.index()).lo;
         let mut max_hi = self.gnodes.get(first.index()).hi;
         let mut sum = V::zero();
         let mut depth = 0u32;
 
         for &gid in elements {
             let g = self.gnodes.get(gid.index());
-            if g.lo.total_cmp(&min_lo) == std::cmp::Ordering::Less {
+            if g.lo.total_cmp(&min_lo) != /* ~ changed by cargo-mutants ~ */ std::cmp::Ordering::Less {
                 min_lo = g.lo;
             }
             if g.hi.total_cmp(&max_hi) == std::cmp::Ordering::Greater {
                 max_hi = g.hi;
             }
             sum = V::add(sum, g.sum);
 
             // Depth: contour depth contributed by this basis element.

---- tests::decay::decay_f64_tree stdout ----

thread 'tests::decay::decay_f64_tree' (1603554) panicked at packages/mudlark/src/graph_plateau.rs:193:13:
POST-SPLIT: dynamic-contour-tracking mirror diverged from static rebuild
left (dynamic): {
    BasisEdge(
        0.0,
    ): Plateau {
        basis_edge: BasisEdge(
            0.0,
        ),
        start: 0.0,
        end: 4.0,
        depth: 3,

---- tests::decay::decay_multiple_uniform_preserves_invariants stdout ----

thread 'tests::decay::decay_multiple_uniform_preserves_invariants' (1603556) panicked at packages/mudlark/src/graph_plateau.rs:193:13:
POST-SPLIT: dynamic-contour-tracking mirror diverged from static rebuild
left (dynamic): {
    BasisEdge(
        0,
    ): Plateau {
        basis_edge: BasisEdge(
            0,
        ),
        start: 0,
        end: 4,
        depth: 3,

---- tests::decay::decay_multiple_selective_preserves_invariants stdout ----

thread 'tests::decay::decay_multiple_selective_preserves_invariants' (1603555) panicked at packages/mudlark/src/graph_plateau.rs:193:13:
POST-SPLIT: dynamic-contour-tracking mirror diverged from static rebuild
left (dynamic): {
    BasisEdge(
        0,
    ): Plateau {
        basis_edge: BasisEdge(
            0,
        ),
        start: 0,
        end: 4,
        depth: 3,

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 296 passed; 50 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
