*** packages/mudlark/src/graph_plateau.rs:388:40: replace == with != in GvGraph<C, V, N>::recompute_plateau

*** mutation diff:
--- packages/mudlark/src/graph_plateau.rs
+++ replace == with != in GvGraph<C, V, N>::recompute_plateau
@@ -380,17 +380,17 @@
         let mut sum = V::zero();
         let mut depth = 0u32;
 
         for &gid in elements {
             let g = self.gnodes.get(gid.index());
             if g.lo.total_cmp(&min_lo) == std::cmp::Ordering::Less {
                 min_lo = g.lo;
             }
-            if g.hi.total_cmp(&max_hi) == std::cmp::Ordering::Greater {
+            if g.hi.total_cmp(&max_hi) != /* ~ changed by cargo-mutants ~ */ std::cmp::Ordering::Greater {
                 max_hi = g.hi;
             }
             sum = V::add(sum, g.sum);
 
             // Depth: contour depth contributed by this basis element.
             // Terminal / Semi-internal: own depth.
             // Internal (balanced): actual uniform contour depth of
             //   the subtree — may be deeper than own_depth + 1 after

---- tests::decay::decay_energy_conservation_uniform stdout ----

thread 'tests::decay::decay_energy_conservation_uniform' (1604430) panicked at packages/mudlark/src/graph_plateau.rs:193:13:
POST-SPLIT: dynamic-contour-tracking mirror diverged from static rebuild
left (dynamic): {
    BasisEdge(
        0,
    ): Plateau {
        basis_edge: BasisEdge(
            0,
        ),
        start: 0,
        end: 4,
        depth: 3,

---- tests::decay::decay_panics_zero_attenuation stdout ----

thread 'tests::decay::decay_panics_zero_attenuation' (1604440) panicked at packages/mudlark/src/graph_plateau.rs:193:13:
POST-SPLIT: dynamic-contour-tracking mirror diverged from static rebuild
left (dynamic): {
    BasisEdge(
        0,
    ): Plateau {
        basis_edge: BasisEdge(
            0,
        ),
        start: 0,
        end: 4,
        depth: 3,

---- tests::decay::decay_panics_q_above_one stdout ----

thread 'tests::decay::decay_panics_q_above_one' (1604439) panicked at packages/mudlark/src/graph_plateau.rs:193:13:
POST-SPLIT: dynamic-contour-tracking mirror diverged from static rebuild
left (dynamic): {
    BasisEdge(
        0,
    ): Plateau {
        basis_edge: BasisEdge(
            0,
        ),
        start: 0,
        end: 4,
        depth: 3,

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 296 passed; 50 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
