*** packages/mudlark/src/graph_plateau.rs:403:95: replace + with * in GvGraph<C, V, N>::recompute_plateau

*** mutation diff:
--- packages/mudlark/src/graph_plateau.rs
+++ replace + with * in GvGraph<C, V, N>::recompute_plateau
@@ -395,17 +395,17 @@
             // Internal (balanced): actual uniform contour depth of
             //   the subtree — may be deeper than own_depth + 1 after
             //   consolidation merges multi-level balanced subtrees.
             let d = match g.state() {
                 crate::gnode::GState::Terminal | crate::gnode::GState::SemiInternal => {
                     crate::gtree::gnode_depth_from_interval(g.lo, g.hi, N)
                 }
                 crate::gnode::GState::Internal => uniform_contour_depth_of(&self.gnodes, gid, N)
-                    .unwrap_or_else(|| crate::gtree::gnode_depth_from_interval(g.lo, g.hi, N) + 1),
+                    .unwrap_or_else(|| crate::gtree::gnode_depth_from_interval(g.lo, g.hi, N) * /* ~ changed by cargo-mutants ~ */ 1),
             };
             depth = depth.max(d);
         }
 
         if let Some(p) = self.plateaus.get_mut(key) {
             p.start = min_lo;
             p.end = max_hi;
             p.sum = sum;

*** result: Success
