*** packages/mudlark/src/graph_plateau.rs:448:38: replace == with != in GvGraph<C, V, N>::place_basis_element

*** mutation diff:
--- packages/mudlark/src/graph_plateau.rs
+++ replace == with != in GvGraph<C, V, N>::place_basis_element
@@ -440,17 +440,17 @@
         // left plateau's key and ours — an intervening plateau at a
         // different depth (e.g. a SemiInternal's child) means the
         // merge would skip over it, producing a plateau that
         // `build_plateaus`'s strict sorted sweep would never create.
         let left_key = self
             .plateaus
             .range(..key)
             .next_back()
-            .filter(|(_, p)| p.depth == depth && p.end.total_cmp(&lo) != std::cmp::Ordering::Less)
+            .filter(|(_, p)| p.depth != /* ~ changed by cargo-mutants ~ */ depth && p.end.total_cmp(&lo) != std::cmp::Ordering::Less)
             .map(|(&k, _)| k)
             .filter(|lk| {
                 // Check for intervening plateaus between lk and key.
                 self.plateaus
                     .range((std::ops::Bound::Excluded(*lk), std::ops::Bound::Excluded(key)))
                     .next()
                     .is_none()
             });

---- tests::decay::decay_panics_nan_attenuation stdout ----

thread 'tests::decay::decay_panics_nan_attenuation' (1621297) panicked at packages/mudlark/src/graph_plateau.rs:193:13:
POST-SPLIT: dynamic-contour-tracking mirror diverged from static rebuild
left (dynamic): {
    BasisEdge(
        0,
    ): Plateau {
        basis_edge: BasisEdge(
            0,
        ),
        start: 0,
        end: 16,
        depth: 2,

---- tests::decay::decay_energy_conservation_selective stdout ----

thread 'tests::decay::decay_energy_conservation_selective' (1621291) panicked at packages/mudlark/src/graph_plateau.rs:193:13:
POST-SPLIT: dynamic-contour-tracking mirror diverged from static rebuild
left (dynamic): {
    BasisEdge(
        0,
    ): Plateau {
        basis_edge: BasisEdge(
            0,
        ),
        start: 0,
        end: 16,
        depth: 2,

---- tests::decay::decay_noop_at_attenuation_one stdout ----

thread 'tests::decay::decay_noop_at_attenuation_one' (1621296) panicked at packages/mudlark/src/graph_plateau.rs:193:13:
POST-SPLIT: dynamic-contour-tracking mirror diverged from static rebuild
left (dynamic): {
    BasisEdge(
        0,
    ): Plateau {
        basis_edge: BasisEdge(
            0,
        ),
        start: 0,
        end: 16,
        depth: 2,

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 261 passed; 85 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
