*** packages/mudlark/src/graph_plateau.rs:465:47: replace && with || in GvGraph<C, V, N>::place_basis_element

*** mutation diff:
--- packages/mudlark/src/graph_plateau.rs
+++ replace && with || in GvGraph<C, V, N>::place_basis_element
@@ -457,17 +457,17 @@
 
         // Right neighbour at the same depth AND spatially adjacent.
         // Adjacent means: right_plateau.start <= our hi (they touch or overlap).
         // Same intervening-plateau guard as above.
         let right_key = self
             .plateaus
             .range(BasisEdge(hi)..)
             .next()
-            .filter(|(_, p)| p.depth == depth && p.start.total_cmp(&hi) != std::cmp::Ordering::Greater)
+            .filter(|(_, p)| p.depth == depth || /* ~ changed by cargo-mutants ~ */ p.start.total_cmp(&hi) != std::cmp::Ordering::Greater)
             .map(|(&k, _)| k)
             .filter(|rk| {
                 // Check for intervening plateaus between key and rk.
                 self.plateaus
                     .range((std::ops::Bound::Excluded(key), std::ops::Bound::Excluded(*rk)))
                     .next()
                     .is_none()
             });

---- tests::decay::decay_amplification_above_one stdout ----

thread 'tests::decay::decay_amplification_above_one' (1630988) panicked at packages/mudlark/src/graph_plateau.rs:193:13:
POST-SPLIT: dynamic-contour-tracking mirror diverged from static rebuild
left (dynamic): {
    BasisEdge(
        0,
    ): Plateau {
        basis_edge: BasisEdge(
            0,
        ),
        start: 0,
        end: 2,
        depth: 3,

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (1630989) panicked at packages/mudlark/src/graph_plateau.rs:193:13:
POST-SPLIT: dynamic-contour-tracking mirror diverged from static rebuild
left (dynamic): {
    BasisEdge(
        0,
    ): Plateau {
        basis_edge: BasisEdge(
            0,
        ),
        start: 0,
        end: 2,
        depth: 3,

---- tests::decay::decay_f64_tree stdout ----

thread 'tests::decay::decay_f64_tree' (1630992) panicked at packages/mudlark/src/graph_plateau.rs:193:13:
POST-SPLIT: dynamic-contour-tracking mirror diverged from static rebuild
left (dynamic): {
    BasisEdge(
        0.0,
    ): Plateau {
        basis_edge: BasisEdge(
            0.0,
        ),
        start: 0.0,
        end: 2.0,
        depth: 3,

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 305 passed; 41 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
