*** packages/mudlark/src/graph_plateau.rs:544:51: replace == with != in GvGraph<C, V, N>::place_basis_element

*** mutation diff:
--- packages/mudlark/src/graph_plateau.rs
+++ replace == with != in GvGraph<C, V, N>::place_basis_element
@@ -536,17 +536,17 @@
         // Consolidate: if gnode's tree-structural sibling is also a
         // basis element of the same plateau, merge both into the
         // parent — maintaining the minimal basis (§IDEA M-5.6.1 rule 2).
         self.consolidate_basis_up(gnode);
 
         // If the placed node is semi-internal, it may violate P-I4
         // (thatch one-hop).  Queue it for the drain in repair_p_i4.
         // (consolidation never removes semi-internals, so this is safe.)
-        if self.gnodes.get(gnode.index()).state() == crate::gnode::GState::SemiInternal {
+        if self.gnodes.get(gnode.index()).state() != /* ~ changed by cargo-mutants ~ */ crate::gnode::GState::SemiInternal {
             let final_key = self.plateau_basis.plateau_key(gnode).expect("just placed");
             self.pending_p_i4.push((gnode, final_key));
         }
     }
 
     /// Collect `(GNodeId, u32)` pairs for a subtree's basis elements
     /// without placing them.  Read-only counterpart to
     /// `place_subtree_basis_elements`.

---- tests::decay::decay_energy_conservation_uniform stdout ----

thread 'tests::decay::decay_energy_conservation_uniform' (1640257) panicked at packages/mudlark/src/graph_plateau.rs:545:67:
just placed

---- tests::decay::decay_amplification_above_one stdout ----

thread 'tests::decay::decay_amplification_above_one' (1640254) panicked at packages/mudlark/src/graph_plateau.rs:545:67:
just placed

---- tests::decay::decay_f64_tree stdout ----

thread 'tests::decay::decay_f64_tree' (1640258) panicked at packages/mudlark/src/graph_plateau.rs:545:67:
just placed

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 284 passed; 62 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
