*** packages/mudlark/src/graph_plateau.rs:701:59: replace != with == in GvGraph<C, V, N>::consolidate_basis_up

*** mutation diff:
--- packages/mudlark/src/graph_plateau.rs
+++ replace != with == in GvGraph<C, V, N>::consolidate_basis_up
@@ -693,17 +693,17 @@
     fn consolidate_basis_up(&mut self, mut gid: GNodeId) {
         use crate::gnode::GState;
 
         loop {
             let Some(parent_id) = self.gnodes.get(gid.index()).parent else {
                 tracing::trace!(from = gid.index(), "consolidate_basis_up: stop — no parent");
                 break;
             };
-            if self.gnodes.get(parent_id.index()).state() != GState::Internal {
+            if self.gnodes.get(parent_id.index()).state() == /* ~ changed by cargo-mutants ~ */ GState::Internal {
                 tracing::trace!(
                     from = gid.index(),
                     parent = parent_id.index(),
                     parent_state = ?self.gnodes.get(parent_id.index()).state(),
                     "consolidate_basis_up: stop — parent not Internal",
                 );
                 break;
             }

---- tests::decay::decay_f64_tree stdout ----

thread 'tests::decay::decay_f64_tree' (1643440) panicked at packages/mudlark/src/graph_plateau.rs:193:13:
POST-SPLIT: dynamic-contour-tracking mirror diverged from static rebuild
left (dynamic): {
    BasisEdge(
        0.0,
    ): Plateau {
        basis_edge: BasisEdge(
            0.0,
        ),
        start: 0.0,
        end: 16.0,
        depth: 2,

---- tests::decay::decay_energy_conservation_uniform stdout ----

thread 'tests::decay::decay_energy_conservation_uniform' (1643439) panicked at packages/mudlark/src/graph_plateau.rs:193:13:
POST-SPLIT: dynamic-contour-tracking mirror diverged from static rebuild
left (dynamic): {
    BasisEdge(
        0,
    ): Plateau {
        basis_edge: BasisEdge(
            0,
        ),
        start: 0,
        end: 16,
        depth: 2,

---- tests::decay::decay_noop_at_attenuation_one stdout ----

thread 'tests::decay::decay_noop_at_attenuation_one' (1643444) panicked at packages/mudlark/src/graph_plateau.rs:193:13:
POST-SPLIT: dynamic-contour-tracking mirror diverged from static rebuild
left (dynamic): {
    BasisEdge(
        0,
    ): Plateau {
        basis_edge: BasisEdge(
            0,
        ),
        start: 0,
        end: 16,
        depth: 2,

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 284 passed; 62 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
