*** packages/mudlark/src/graph_plateau.rs:720:17: replace || with && in GvGraph<C, V, N>::consolidate_basis_up

*** mutation diff:
--- packages/mudlark/src/graph_plateau.rs
+++ replace || with && in GvGraph<C, V, N>::consolidate_basis_up
@@ -712,17 +712,17 @@
                 match (pg.left, pg.right) {
                     (Some(l), Some(r)) => (l, r),
                     _ => break,
                 }
             };
 
             // Semi-internals break uniformity — cannot consolidate.
             if self.gnodes.get(left.index()).state() == GState::SemiInternal
-                || self.gnodes.get(right.index()).state() == GState::SemiInternal
+                && /* ~ changed by cargo-mutants ~ */ self.gnodes.get(right.index()).state() == GState::SemiInternal
             {
                 tracing::trace!(
                     from = gid.index(),
                     parent = parent_id.index(),
                     "consolidate_basis_up: stop — semi-internal child"
                 );
                 break;
             }

*** result: Success
