*** packages/mudlark/src/graph_plateau.rs:720:59: replace == with != in GvGraph<C, V, N>::consolidate_basis_up

*** mutation diff:
--- packages/mudlark/src/graph_plateau.rs
+++ replace == with != in GvGraph<C, V, N>::consolidate_basis_up
@@ -712,17 +712,17 @@
                 match (pg.left, pg.right) {
                     (Some(l), Some(r)) => (l, r),
                     _ => break,
                 }
             };
 
             // Semi-internals break uniformity — cannot consolidate.
             if self.gnodes.get(left.index()).state() == GState::SemiInternal
-                || self.gnodes.get(right.index()).state() == GState::SemiInternal
+                || self.gnodes.get(right.index()).state() != /* ~ changed by cargo-mutants ~ */ GState::SemiInternal
             {
                 tracing::trace!(
                     from = gid.index(),
                     parent = parent_id.index(),
                     "consolidate_basis_up: stop — semi-internal child"
                 );
                 break;
             }

---- tests::decay::decay_f64_tree stdout ----

thread 'tests::decay::decay_f64_tree' (1656805) panicked at packages/mudlark/src/graph_plateau.rs:193:13:
POST-SPLIT: dynamic-contour-tracking mirror diverged from static rebuild
left (dynamic): {
    BasisEdge(
        0.0,
    ): Plateau {
        basis_edge: BasisEdge(
            0.0,
        ),
        start: 0.0,
        end: 16.0,
        depth: 2,

---- tests::decay::decay_multiple_uniform_preserves_invariants stdout ----

thread 'tests::decay::decay_multiple_uniform_preserves_invariants' (1656807) panicked at packages/mudlark/src/graph_plateau.rs:193:13:
POST-SPLIT: dynamic-contour-tracking mirror diverged from static rebuild
left (dynamic): {
    BasisEdge(
        0,
    ): Plateau {
        basis_edge: BasisEdge(
            0,
        ),
        start: 0,
        end: 16,
        depth: 2,

---- tests::decay::decay_multiple_selective_preserves_invariants stdout ----

thread 'tests::decay::decay_multiple_selective_preserves_invariants' (1656806) panicked at packages/mudlark/src/graph_plateau.rs:193:13:
POST-SPLIT: dynamic-contour-tracking mirror diverged from static rebuild
left (dynamic): {
    BasisEdge(
        0,
    ): Plateau {
        basis_edge: BasisEdge(
            0,
        ),
        start: 0,
        end: 16,
        depth: 2,

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 284 passed; 62 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
