*** packages/mudlark/src/graph_plateau.rs:73:9: replace GvGraph<C, V, N>::plateaus -> Cow<'_, BTreeMap<BasisEdge<C>, Plateau<C, V>>> with Cow::Owned(BTreeMap::new().to_owned())

*** mutation diff:
--- packages/mudlark/src/graph_plateau.rs
+++ replace GvGraph<C, V, N>::plateaus -> Cow<'_, BTreeMap<BasisEdge<C>, Plateau<C, V>>> with Cow::Owned(BTreeMap::new().to_owned())
@@ -65,25 +65,17 @@
     ///
     /// // Floor-key lookup: find the plateau containing coordinate 42.
     /// let hit = p.range(..=BasisEdge(42u64)).next_back();
     /// assert!(hit.is_some());
     /// ```
     #[must_use]
     #[allow(clippy::missing_const_for_fn)] // Cow::Borrowed is not const-compatible
     pub fn plateaus(&self) -> Cow<'_, BTreeMap<BasisEdge<C>, Plateau<C, V>>> {
-        #[cfg(feature = "dynamic-contour-tracking")]
-        {
-            self.debug_assert_plateau_mirror_consistency("plateaus()");
-            Cow::Borrowed(&self.plateaus)
-        }
-        #[cfg(not(feature = "dynamic-contour-tracking"))]
-        {
-            Cow::Owned(self.build_plateaus())
-        }
+        Cow::Owned(BTreeMap::new().to_owned()) /* ~ changed by cargo-mutants ~ */
     }
 
     // ── Mirror consistency check ────────────────────────────────
 
     /// Assert that the dynamically-maintained plateau mirror matches
     /// a freshly-built version from the G-tree state.
     ///
     /// Only compiled in debug builds with `dynamic-contour-tracking`.

---- tests::decay::decay_updates_plateau_sums stdout ----

thread 'tests::decay::decay_updates_plateau_sums' (1547235) panicked at packages/mudlark/src/tests/decay.rs:506:5:
assertion `left != right` failed: decay should change plateau sums
  left: []
 right: []

---- tests::observe::observe_updates_plateau_sum stdout ----

thread 'tests::observe::observe_updates_plateau_sum' (1547338) panicked at packages/mudlark/src/tests/observe.rs:282:26:
no entry found for key

---- tests::observe::observe_preserves_plateau_structure stdout ----

thread 'tests::observe::observe_preserves_plateau_structure' (1547333) panicked at packages/mudlark/src/tests/observe.rs:299:40:
index out of bounds: the len is 0 but the index is 0

failures:
    tests::decay::decay_updates_plateau_sums
    tests::observe::observe_preserves_plateau_structure
    tests::observe::observe_updates_plateau_sum

test result: FAILED. 343 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
