*** packages/mudlark/src/graph_plateau.rs:772:24: replace != with == in GvGraph<C, V, N>::consolidate_basis_up

*** mutation diff:
--- packages/mudlark/src/graph_plateau.rs
+++ replace != with == in GvGraph<C, V, N>::consolidate_basis_up
@@ -764,17 +764,17 @@
                     parent = parent_id.index(),
                     "consolidate_basis_up: stop — parent subtree not uniform"
                 );
                 break;
             };
 
             // Extra sanity: the uniform depth must match the plateau.
             let Some(p) = self.plateaus.get(&left_key) else { break };
-            if p.depth != uniform_depth {
+            if p.depth == /* ~ changed by cargo-mutants ~ */ uniform_depth {
                 tracing::trace!(
                     from = gid.index(),
                     parent = parent_id.index(),
                     plateau_depth = p.depth,
                     uniform_depth,
                     "consolidate_basis_up: stop — depth mismatch"
                 );
                 break;

---- tests::decay::decay_multiple_selective_preserves_invariants stdout ----

thread 'tests::decay::decay_multiple_selective_preserves_invariants' (1660701) panicked at packages/mudlark/src/graph_plateau.rs:193:13:
POST-SPLIT: dynamic-contour-tracking mirror diverged from static rebuild
left (dynamic): {
    BasisEdge(
        0,
    ): Plateau {
        basis_edge: BasisEdge(
            0,
        ),
        start: 0,
        end: 16,
        depth: 2,

---- tests::decay::decay_amplification_above_one stdout ----

thread 'tests::decay::decay_amplification_above_one' (1660693) panicked at packages/mudlark/src/graph_plateau.rs:193:13:
POST-SPLIT: dynamic-contour-tracking mirror diverged from static rebuild
left (dynamic): {
    BasisEdge(
        0,
    ): Plateau {
        basis_edge: BasisEdge(
            0,
        ),
        start: 0,
        end: 16,
        depth: 2,

---- tests::decay::decay_noop_at_attenuation_one stdout ----

thread 'tests::decay::decay_noop_at_attenuation_one' (1660703) panicked at packages/mudlark/src/graph_plateau.rs:193:13:
POST-SPLIT: dynamic-contour-tracking mirror diverged from static rebuild
left (dynamic): {
    BasisEdge(
        0,
    ): Plateau {
        basis_edge: BasisEdge(
            0,
        ),
        start: 0,
        end: 16,
        depth: 2,

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 284 passed; 62 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
