*** packages/mudlark/src/graph_plateau.rs:825:12: delete ! in GvGraph<C, V, N>::normalize_plateaus

*** mutation diff:
--- packages/mudlark/src/graph_plateau.rs
+++ delete ! in GvGraph<C, V, N>::normalize_plateaus
@@ -817,17 +817,17 @@
     #[cfg(feature = "dynamic-contour-tracking")]
     #[allow(clippy::too_many_lines)]
     pub(crate) fn normalize_plateaus(&mut self) {
         use crate::gnode::GState;
         use crate::gtree::gnode_depth_from_interval;
         use crate::plateau::{basis_edge_of, BasisEdge, Plateau};
 
         // ADR-M-031 Phase 4: early return when not dirty.
-        if !self.plateaus_dirty {
+        if  /* ~ changed by cargo-mutants ~ */self.plateaus_dirty {
             return;
         }
         self.plateaus_dirty = false;
 
         let _span = tracing::debug_span!("normalize_plateaus").entered();
 
         // ── Step 0: capture old total for conservation check ────
         #[cfg(debug_assertions)]

---- tests::diagnostic::normalize_plateaus_creates_span stdout ----

thread 'tests::diagnostic::normalize_plateaus_creates_span' (1663818) panicked at packages/mudlark/src/tests/diagnostic.rs:447:5:

failures:
    tests::diagnostic::normalize_plateaus_creates_span

test result: FAILED. 345 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
