*** packages/mudlark/src/graph_plateau.rs:853:20: delete ! in GvGraph<C, V, N>::normalize_plateaus

*** mutation diff:
--- packages/mudlark/src/graph_plateau.rs
+++ delete ! in GvGraph<C, V, N>::normalize_plateaus
@@ -845,17 +845,17 @@
         //    SemiInternal's DFS recurses into a node that is also
         //    a top-level old basis element.
         let mut elems: Vec<(GNodeId, BasisEdge<C>, u32, C, C, V)> = Vec::new();
         let mut seen = std::collections::HashSet::new();
         let basis_ids: Vec<GNodeId> = self.plateau_basis.back_map().keys().copied().collect();
         for gid in basis_ids {
             let mut stack = vec![gid];
             while let Some(nid) = stack.pop() {
-                if !seen.insert(nid) {
+                if  /* ~ changed by cargo-mutants ~ */seen.insert(nid) {
                     continue; // already collected by an ancestor's DFS
                 }
                 let g = self.gnodes.get(nid.index());
                 match g.state() {
                     GState::Terminal => {
                         let depth = gnode_depth_from_interval(g.lo, g.hi, N);
                         elems.push((nid, basis_edge_of(g), depth, g.lo, g.hi, g.sum));
                     }

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (1667304) panicked at packages/mudlark/src/graph_plateau.rs:193:13:
POST-OBSERVE: dynamic-contour-tracking mirror diverged from static rebuild
left (dynamic): {}
right (static): {
    BasisEdge(
        0,
    ): Plateau {
        basis_edge: BasisEdge(
            0,
        ),
        start: 0,
        end: 16,

---- tests::decay::decay_f64_tree stdout ----

thread 'tests::decay::decay_f64_tree' (1667307) panicked at packages/mudlark/src/graph_plateau.rs:193:13:
POST-OBSERVE: dynamic-contour-tracking mirror diverged from static rebuild
left (dynamic): {}
right (static): {
    BasisEdge(
        0.0,
    ): Plateau {
        basis_edge: BasisEdge(
            0.0,
        ),
        start: 0.0,
        end: 16.0,

---- tests::decay::decay_multiple_selective_preserves_invariants stdout ----

thread 'tests::decay::decay_multiple_selective_preserves_invariants' (1667308) panicked at packages/mudlark/src/graph_plateau.rs:193:13:
POST-OBSERVE: dynamic-contour-tracking mirror diverged from static rebuild
left (dynamic): {}
right (static): {
    BasisEdge(
        0,
    ): Plateau {
        basis_edge: BasisEdge(
            0,
        ),
        start: 0,
        end: 16,

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 250 passed; 96 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
