*** packages/mudlark/src/graph_plateau.rs:917:42: replace == with != in GvGraph<C, V, N>::normalize_plateaus

*** mutation diff:
--- packages/mudlark/src/graph_plateau.rs
+++ replace == with != in GvGraph<C, V, N>::normalize_plateaus
@@ -909,17 +909,17 @@
         // ── Step 2: left-to-right sweep ─────────────────────────
         let mut new_plateaus: std::collections::BTreeMap<BasisEdge<C>, Plateau<C, V>> = std::collections::BTreeMap::new();
         let mut assignments: Vec<(BasisEdge<C>, GNodeId)> = Vec::with_capacity(elems.len());
 
         for (gid, be, depth, lo, hi, sum) in &elems {
             let merge_key = new_plateaus
                 .range(..*be)
                 .next_back()
-                .filter(|(_, p)| p.depth == *depth)
+                .filter(|(_, p)| p.depth != /* ~ changed by cargo-mutants ~ */ *depth)
                 .map(|(&k, _)| k);
 
             let key = if let Some(mk) = merge_key {
                 let p = new_plateaus.get_mut(&mk).unwrap();
                 if hi.total_cmp(&p.end) == std::cmp::Ordering::Greater {
                     p.end = *hi;
                 }
                 if lo.total_cmp(&p.start) == std::cmp::Ordering::Less {

---- tests::decay::decay_amplification_above_one stdout ----

thread 'tests::decay::decay_amplification_above_one' (1670949) panicked at packages/mudlark/src/graph_plateau.rs:193:13:
POST-OBSERVE: dynamic-contour-tracking mirror diverged from static rebuild
left (dynamic): {
    BasisEdge(
        0,
    ): Plateau {
        basis_edge: BasisEdge(
            0,
        ),
        start: 0,
        end: 16,
        depth: 1,

---- tests::decay::decay_multiple_selective_preserves_invariants stdout ----

thread 'tests::decay::decay_multiple_selective_preserves_invariants' (1670954) panicked at packages/mudlark/src/graph_plateau.rs:193:13:
POST-OBSERVE: dynamic-contour-tracking mirror diverged from static rebuild
left (dynamic): {
    BasisEdge(
        0,
    ): Plateau {
        basis_edge: BasisEdge(
            0,
        ),
        start: 0,
        end: 16,
        depth: 1,

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (1670950) panicked at packages/mudlark/src/graph_plateau.rs:193:13:
POST-OBSERVE: dynamic-contour-tracking mirror diverged from static rebuild
left (dynamic): {
    BasisEdge(
        0,
    ): Plateau {
        basis_edge: BasisEdge(
            0,
        ),
        start: 0,
        end: 16,
        depth: 1,

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 274 passed; 72 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
