*** packages/mudlark/src/graph_plateau.rs:952:52: replace += with -= in GvGraph<C, V, N>::normalize_plateaus

*** mutation diff:
--- packages/mudlark/src/graph_plateau.rs
+++ replace += with -= in GvGraph<C, V, N>::normalize_plateaus
@@ -944,17 +944,17 @@
         }
 
         // ── Step 2 assert: sweep sum == element sum per key ─────
         #[cfg(debug_assertions)]
         {
             // Group collected element sums by assigned plateau key.
             let mut key_sums: std::collections::BTreeMap<BasisEdge<C>, f64> = std::collections::BTreeMap::new();
             for (i, (key, _gid)) in assignments.iter().enumerate() {
-                *key_sums.entry(*key).or_default() += elems[i].5.to_f64_approx();
+                *key_sums.entry(*key).or_default() -= /* ~ changed by cargo-mutants ~ */ elems[i].5.to_f64_approx();
             }
             for (key, elem_sum) in &key_sums {
                 let sweep_sum = new_plateaus[key].sum.to_f64_approx();
                 debug_assert!(
                     (sweep_sum - elem_sum).abs() < 1e-9,
                     "normalize_plateaus step 2: sweep sum {sweep_sum} != \
                      element sum {elem_sum} for plateau {key:?}",
                 );

---- tests::decay::decay_f64_tree stdout ----

thread 'tests::decay::decay_f64_tree' (1679826) panicked at packages/mudlark/src/graph_plateau.rs:956:17:
normalize_plateaus step 2: sweep sum 10 != element sum -10 for plateau BasisEdge(0.0)

---- tests::decay::decay_noop_at_attenuation_one stdout ----

thread 'tests::decay::decay_noop_at_attenuation_one' (1679831) panicked at packages/mudlark/src/graph_plateau.rs:956:17:
normalize_plateaus step 2: sweep sum 10 != element sum -10 for plateau BasisEdge(0)

---- tests::decay::decay_panics_q_above_one stdout ----

thread 'tests::decay::decay_panics_q_above_one' (1679836) panicked at packages/mudlark/src/graph_plateau.rs:956:17:
normalize_plateaus step 2: sweep sum 10 != element sum -10 for plateau BasisEdge(0)
note: panic did not contain expected string
      panic message: "normalize_plateaus step 2: sweep sum 10 != element sum -10 for plateau BasisEdge(0)"
 expected substring: "q must be in"

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 250 passed; 96 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
