*** packages/mudlark/src/graph_query.rs:107:40: replace * with + in GvGraph<C, V, N>::sample_child

*** mutation diff:
--- packages/mudlark/src/graph_query.rs
+++ replace * with + in GvGraph<C, V, N>::sample_child
@@ -99,17 +99,17 @@
     ///
     /// Picks a child with probability `child.intensity / total`.
     /// The hot loop touches only the contiguous `intensities` array
     /// (24 bytes for 3×`u64`) — SoA-optimised for this path.
     fn sample_child(children: &crate::vnode::PackedChildren<V>, rng: &mut impl crate::traits::Rng) -> VNodeId {
         let total: f64 = children.intensities[..children.len()].iter().map(|v| v.weight()).sum();
         debug_assert!(total > 0.0, "sample_child: zero-total children");
 
-        let threshold = rng.next_f64() * total;
+        let threshold = rng.next_f64() + /* ~ changed by cargo-mutants ~ */ total;
         let mut cumulative = 0.0_f64;
         for i in 0..children.len() {
             cumulative += children.intensities[i].weight();
             if threshold < cumulative {
                 return children.ids[i].expect("child ID within len");
             }
         }
         // Floating-point rounding safeguard: if threshold rounds to

---- get_consistent_with_sample stdout ----

thread 'get_consistent_with_sample' (1900145) panicked at packages/mudlark/src/graph_query.rs:105:9:
sample_child: zero-total children

failures:
    get_consistent_with_sample

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
