*** packages/mudlark/src/graph_query.rs:107:40: replace * with / in GvGraph<C, V, N>::sample_child

*** mutation diff:
--- packages/mudlark/src/graph_query.rs
+++ replace * with / in GvGraph<C, V, N>::sample_child
@@ -99,17 +99,17 @@
     ///
     /// Picks a child with probability `child.intensity / total`.
     /// The hot loop touches only the contiguous `intensities` array
     /// (24 bytes for 3×`u64`) — SoA-optimised for this path.
     fn sample_child(children: &crate::vnode::PackedChildren<V>, rng: &mut impl crate::traits::Rng) -> VNodeId {
         let total: f64 = children.intensities[..children.len()].iter().map(|v| v.weight()).sum();
         debug_assert!(total > 0.0, "sample_child: zero-total children");
 
-        let threshold = rng.next_f64() * total;
+        let threshold = rng.next_f64() / /* ~ changed by cargo-mutants ~ */ total;
         let mut cumulative = 0.0_f64;
         for i in 0..children.len() {
             cumulative += children.intensities[i].weight();
             if threshold < cumulative {
                 return children.ids[i].expect("child ID within len");
             }
         }
         // Floating-point rounding safeguard: if threshold rounds to

---- sample_respects_weight_proportions stdout ----

thread 'sample_respects_weight_proportions' (1910123) panicked at packages/mudlark/tests/graph_sample.rs:125:5:
should sample from right half

---- sample_with_seq_rng stdout ----

thread 'sample_with_seq_rng' (1910126) panicked at packages/mudlark/tests/graph_sample.rs:209:5:
assertion `left != right` failed: extreme RNG values should pick different cells
  left: Cell { start: 128, end: 256, intensity: 20, depth: 1 }
 right: Cell { start: 128, end: 256, intensity: 20, depth: 1 }

---- sample_frequency_convergence stdout ----

thread 'sample_frequency_convergence' (1910122) panicked at packages/mudlark/tests/graph_sample.rs:168:9:
bucket start=0: observed=1.0000, expected=0.7500, tol=0.0173

failures:
    sample_frequency_convergence
    sample_respects_weight_proportions
    sample_with_seq_rng

test result: FAILED. 6 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
