*** packages/mudlark/src/graph_query.rs:111:26: replace < with > in GvGraph<C, V, N>::sample_child

*** mutation diff:
--- packages/mudlark/src/graph_query.rs
+++ replace < with > in GvGraph<C, V, N>::sample_child
@@ -103,17 +103,17 @@
     fn sample_child(children: &crate::vnode::PackedChildren<V>, rng: &mut impl crate::traits::Rng) -> VNodeId {
         let total: f64 = children.intensities[..children.len()].iter().map(|v| v.weight()).sum();
         debug_assert!(total > 0.0, "sample_child: zero-total children");
 
         let threshold = rng.next_f64() * total;
         let mut cumulative = 0.0_f64;
         for i in 0..children.len() {
             cumulative += children.intensities[i].weight();
-            if threshold < cumulative {
+            if threshold > /* ~ changed by cargo-mutants ~ */ cumulative {
                 return children.ids[i].expect("child ID within len");
             }
         }
         // Floating-point rounding safeguard: if threshold rounds to
         // exactly `total`, fall through to the last child.
         children.ids[children.len() - 1].expect("last child ID")
     }

---- sample_deterministic_low_is_consistent stdout ----

thread 'sample_deterministic_low_is_consistent' (1919716) panicked at packages/mudlark/tests/graph_sample.rs:76:5:
assertion failed: cell1.depth > 0

---- sample_respects_weight_proportions stdout ----

thread 'sample_respects_weight_proportions' (1919719) panicked at packages/mudlark/src/graph_query.rs:105:9:
sample_child: zero-total children

---- sample_returns_terminal_cell_fields stdout ----

thread 'sample_returns_terminal_cell_fields' (1919720) panicked at packages/mudlark/tests/graph_sample.rs:60:5:
assertion failed: cell.depth > 0

failures:
    sample_deterministic_low_is_consistent
    sample_frequency_convergence
    sample_respects_weight_proportions
    sample_returns_terminal_cell_fields

test result: FAILED. 5 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
