*** packages/mudlark/src/graph_query.rs:211:18: replace < with == in GvGraph<C, V, N>::clamp_to_domain

*** mutation diff:
--- packages/mudlark/src/graph_query.rs
+++ replace < with == in GvGraph<C, V, N>::clamp_to_domain
@@ -203,17 +203,17 @@
     /// Safe because `route_to_receiver` uses `x < mid` / else, so
     /// `x == domain_max` always routes right, and the returned `Cell`
     /// draws its interval from the arena node's `[lo, hi)` which is
     /// always inside the domain.
     #[inline]
     fn clamp_to_domain(coord: C) -> C {
         let lo = C::zero();
         let hi = C::domain_max(N);
-        if coord < lo {
+        if coord == /* ~ changed by cargo-mutants ~ */ lo {
             lo
         } else if coord >= hi {
             hi
         } else {
             coord
         }
     }

---- get_out_of_domain_low_clamps_f64 stdout ----

thread 'get_out_of_domain_low_clamps_f64' (1940834) panicked at packages/mudlark/src/graph_query.rs:180:13:
get(): returned cell [0.0, 8.0) does not contain clamped coord -5.0

failures:
    get_out_of_domain_low_clamps_f64

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
