*** packages/mudlark/src/graph_query.rs:211:18: replace < with > in GvGraph<C, V, N>::clamp_to_domain

*** mutation diff:
--- packages/mudlark/src/graph_query.rs
+++ replace < with > in GvGraph<C, V, N>::clamp_to_domain
@@ -203,17 +203,17 @@
     /// Safe because `route_to_receiver` uses `x < mid` / else, so
     /// `x == domain_max` always routes right, and the returned `Cell`
     /// draws its interval from the arena node's `[lo, hi)` which is
     /// always inside the domain.
     #[inline]
     fn clamp_to_domain(coord: C) -> C {
         let lo = C::zero();
         let hi = C::domain_max(N);
-        if coord < lo {
+        if coord > /* ~ changed by cargo-mutants ~ */ lo {
             lo
         } else if coord >= hi {
             hi
         } else {
             coord
         }
     }

---- tests::structural::get_all_terminals_covered stdout ----

thread 'tests::structural::get_all_terminals_covered' (1941290) panicked at packages/mudlark/src/tests/structural.rs:154:13:
get(64) returned [0, 64) which does not contain lo

failures:
    tests::structural::get_all_terminals_covered

test result: FAILED. 345 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
