*** packages/mudlark/src/graph_query.rs:213:25: replace >= with < in GvGraph<C, V, N>::clamp_to_domain

*** mutation diff:
--- packages/mudlark/src/graph_query.rs
+++ replace >= with < in GvGraph<C, V, N>::clamp_to_domain
@@ -205,17 +205,17 @@
     /// draws its interval from the arena node's `[lo, hi)` which is
     /// always inside the domain.
     #[inline]
     fn clamp_to_domain(coord: C) -> C {
         let lo = C::zero();
         let hi = C::domain_max(N);
         if coord < lo {
             lo
-        } else if coord >= hi {
+        } else if coord < /* ~ changed by cargo-mutants ~ */ hi {
             hi
         } else {
             coord
         }
     }
 
     /// Trim a G-node's interval to the effective half for semi-internals.
     ///

---- tests::graph::get_semi_internal_left_child_trims_right stdout ----

thread 'tests::graph::get_semi_internal_left_child_trims_right' (1950443) panicked at packages/mudlark/src/tests/graph.rs:348:17:
assertion `left == right` failed
  left: 192
 right: 0

---- tests::graph::get_semi_internal_right_child_trims_left stdout ----

thread 'tests::graph::get_semi_internal_right_child_trims_left' (1950444) panicked at packages/mudlark/src/tests/graph.rs:369:13:
assertion `left == right` failed
  left: 192
 right: 0

---- tests::structural::get_all_terminals_covered stdout ----

thread 'tests::structural::get_all_terminals_covered' (1950622) panicked at packages/mudlark/src/tests/structural.rs:154:13:
get(0) returned [224, 256) which does not contain lo

failures:
    tests::graph::get_semi_internal_left_child_trims_right
    tests::graph::get_semi_internal_right_child_trims_left
    tests::structural::get_all_terminals_covered

test result: FAILED. 343 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
