*** packages/mudlark/src/graph_query.rs:331:24: replace < with > in GvGraph<C, V, N>::range_sum

*** mutation diff:
--- packages/mudlark/src/graph_query.rs
+++ replace < with > in GvGraph<C, V, N>::range_sum
@@ -323,17 +323,17 @@
             }
             Bound::Unbounded => C::domain_max(N),
         };
 
         // ── Clamp to domain ─────────────────────────────────────
         let domain_lo = C::zero();
         let domain_hi = C::domain_max(N);
 
-        let lo = if lo < domain_lo { domain_lo } else { lo };
+        let lo = if lo > /* ~ changed by cargo-mutants ~ */ domain_lo { domain_lo } else { lo };
         let hi = if hi > domain_hi { domain_hi } else { hi };
 
         // Empty range after clamping.
         if lo >= hi {
             return V::zero();
         }
 
         self.range_sum_inner(self.g_root, lo, hi)

---- range_sum_empty_range_is_zero stdout ----

thread 'range_sum_empty_range_is_zero' (1957520) panicked at packages/mudlark/tests/graph_range.rs:28:5:
assertion `left == right` failed
  left: 8
 right: 0

---- range_sum_multi_node_structure stdout ----

thread 'range_sum_multi_node_structure' (1957524) panicked at packages/mudlark/tests/graph_range.rs:141:5:
halves=52, total=40, node_count=7

---- range_sum_unbounded_end stdout ----

thread 'range_sum_unbounded_end' (1957528) panicked at packages/mudlark/tests/graph_range.rs:123:5:
assertion `left == right` failed
  left: 10
 right: 5

failures:
    range_sum_empty_range_is_zero
    range_sum_multi_node_structure
    range_sum_unbounded_end

test result: FAILED. 9 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
