*** packages/mudlark/src/graph_query.rs:332:24: replace > with < in GvGraph<C, V, N>::range_sum

*** mutation diff:
--- packages/mudlark/src/graph_query.rs
+++ replace > with < in GvGraph<C, V, N>::range_sum
@@ -324,17 +324,17 @@
             Bound::Unbounded => C::domain_max(N),
         };
 
         // ── Clamp to domain ─────────────────────────────────────
         let domain_lo = C::zero();
         let domain_hi = C::domain_max(N);
 
         let lo = if lo < domain_lo { domain_lo } else { lo };
-        let hi = if hi > domain_hi { domain_hi } else { hi };
+        let hi = if hi < /* ~ changed by cargo-mutants ~ */ domain_hi { domain_hi } else { hi };
 
         // Empty range after clamping.
         if lo >= hi {
             return V::zero();
         }
 
         self.range_sum_inner(self.g_root, lo, hi)
     }

---- range_sum_empty_range_is_zero stdout ----

thread 'range_sum_empty_range_is_zero' (1968861) panicked at packages/mudlark/tests/graph_range.rs:28:5:
assertion `left == right` failed
  left: 30
 right: 0

---- range_sum_multi_node_structure stdout ----

thread 'range_sum_multi_node_structure' (1968865) panicked at packages/mudlark/tests/graph_range.rs:141:5:
halves=67, total=40, node_count=7

---- range_sum_f64_prorate stdout ----

thread 'range_sum_f64_prorate' (1968862) panicked at packages/mudlark/tests/graph_range.rs:191:5:
assertion failed: (g.range_sum(0.0..8.0) - 8.0).abs() < f64::EPSILON

failures:
    range_sum_empty_range_is_zero
    range_sum_f64_prorate
    range_sum_inclusive_end
    range_sum_multi_node_structure
    range_sum_single_root_partial
    range_sum_unbounded_start

test result: FAILED. 6 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
