*** packages/mudlark/src/graph_query.rs:332:24: replace > with >= in GvGraph<C, V, N>::range_sum

*** mutation diff:
--- packages/mudlark/src/graph_query.rs
+++ replace > with >= in GvGraph<C, V, N>::range_sum
@@ -324,17 +324,17 @@
             Bound::Unbounded => C::domain_max(N),
         };
 
         // ── Clamp to domain ─────────────────────────────────────
         let domain_lo = C::zero();
         let domain_hi = C::domain_max(N);
 
         let lo = if lo < domain_lo { domain_lo } else { lo };
-        let hi = if hi > domain_hi { domain_hi } else { hi };
+        let hi = if hi >= /* ~ changed by cargo-mutants ~ */ domain_hi { domain_hi } else { hi };
 
         // Empty range after clamping.
         if lo >= hi {
             return V::zero();
         }
 
         self.range_sum_inner(self.g_root, lo, hi)
     }

*** result: Success
