*** packages/mudlark/src/graph_query.rs:335:15: replace >= with < in GvGraph<C, V, N>::range_sum

*** mutation diff:
--- packages/mudlark/src/graph_query.rs
+++ replace >= with < in GvGraph<C, V, N>::range_sum
@@ -327,17 +327,17 @@
         // ── Clamp to domain ─────────────────────────────────────
         let domain_lo = C::zero();
         let domain_hi = C::domain_max(N);
 
         let lo = if lo < domain_lo { domain_lo } else { lo };
         let hi = if hi > domain_hi { domain_hi } else { hi };
 
         // Empty range after clamping.
-        if lo >= hi {
+        if lo < /* ~ changed by cargo-mutants ~ */ hi {
             return V::zero();
         }
 
         self.range_sum_inner(self.g_root, lo, hi)
     }
 
     /// Recursive G-Tree descent for range sum.
     ///

---- full_domain_range stdout ----

thread 'full_domain_range' (1984899) panicked at packages/mudlark/tests/contour_range.rs:143:5:
assertion `left == right` failed
  left: 0
 right: 202

---- energy_exact_gap stdout ----

thread 'energy_exact_gap' (1984896) panicked at packages/mudlark/tests/contour_range.rs:742:9:
assertion `left == right` failed: full-domain energy (202) != exact_energy (0)
  left: 202
 right: 0

failures:
    energy_exact_gap
    full_domain_range

test result: FAILED. 21 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
