*** packages/mudlark/src/graph_query.rs:352:21: replace >= with < in GvGraph<C, V, N>::range_sum_inner

*** mutation diff:
--- packages/mudlark/src/graph_query.rs
+++ replace >= with < in GvGraph<C, V, N>::range_sum_inner
@@ -344,17 +344,17 @@
     /// `query_lo..query_hi` is the half-open query range (already
     /// clamped). `gid` is the current G-node.
     fn range_sum_inner(&self, gid: crate::handle::GNodeId, query_lo: C, query_hi: C) -> V {
         let g = self.gnodes.get(gid.index());
         let node_lo = g.lo;
         let node_hi = g.hi;
 
         // Fully disjoint.
-        if query_lo >= node_hi || query_hi <= node_lo {
+        if query_lo < /* ~ changed by cargo-mutants ~ */ node_hi || query_hi <= node_lo {
             return V::zero();
         }
 
         // Fully contained.
         if query_lo <= node_lo && query_hi >= node_hi {
             return g.sum;
         }

---- energy_exact_gap stdout ----

thread 'energy_exact_gap' (1994171) panicked at packages/mudlark/tests/contour_range.rs:742:9:
assertion `left == right` failed: full-domain energy (202) != exact_energy (0)
  left: 202
 right: 0

---- full_domain_range stdout ----

thread 'full_domain_range' (1994174) panicked at packages/mudlark/tests/contour_range.rs:143:5:
assertion `left == right` failed
  left: 0
 right: 202

failures:
    energy_exact_gap
    full_domain_range

test result: FAILED. 21 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
