*** packages/mudlark/src/graph_query.rs:357:21: replace <= with > in GvGraph<C, V, N>::range_sum_inner

*** mutation diff:
--- packages/mudlark/src/graph_query.rs
+++ replace <= with > in GvGraph<C, V, N>::range_sum_inner
@@ -349,17 +349,17 @@
         let node_hi = g.hi;
 
         // Fully disjoint.
         if query_lo >= node_hi || query_hi <= node_lo {
             return V::zero();
         }
 
         // Fully contained.
-        if query_lo <= node_lo && query_hi >= node_hi {
+        if query_lo > /* ~ changed by cargo-mutants ~ */ node_lo && query_hi >= node_hi {
             return g.sum;
         }
 
         // ── Partial overlap: pro-rate own, recurse children ─────
         let overlap_lo = if query_lo > node_lo { query_lo } else { node_lo };
         let overlap_hi = if query_hi < node_hi { query_hi } else { node_hi };
 
         // Pro-rate g.own by overlap/width using f64 ratio arithmetic.

---- range_sum_multi_node_structure stdout ----

thread 'range_sum_multi_node_structure' (2001361) panicked at packages/mudlark/tests/graph_range.rs:141:5:
halves=52, total=40, node_count=7

---- range_sum_unbounded_end stdout ----

thread 'range_sum_unbounded_end' (2001365) panicked at packages/mudlark/tests/graph_range.rs:123:5:
assertion `left == right` failed
  left: 10
 right: 5

failures:
    range_sum_multi_node_structure
    range_sum_unbounded_end

test result: FAILED. 10 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
