*** packages/mudlark/src/graph_query.rs:357:32: replace && with || in GvGraph<C, V, N>::range_sum_inner

*** mutation diff:
--- packages/mudlark/src/graph_query.rs
+++ replace && with || in GvGraph<C, V, N>::range_sum_inner
@@ -349,17 +349,17 @@
         let node_hi = g.hi;
 
         // Fully disjoint.
         if query_lo >= node_hi || query_hi <= node_lo {
             return V::zero();
         }
 
         // Fully contained.
-        if query_lo <= node_lo && query_hi >= node_hi {
+        if query_lo <= node_lo || /* ~ changed by cargo-mutants ~ */ query_hi >= node_hi {
             return g.sum;
         }
 
         // ── Partial overlap: pro-rate own, recurse children ─────
         let overlap_lo = if query_lo > node_lo { query_lo } else { node_lo };
         let overlap_hi = if query_hi < node_hi { query_hi } else { node_hi };
 
         // Pro-rate g.own by overlap/width using f64 ratio arithmetic.

---- range_sum_unbounded_start stdout ----

thread 'range_sum_unbounded_start' (1998790) panicked at packages/mudlark/tests/graph_range.rs:108:5:
assertion `left == right` failed
  left: 10
 right: 5

---- range_sum_multi_node_structure stdout ----

thread 'range_sum_multi_node_structure' (1998785) panicked at packages/mudlark/tests/graph_range.rs:141:5:
halves=80, total=40, node_count=7

---- range_sum_unbounded_end stdout ----

thread 'range_sum_unbounded_end' (1998789) panicked at packages/mudlark/tests/graph_range.rs:123:5:
assertion `left == right` failed
  left: 10
 right: 5

failures:
    range_sum_f64_prorate
    range_sum_inclusive_end
    range_sum_multi_node_structure
    range_sum_single_root_partial
    range_sum_unbounded_end
    range_sum_unbounded_start

test result: FAILED. 6 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
