*** packages/mudlark/src/graph_query.rs:357:44: replace >= with < in GvGraph<C, V, N>::range_sum_inner

*** mutation diff:
--- packages/mudlark/src/graph_query.rs
+++ replace >= with < in GvGraph<C, V, N>::range_sum_inner
@@ -349,17 +349,17 @@
         let node_hi = g.hi;
 
         // Fully disjoint.
         if query_lo >= node_hi || query_hi <= node_lo {
             return V::zero();
         }
 
         // Fully contained.
-        if query_lo <= node_lo && query_hi >= node_hi {
+        if query_lo <= node_lo && query_hi < /* ~ changed by cargo-mutants ~ */ node_hi {
             return g.sum;
         }
 
         // ── Partial overlap: pro-rate own, recurse children ─────
         let overlap_lo = if query_lo > node_lo { query_lo } else { node_lo };
         let overlap_hi = if query_hi < node_hi { query_hi } else { node_hi };
 
         // Pro-rate g.own by overlap/width using f64 ratio arithmetic.

---- range_sum_f64_prorate stdout ----

thread 'range_sum_f64_prorate' (2006839) panicked at packages/mudlark/tests/graph_range.rs:191:5:
assertion failed: (g.range_sum(0.0..8.0) - 8.0).abs() < f64::EPSILON

---- range_sum_inclusive_end stdout ----

thread 'range_sum_inclusive_end' (2006841) panicked at packages/mudlark/tests/graph_range.rs:93:5:
assertion `left == right` failed
  left: 10
 right: 5

---- range_sum_multi_node_structure stdout ----

thread 'range_sum_multi_node_structure' (2006842) panicked at packages/mudlark/tests/graph_range.rs:141:5:
halves=67, total=40, node_count=7

failures:
    range_sum_f64_prorate
    range_sum_inclusive_end
    range_sum_multi_node_structure
    range_sum_single_root_partial
    range_sum_unbounded_start

test result: FAILED. 7 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
