*** packages/mudlark/src/graph_query.rs:363:38: replace < with == in GvGraph<C, V, N>::range_sum_inner

*** mutation diff:
--- packages/mudlark/src/graph_query.rs
+++ replace < with == in GvGraph<C, V, N>::range_sum_inner
@@ -355,17 +355,17 @@
 
         // Fully contained.
         if query_lo <= node_lo && query_hi >= node_hi {
             return g.sum;
         }
 
         // ── Partial overlap: pro-rate own, recurse children ─────
         let overlap_lo = if query_lo > node_lo { query_lo } else { node_lo };
-        let overlap_hi = if query_hi < node_hi { query_hi } else { node_hi };
+        let overlap_hi = if query_hi == /* ~ changed by cargo-mutants ~ */ node_hi { query_hi } else { node_hi };
 
         // Pro-rate g.own by overlap/width using f64 ratio arithmetic.
         let node_width = C::width(node_lo, node_hi).to_f64();
         let overlap_width = C::width(overlap_lo, overlap_hi).to_f64();
         let own_prorated = g.own.scale_by(overlap_width / node_width);
 
         // Recurse into children.
         let left_sum = g

---- range_sum_multi_node_structure stdout ----

thread 'range_sum_multi_node_structure' (2018596) panicked at packages/mudlark/tests/graph_range.rs:141:5:
halves=47, total=40, node_count=7

---- range_sum_single_root_partial stdout ----

thread 'range_sum_single_root_partial' (2018599) panicked at packages/mudlark/tests/graph_range.rs:61:5:
assertion `left == right` failed
  left: 10
 right: 5

---- range_sum_inclusive_end stdout ----

thread 'range_sum_inclusive_end' (2018595) panicked at packages/mudlark/tests/graph_range.rs:93:5:
assertion `left == right` failed
  left: 10
 right: 5

failures:
    range_sum_f64_prorate
    range_sum_inclusive_end
    range_sum_multi_node_structure
    range_sum_single_root_partial
    range_sum_unbounded_start

test result: FAILED. 7 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
