*** packages/mudlark/src/graph_query.rs:363:38: replace < with > in GvGraph<C, V, N>::range_sum_inner

*** mutation diff:
--- packages/mudlark/src/graph_query.rs
+++ replace < with > in GvGraph<C, V, N>::range_sum_inner
@@ -355,17 +355,17 @@
 
         // Fully contained.
         if query_lo <= node_lo && query_hi >= node_hi {
             return g.sum;
         }
 
         // ── Partial overlap: pro-rate own, recurse children ─────
         let overlap_lo = if query_lo > node_lo { query_lo } else { node_lo };
-        let overlap_hi = if query_hi < node_hi { query_hi } else { node_hi };
+        let overlap_hi = if query_hi > /* ~ changed by cargo-mutants ~ */ node_hi { query_hi } else { node_hi };
 
         // Pro-rate g.own by overlap/width using f64 ratio arithmetic.
         let node_width = C::width(node_lo, node_hi).to_f64();
         let overlap_width = C::width(overlap_lo, overlap_hi).to_f64();
         let own_prorated = g.own.scale_by(overlap_width / node_width);
 
         // Recurse into children.
         let left_sum = g

---- nesting_monotonicity stdout ----

thread 'nesting_monotonicity' (2021732) panicked at packages/mudlark/tests/contour_range.rs:265:21:
inner [18, 48) exact_energy 155 > outer [0, 48) exact_energy 115

---- split_subadditivity stdout ----

thread 'split_subadditivity' (2021743) panicked at packages/mudlark/tests/contour_range.rs:234:17:
right [18, 48) exact_energy 155 > full [0, 48) exact_energy 115

failures:
    nesting_monotonicity
    split_subadditivity

test result: FAILED. 21 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
