*** packages/mudlark/src/graph_query.rs:566:15: replace >= with < in GvGraph<C, V, N>::select_plateaus

*** mutation diff:
--- packages/mudlark/src/graph_query.rs
+++ replace >= with < in GvGraph<C, V, N>::select_plateaus
@@ -558,17 +558,17 @@
     ///     let cr = g.contour_range(start, end).unwrap();
     ///     assert!(cr.basis.len() >= 1);
     /// }
     /// ```
     #[must_use]
     pub fn select_plateaus(&self, lo: C, hi: C) -> Option<(BasisEdge<C>, BasisEdge<C>)> {
         use std::ops::Bound;
 
-        if lo >= hi {
+        if lo < /* ~ changed by cargo-mutants ~ */ hi {
             return None;
         }
 
         let plateaus = self.plateaus();
         if plateaus.is_empty() {
             return None;
         }

---- select_plateaus_full_domain stdout ----

thread 'select_plateaus_full_domain' (2042535) panicked at packages/mudlark/tests/contour_range.rs:927:9:
select_plateaus(0, 256) returned None on non-empty tree

failures:
    select_plateaus_full_domain

test result: FAILED. 22 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
