*** packages/mudlark/src/graph_query.rs:605:41: replace <= with > in GvGraph<C, V, N>::decompose_basis

*** mutation diff:
--- packages/mudlark/src/graph_query.rs
+++ replace <= with > in GvGraph<C, V, N>::decompose_basis
@@ -597,17 +597,17 @@
     ///
     /// Collects the minimal G-node cover of `[query_lo, query_hi)`.
     /// Semi-internal nodes with an uncovered half overlapping the
     /// range are flagged as boundary thatching elements (§CR.3.2).
     fn decompose_basis(&self, gid: GNodeId, query_lo: C, query_hi: C, basis: &mut Vec<BasisElement<C, V>>) {
         let g = self.gnodes.get(gid.index());
 
         // 1. Disjoint — no overlap with query range.
-        if query_lo >= g.hi || query_hi <= g.lo {
+        if query_lo >= g.hi || query_hi > /* ~ changed by cargo-mutants ~ */ g.lo {
             return;
         }
 
         // 2. Fully contained — this is a basis element (not thatching).
         if query_lo <= g.lo && query_hi >= g.hi {
             basis.push(BasisElement {
                 gnode_id: gid,
                 start: g.lo,

---- basis_is_flat_list stdout ----

thread 'basis_is_flat_list' (2054580) panicked at packages/mudlark/tests/contour_range.rs:622:13:
basis should not be empty for [0, 16)

---- full_domain_range stdout ----

thread 'full_domain_range' (2054591) panicked at packages/mudlark/src/traits/accumulator.rs:245:1:
attempt to subtract with overflow

---- boundary_count_at_most_two stdout ----

thread 'boundary_count_at_most_two' (2054581) panicked at packages/mudlark/src/traits/accumulator.rs:245:1:
attempt to subtract with overflow

failures:
    basis_is_flat_list
    boundary_count_at_most_two
    boundary_thatch_flag
    cross_plateau_energy_non_negative
    determinism
    energy_equals_basis_sum
    energy_exact_gap
    energy_only_matches_full
    energy_ordering
    full_domain_range
    nesting_monotonicity
    no_straddling_ancestors

test result: FAILED. 4 passed; 19 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
