*** packages/mudlark/src/graph_query.rs:610:29: replace && with || in GvGraph<C, V, N>::decompose_basis

*** mutation diff:
--- packages/mudlark/src/graph_query.rs
+++ replace && with || in GvGraph<C, V, N>::decompose_basis
@@ -602,17 +602,17 @@
         let g = self.gnodes.get(gid.index());
 
         // 1. Disjoint — no overlap with query range.
         if query_lo >= g.hi || query_hi <= g.lo {
             return;
         }
 
         // 2. Fully contained — this is a basis element (not thatching).
-        if query_lo <= g.lo && query_hi >= g.hi {
+        if query_lo <= g.lo || /* ~ changed by cargo-mutants ~ */ query_hi >= g.hi {
             basis.push(BasisElement {
                 gnode_id: gid,
                 start: g.lo,
                 end: g.hi,
                 own: g.own,
                 sum: g.sum,
                 depth: gnode_depth_from_interval(g.lo, g.hi, N),
                 is_boundary_thatch: false,

---- basis_is_flat_list stdout ----

thread 'basis_is_flat_list' (2055450) panicked at packages/mudlark/tests/contour_range.rs:665:13:
assertion `left == right` failed: last basis element doesn't end at range end for [0, 16)
  left: 256
 right: 16

---- single_plateau_range stdout ----

thread 'single_plateau_range' (2055469) panicked at packages/mudlark/tests/contour_range.rs:109:13:
basis element [0, 256) not within [0, 16)

failures:
    basis_is_flat_list
    single_plateau_range

test result: FAILED. 21 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
