*** packages/mudlark/src/graph_query.rs:610:41: replace >= with < in GvGraph<C, V, N>::decompose_basis

*** mutation diff:
--- packages/mudlark/src/graph_query.rs
+++ replace >= with < in GvGraph<C, V, N>::decompose_basis
@@ -602,17 +602,17 @@
         let g = self.gnodes.get(gid.index());
 
         // 1. Disjoint — no overlap with query range.
         if query_lo >= g.hi || query_hi <= g.lo {
             return;
         }
 
         // 2. Fully contained — this is a basis element (not thatching).
-        if query_lo <= g.lo && query_hi >= g.hi {
+        if query_lo <= g.lo && query_hi < /* ~ changed by cargo-mutants ~ */ g.hi {
             basis.push(BasisElement {
                 gnode_id: gid,
                 start: g.lo,
                 end: g.hi,
                 own: g.own,
                 sum: g.sum,
                 depth: gnode_depth_from_interval(g.lo, g.hi, N),
                 is_boundary_thatch: false,

---- basis_is_flat_list stdout ----

thread 'basis_is_flat_list' (2065149) panicked at packages/mudlark/tests/contour_range.rs:665:13:
assertion `left == right` failed: last basis element doesn't end at range end for [0, 16)
  left: 256
 right: 16

---- boundary_count_at_most_two stdout ----

thread 'boundary_count_at_most_two' (2065195) panicked at packages/mudlark/src/traits/accumulator.rs:245:1:
attempt to subtract with overflow

---- cross_plateau_energy_non_negative stdout ----

thread 'cross_plateau_energy_non_negative' (2065198) panicked at packages/mudlark/src/traits/accumulator.rs:245:1:
attempt to subtract with overflow

failures:
    basis_is_flat_list
    boundary_count_at_most_two
    boundary_thatch_flag
    cross_plateau_energy_non_negative
    determinism
    energy_equals_basis_sum
    energy_exact_gap
    energy_only_matches_full
    energy_ordering
    full_domain_range
    nesting_monotonicity
    no_straddling_ancestors

test result: FAILED. 4 passed; 19 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
