*** packages/mudlark/src/graph_query.rs:646:36: replace < with > in GvGraph<C, V, N>::decompose_basis

*** mutation diff:
--- packages/mudlark/src/graph_query.rs
+++ replace < with > in GvGraph<C, V, N>::decompose_basis
@@ -638,17 +638,17 @@
         let right_absent = g.right.is_none();
         if left_absent != right_absent {
             // Exactly one child absent ⇒ semi-internal.
             // Check if both halves overlap the query range.
             let l_lo = if query_lo > g.lo { query_lo } else { g.lo };
             let l_hi = if query_hi < mid { query_hi } else { mid };
             let r_lo = if query_lo > mid { query_lo } else { mid };
             let r_hi = if query_hi < g.hi { query_hi } else { g.hi };
-            if l_lo < l_hi && r_lo < r_hi {
+            if l_lo < l_hi && r_lo > /* ~ changed by cargo-mutants ~ */ r_hi {
                 // Both halves overlap — select the node directly.
                 // Coverage: g's interval clipped to the query range (§CR.2.2).
                 basis.push(BasisElement {
                     gnode_id: gid,
                     start: l_lo, // = max(g.lo, query_lo)
                     end: r_hi,   // = min(g.hi, query_hi)
                     own: g.own,
                     sum: g.sum,

*** result: Success
