*** packages/mudlark/src/graph_query.rs:670:24: replace < with <= in GvGraph<C, V, N>::decompose_basis

*** mutation diff:
--- packages/mudlark/src/graph_query.rs
+++ replace < with <= in GvGraph<C, V, N>::decompose_basis
@@ -662,17 +662,17 @@
         // ── Left child ──────────────────────────────────────────
         if let Some(left_id) = g.left {
             self.decompose_basis(left_id, query_lo, query_hi, basis);
         } else {
             // No left child — semi-internal.  Uncovered half is [g.lo, mid).
             // If this overlaps the query, it's a boundary thatching element.
             let tile_lo = if query_lo > g.lo { query_lo } else { g.lo };
             let tile_hi = if query_hi < mid { query_hi } else { mid };
-            if tile_lo < tile_hi {
+            if tile_lo <= /* ~ changed by cargo-mutants ~ */ tile_hi {
                 basis.push(BasisElement {
                     gnode_id: gid,
                     start: tile_lo,
                     end: tile_hi,
                     own: g.own,
                     sum: g.sum,
                     depth: gnode_depth_from_interval(g.lo, g.hi, N),
                     is_boundary_thatch: true,

*** result: Success
