*** packages/mudlark/src/gtree.rs:31:14: replace < with == in route_to_receiver

*** mutation diff:
--- packages/mudlark/src/gtree.rs
+++ replace < with == in route_to_receiver
@@ -23,17 +23,17 @@
 ///
 /// See §IDEA M-5.2 `route_to_receiver`.
 #[must_use]
 pub fn route_to_receiver<C: Coordinate, V: Accumulator>(gnodes: &Arena<GNode<C, V>>, root: GNodeId, x: C) -> GNodeId {
     let mut current = root;
     loop {
         let g = gnodes.get(current.index());
         let mid = C::midpoint(g.lo, g.hi);
-        if x < mid {
+        if x == /* ~ changed by cargo-mutants ~ */ mid {
             if let Some(left) = g.left {
                 current = left;
             } else {
                 return current;
             }
         } else if let Some(right) = g.right {
             current = right;
         } else {

---- tests::decay_f64_depth::minimal_f64_depth_saturation stdout ----

thread 'tests::decay_f64_depth::minimal_f64_depth_saturation' (2310157) panicked at packages/mudlark/src/gtree.rs:62:5:
gnode_depth_from_interval: zero-width interval

---- tests::graph::get_semi_internal_left_child_trims_right stdout ----

thread 'tests::graph::get_semi_internal_left_child_trims_right' (2310226) panicked at packages/mudlark/src/graph_query.rs:180:13:
get(): returned cell [240, 256) does not contain clamped coord 0

---- tests::gtree::route_semi_internal stdout ----

thread 'tests::gtree::route_semi_internal' (2310251) panicked at packages/mudlark/src/tests/gtree.rs:70:5:
assertion `left == right` failed
  left: GNodeId(1)
 right: GNodeId(2)

failures:
    tests::decay_f64_depth::minimal_f64_depth_saturation
    tests::graph::get_semi_internal_depth_is_trimmed_depth
    tests::graph::get_semi_internal_left_child_trims_right
    tests::graph::get_semi_internal_right_child_trims_left
    tests::gtree::route_semi_internal
    tests::gtree::route_with_children
    tests::observe::cascading_splits
    tests::observe::observe_propagates_g_sums_correctly
    tests::observe::observe_routes_after_split
    tests::structural::get_all_terminals_covered
    tests::worked_example::step2_g_tree_structure
    tests::worked_example::step2_v_tree_after_skip_promote

test result: FAILED. 329 passed; 17 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
