*** packages/mudlark/src/gtree.rs:31:14: replace < with <= in route_to_receiver

*** mutation diff:
--- packages/mudlark/src/gtree.rs
+++ replace < with <= in route_to_receiver
@@ -23,17 +23,17 @@
 ///
 /// See §IDEA M-5.2 `route_to_receiver`.
 #[must_use]
 pub fn route_to_receiver<C: Coordinate, V: Accumulator>(gnodes: &Arena<GNode<C, V>>, root: GNodeId, x: C) -> GNodeId {
     let mut current = root;
     loop {
         let g = gnodes.get(current.index());
         let mid = C::midpoint(g.lo, g.hi);
-        if x < mid {
+        if x <= /* ~ changed by cargo-mutants ~ */ mid {
             if let Some(left) = g.left {
                 current = left;
             } else {
                 return current;
             }
         } else if let Some(right) = g.right {
             current = right;
         } else {

---- tests::decay_f64_depth::minimal_f64_depth_saturation stdout ----

thread 'tests::decay_f64_depth::minimal_f64_depth_saturation' (2312363) panicked at packages/mudlark/src/gtree.rs:62:5:
gnode_depth_from_interval: zero-width interval

---- tests::gtree::route_with_children stdout ----

thread 'tests::gtree::route_with_children' (2312449) panicked at packages/mudlark/src/tests/gtree.rs:55:5:
assertion `left == right` failed
  left: GNodeId(2)
 right: GNodeId(3)

---- tests::graph::get_semi_internal_depth_is_trimmed_depth stdout ----

thread 'tests::graph::get_semi_internal_depth_is_trimmed_depth' (2312422) panicked at packages/mudlark/src/graph_query.rs:180:13:
get(): returned cell [128, 192) does not contain clamped coord 192

failures:
    tests::decay_f64_depth::minimal_f64_depth_saturation
    tests::graph::get_semi_internal_depth_is_trimmed_depth
    tests::graph::get_semi_internal_left_child_trims_right
    tests::gtree::route_with_children
    tests::structural::get_all_terminals_covered
    tests::structural::semi_internal_surviving_child_unaffected

test result: FAILED. 340 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
