*** packages/mudlark/src/gtree.rs:71:27: replace - with + in gnode_depth_from_interval

*** mutation diff:
--- packages/mudlark/src/gtree.rs
+++ replace - with + in gnode_depth_from_interval
@@ -63,17 +63,17 @@
     // log2 of a power-of-two width. For integers this is exact;
     // for floats f64::log2 returns an exact integer for 2^k inputs.
     //
     // Cast via i32 (not u32) so that sub-unit float widths
     // (log2 < 0) produce depths > n instead of saturating to n.
     #[allow(clippy::cast_possible_truncation)]
     let log2_width = width_f64.log2() as i32;
     #[allow(clippy::cast_possible_wrap, clippy::cast_sign_loss)]
-    let depth = (n as i32 - log2_width) as u32;
+    let depth = (n as i32 + /* ~ changed by cargo-mutants ~ */ log2_width) as u32;
     depth
 }
 
 /// Recompute `sum = own + left.sum + right.sum` from `start` upward
 /// to the G-Tree root, directly reasserting G-I1 at each level.
 ///
 /// Used by `observe()` on the hot path instead of
 /// `propagate_g_sums` (moved to tests), avoiding the need for subtraction on

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (2315802) panicked at packages/mudlark/src/decay.rs:207:27:
attempt to subtract with overflow

---- tests::decay::decay_energy_conservation_selective stdout ----

thread 'tests::decay::decay_energy_conservation_selective' (2315803) panicked at packages/mudlark/src/decay.rs:207:27:
attempt to subtract with overflow

---- tests::decay::decay_multiple_selective_preserves_invariants stdout ----

thread 'tests::decay::decay_multiple_selective_preserves_invariants' (2315806) panicked at packages/mudlark/src/decay.rs:207:27:
attempt to subtract with overflow

failures:
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_selective_preserves_invariants
    tests::decay::decay_selective_q1_root_undecayed
    tests::decay::decay_selective_subtree_leaves_other_half_unchanged
    tests::decay::decay_selective_subtree_preserves_invariants
    tests::decay::decay_single_node_selective
    tests::decay::decay_then_extract_roundtrip
    tests::graph::get_semi_internal_depth_is_trimmed_depth
    tests::graph::gnode_depth_method_matches_free_function
    tests::gtree::depth_f64_half_n4

test result: FAILED. 312 passed; 34 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
