*** packages/mudlark/src/gtree.rs:71:27: replace - with / in gnode_depth_from_interval

*** mutation diff:
--- packages/mudlark/src/gtree.rs
+++ replace - with / in gnode_depth_from_interval
@@ -63,17 +63,17 @@
     // log2 of a power-of-two width. For integers this is exact;
     // for floats f64::log2 returns an exact integer for 2^k inputs.
     //
     // Cast via i32 (not u32) so that sub-unit float widths
     // (log2 < 0) produce depths > n instead of saturating to n.
     #[allow(clippy::cast_possible_truncation)]
     let log2_width = width_f64.log2() as i32;
     #[allow(clippy::cast_possible_wrap, clippy::cast_sign_loss)]
-    let depth = (n as i32 - log2_width) as u32;
+    let depth = (n as i32 / /* ~ changed by cargo-mutants ~ */ log2_width) as u32;
     depth
 }
 
 /// Recompute `sum = own + left.sum + right.sum` from `start` upward
 /// to the G-Tree root, directly reasserting G-I1 at each level.
 ///
 /// Used by `observe()` on the hot path instead of
 /// `propagate_g_sums` (moved to tests), avoiding the need for subtraction on

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (2320893) panicked at packages/mudlark/src/gtree.rs:71:17:
attempt to divide by zero

---- tests::decay::decay_energy_conservation_selective stdout ----

thread 'tests::decay::decay_energy_conservation_selective' (2320894) panicked at packages/mudlark/src/gtree.rs:71:17:
attempt to divide by zero

---- tests::decay::decay_energy_conservation_uniform stdout ----

thread 'tests::decay::decay_energy_conservation_uniform' (2320896) panicked at packages/mudlark/src/gtree.rs:71:17:
attempt to divide by zero

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 279 passed; 67 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
