*** packages/mudlark/src/invariants.rs:1040:29: replace || with && in contour_steps

*** mutation diff:
--- packages/mudlark/src/invariants.rs
+++ replace || with && in contour_steps
@@ -1032,17 +1032,17 @@
         }
     }
     cells.sort_by(|a, b| a.0.total_cmp(&b.0));
 
     // Extract step coordinates: position 0 is always a step; after
     // that, every depth change is a step.
     let mut steps: Vec<(C, u32)> = Vec::new();
     for &(lo, depth) in &cells {
-        if steps.is_empty() || steps.last().unwrap().1 != depth {
+        if steps.is_empty() && /* ~ changed by cargo-mutants ~ */ steps.last().unwrap().1 != depth {
             steps.push((lo, depth));
         }
     }
     steps
 }
 
 /// **P-I1(i): Keys = contour steps.**
 ///

---- tests::decay::decay_f64_tree stdout ----

thread 'tests::decay::decay_f64_tree' (3209339) panicked at packages/mudlark/src/invariants.rs:1040:80:
called `Option::unwrap()` on a `None` value

---- tests::decay::decay_amplification_above_one stdout ----

thread 'tests::decay::decay_amplification_above_one' (3209335) panicked at packages/mudlark/src/invariants.rs:1040:80:
called `Option::unwrap()` on a `None` value

---- tests::decay::decay_energy_conservation_selective stdout ----

thread 'tests::decay::decay_energy_conservation_selective' (3209337) panicked at packages/mudlark/src/invariants.rs:1040:80:
called `Option::unwrap()` on a `None` value

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 257 passed; 89 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
