*** packages/mudlark/src/invariants.rs:1040:56: replace != with == in contour_steps

*** mutation diff:
--- packages/mudlark/src/invariants.rs
+++ replace != with == in contour_steps
@@ -1032,17 +1032,17 @@
         }
     }
     cells.sort_by(|a, b| a.0.total_cmp(&b.0));
 
     // Extract step coordinates: position 0 is always a step; after
     // that, every depth change is a step.
     let mut steps: Vec<(C, u32)> = Vec::new();
     for &(lo, depth) in &cells {
-        if steps.is_empty() || steps.last().unwrap().1 != depth {
+        if steps.is_empty() || steps.last().unwrap().1 == /* ~ changed by cargo-mutants ~ */ depth {
             steps.push((lo, depth));
         }
     }
     steps
 }
 
 /// **P-I1(i): Keys = contour steps.**
 ///

---- tests::decay::decay_energy_conservation_selective stdout ----

thread 'tests::decay::decay_energy_conservation_selective' (3210002) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (3 total):
P-I1(i): plateau count (7) != contour step count (3)
P-I1(i): step 1: contour step at 8, BTreeMap key at 2
P-I1(i): step 2: contour step at 12, BTreeMap key at 4

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (3210001) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (3 total):
P-I1(i): plateau count (7) != contour step count (3)
P-I1(i): step 1: contour step at 8, BTreeMap key at 2
P-I1(i): step 2: contour step at 12, BTreeMap key at 4

---- tests::decay::decay_amplification_above_one stdout ----

thread 'tests::decay::decay_amplification_above_one' (3210000) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (3 total):
P-I1(i): plateau count (7) != contour step count (3)
P-I1(i): step 1: contour step at 8, BTreeMap key at 2
P-I1(i): step 2: contour step at 12, BTreeMap key at 4

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 265 passed; 81 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
