*** packages/mudlark/src/invariants.rs:1067:25: replace != with == in check_p_i1_i_keys_are_contour_steps

*** mutation diff:
--- packages/mudlark/src/invariants.rs
+++ replace != with == in check_p_i1_i_keys_are_contour_steps
@@ -1059,17 +1059,17 @@
         errors.push("P-I1(i): plateaus BTreeMap is empty (must have at least 1 plateau)".into());
         return;
     }
 
     let steps = contour_steps(graph);
     let btree_keys: Vec<C> = plateaus.keys().map(|k| k.0).collect();
     let step_coords: Vec<C> = steps.iter().map(|&(c, _)| c).collect();
 
-    if btree_keys.len() != step_coords.len() {
+    if btree_keys.len() == /* ~ changed by cargo-mutants ~ */ step_coords.len() {
         errors.push(format!(
             "P-I1(i): plateau count ({}) != contour step count ({})",
             btree_keys.len(),
             step_coords.len()
         ));
     }
 
     // Check each key matches and depth matches.

---- tests::decay::decay_energy_conservation_uniform stdout ----

thread 'tests::decay::decay_energy_conservation_uniform' (3214921) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
P-I1(i): plateau count (7) != contour step count (7)

---- tests::decay::decay_f64_tree stdout ----

thread 'tests::decay::decay_f64_tree' (3214922) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
P-I1(i): plateau count (6) != contour step count (6)

---- tests::decay::decay_panics_nan_q stdout ----

thread 'tests::decay::decay_panics_nan_q' (3214937) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
P-I1(i): plateau count (7) != contour step count (7)
note: panic did not contain expected string
      panic message: "Invariant violations (1 total):\nP-I1(i): plateau count (7) != contour step count (7)"
 expected substring: "q must be in"

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 257 passed; 89 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
