*** packages/mudlark/src/invariants.rs:1077:41: replace != with == in check_p_i1_i_keys_are_contour_steps

*** mutation diff:
--- packages/mudlark/src/invariants.rs
+++ replace != with == in check_p_i1_i_keys_are_contour_steps
@@ -1069,17 +1069,17 @@
             "P-I1(i): plateau count ({}) != contour step count ({})",
             btree_keys.len(),
             step_coords.len()
         ));
     }
 
     // Check each key matches and depth matches.
     for (i, (&(coord, depth), btree_coord)) in steps.iter().zip(btree_keys.iter()).enumerate() {
-        if coord.total_cmp(btree_coord) != std::cmp::Ordering::Equal {
+        if coord.total_cmp(btree_coord) == /* ~ changed by cargo-mutants ~ */ std::cmp::Ordering::Equal {
             errors.push(format!(
                 "P-I1(i): step {i}: contour step at {coord:?}, BTreeMap key at {btree_coord:?}"
             ));
         }
         // Also verify depth matches.
         if let Some(plateau) = plateaus.get(&BasisEdge(coord)) {
             if plateau.depth != depth {
                 errors.push(format!(

---- tests::decay::decay_multiple_selective_preserves_invariants stdout ----

thread 'tests::decay::decay_multiple_selective_preserves_invariants' (3217356) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (7 total):
P-I1(i): step 0: contour step at 0, BTreeMap key at 0
P-I1(i): step 1: contour step at 2, BTreeMap key at 2
P-I1(i): step 2: contour step at 4, BTreeMap key at 4
P-I1(i): step 3: contour step at 8, BTreeMap key at 8
P-I1(i): step 4: contour step at 10, BTreeMap key at 10
P-I1(i): step 5: contour step at 12, BTreeMap key at 12
P-I1(i): step 6: contour step at 14, BTreeMap key at 14

---- tests::decay::decay_panics_zero_attenuation stdout ----

thread 'tests::decay::decay_panics_zero_attenuation' (3217364) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (7 total):
P-I1(i): step 0: contour step at 0, BTreeMap key at 0
P-I1(i): step 1: contour step at 2, BTreeMap key at 2
P-I1(i): step 2: contour step at 4, BTreeMap key at 4
P-I1(i): step 3: contour step at 8, BTreeMap key at 8
P-I1(i): step 4: contour step at 10, BTreeMap key at 10
P-I1(i): step 5: contour step at 12, BTreeMap key at 12
P-I1(i): step 6: contour step at 14, BTreeMap key at 14
note: panic did not contain expected string
 expected substring: "attenuation must be > 0"

---- tests::decay::decay_panics_q_above_one stdout ----

thread 'tests::decay::decay_panics_q_above_one' (3217363) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (7 total):
P-I1(i): step 0: contour step at 0, BTreeMap key at 0
P-I1(i): step 1: contour step at 2, BTreeMap key at 2
P-I1(i): step 2: contour step at 4, BTreeMap key at 4
P-I1(i): step 3: contour step at 8, BTreeMap key at 8
P-I1(i): step 4: contour step at 10, BTreeMap key at 10
P-I1(i): step 5: contour step at 12, BTreeMap key at 12
P-I1(i): step 6: contour step at 14, BTreeMap key at 14
note: panic did not contain expected string
 expected substring: "q must be in"

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 257 passed; 89 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
