*** packages/mudlark/src/invariants.rs:1084:30: replace != with == in check_p_i1_i_keys_are_contour_steps

*** mutation diff:
--- packages/mudlark/src/invariants.rs
+++ replace != with == in check_p_i1_i_keys_are_contour_steps
@@ -1076,17 +1076,17 @@
     for (i, (&(coord, depth), btree_coord)) in steps.iter().zip(btree_keys.iter()).enumerate() {
         if coord.total_cmp(btree_coord) != std::cmp::Ordering::Equal {
             errors.push(format!(
                 "P-I1(i): step {i}: contour step at {coord:?}, BTreeMap key at {btree_coord:?}"
             ));
         }
         // Also verify depth matches.
         if let Some(plateau) = plateaus.get(&BasisEdge(coord)) {
-            if plateau.depth != depth {
+            if plateau.depth == /* ~ changed by cargo-mutants ~ */ depth {
                 errors.push(format!(
                     "P-I1(i): step {i} at {coord:?}: contour depth={depth}, plateau.depth={}",
                     plateau.depth
                 ));
             }
         }
     }

---- tests::decay::decay_noop_at_attenuation_one stdout ----

thread 'tests::decay::decay_noop_at_attenuation_one' (3219726) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (7 total):
P-I1(i): step 0 at 0: contour depth=3, plateau.depth=3
P-I1(i): step 1 at 2: contour depth=4, plateau.depth=4
P-I1(i): step 2 at 4: contour depth=2, plateau.depth=2
P-I1(i): step 3 at 8: contour depth=3, plateau.depth=3
P-I1(i): step 4 at 10: contour depth=4, plateau.depth=4
P-I1(i): step 5 at 12: contour depth=3, plateau.depth=3
P-I1(i): step 6 at 14: contour depth=4, plateau.depth=4

---- tests::decay::decay_panics_nan_q stdout ----

thread 'tests::decay::decay_panics_nan_q' (3219728) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (7 total):
P-I1(i): step 0 at 0: contour depth=3, plateau.depth=3
P-I1(i): step 1 at 2: contour depth=4, plateau.depth=4
P-I1(i): step 2 at 4: contour depth=2, plateau.depth=2
P-I1(i): step 3 at 8: contour depth=3, plateau.depth=3
P-I1(i): step 4 at 10: contour depth=4, plateau.depth=4
P-I1(i): step 5 at 12: contour depth=3, plateau.depth=3
P-I1(i): step 6 at 14: contour depth=4, plateau.depth=4
note: panic did not contain expected string
 expected substring: "q must be in"

---- tests::decay::decay_energy_conservation_selective stdout ----

thread 'tests::decay::decay_energy_conservation_selective' (3219721) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (7 total):
P-I1(i): step 0 at 0: contour depth=3, plateau.depth=3
P-I1(i): step 1 at 2: contour depth=4, plateau.depth=4
P-I1(i): step 2 at 4: contour depth=2, plateau.depth=2
P-I1(i): step 3 at 8: contour depth=3, plateau.depth=3
P-I1(i): step 4 at 10: contour depth=4, plateau.depth=4
P-I1(i): step 5 at 12: contour depth=3, plateau.depth=3
P-I1(i): step 6 at 14: contour depth=4, plateau.depth=4

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 257 passed; 89 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
