*** packages/mudlark/src/invariants.rs:1096:17: replace == with != in check_p_i1_i_keys_are_contour_steps

*** mutation diff:
--- packages/mudlark/src/invariants.rs
+++ replace == with != in check_p_i1_i_keys_are_contour_steps
@@ -1088,17 +1088,17 @@
                 ));
             }
         }
     }
 
     // Consecutive plateaus must have different depths (maximality).
     let depths: Vec<u32> = plateaus.values().map(|p| p.depth).collect();
     for w in depths.windows(2) {
-        if w[0] == w[1] {
+        if w[0] != /* ~ changed by cargo-mutants ~ */ w[1] {
             // Find the key for the second one.
             let keys: Vec<_> = plateaus.keys().collect();
             let idx = depths.windows(2).position(|d| d[0] == d[1]).unwrap();
             errors.push(format!(
                 "P-I1(i) maximality: consecutive plateaus {:?} and {:?} both have depth {}",
                 keys[idx],
                 keys[idx + 1],
                 w[0]

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (3223772) panicked at packages/mudlark/src/invariants.rs:1099:68:
called `Option::unwrap()` on a `None` value

---- tests::decay::decay_noop_at_attenuation_one stdout ----

thread 'tests::decay::decay_noop_at_attenuation_one' (3223778) panicked at packages/mudlark/src/invariants.rs:1099:68:
called `Option::unwrap()` on a `None` value

---- tests::decay::decay_panics_nan_attenuation stdout ----

thread 'tests::decay::decay_panics_nan_attenuation' (3223779) panicked at packages/mudlark/src/invariants.rs:1099:68:
called `Option::unwrap()` on a `None` value
note: panic did not contain expected string
      panic message: "called `Option::unwrap()` on a `None` value"
 expected substring: "attenuation must be > 0"

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 289 passed; 57 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
