*** packages/mudlark/src/invariants.rs:1125:35: replace < with == in check_p_i1_ii_tile_contiguity

*** mutation diff:
--- packages/mudlark/src/invariants.rs
+++ replace < with == in check_p_i1_ii_tile_contiguity
@@ -1117,17 +1117,17 @@
     errors: &mut Vec<String>,
 ) {
     let plateaus = &graph.plateaus;
     let pb = graph.plateau_basis();
     let keys: Vec<BasisEdge<C>> = plateaus.keys().copied().collect();
     let domain_max = C::domain_max(N);
 
     for (i, &key) in keys.iter().enumerate() {
-        let next_start = if i + 1 < keys.len() { keys[i + 1].0 } else { domain_max };
+        let next_start = if i + 1 == /* ~ changed by cargo-mutants ~ */ keys.len() { keys[i + 1].0 } else { domain_max };
 
         let elements = pb.basis_elements(&key);
         if elements.is_empty() {
             errors.push(format!("P-I1(ii): plateau {key:?} has no basis elements"));
             continue;
         }
 
         // Collect tile intervals and sort.

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (3231335) panicked at packages/mudlark/src/invariants.rs:1125:90:
index out of bounds: the len is 7 but the index is 7

---- tests::decay::decay_amplification_above_one stdout ----

thread 'tests::decay::decay_amplification_above_one' (3231334) panicked at packages/mudlark/src/invariants.rs:1125:90:
index out of bounds: the len is 7 but the index is 7

---- tests::decay::decay_energy_conservation_selective stdout ----

thread 'tests::decay::decay_energy_conservation_selective' (3231336) panicked at packages/mudlark/src/invariants.rs:1125:90:
index out of bounds: the len is 7 but the index is 7

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 257 passed; 89 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
