*** packages/mudlark/src/invariants.rs:1155:24: replace - with + in check_p_i1_ii_tile_contiguity

*** mutation diff:
--- packages/mudlark/src/invariants.rs
+++ replace - with + in check_p_i1_ii_tile_contiguity
@@ -1147,17 +1147,17 @@
         let expected_hi = next_start.to_f64();
 
         if tiles.is_empty() {
             errors.push(format!("P-I1(ii): plateau {key:?}: no live basis tiles"));
             continue;
         }
 
         // Check left boundary.
-        if (tiles[0].0 - expected_lo).abs() > 1e-12 {
+        if (tiles[0].0 + /* ~ changed by cargo-mutants ~ */ expected_lo).abs() > 1e-12 {
             errors.push(format!(
                 "P-I1(ii): plateau {key:?}: tile union starts at {}, expected {expected_lo}",
                 tiles[0].0
             ));
         }
 
         // Check right boundary.
         let last_hi = tiles.last().unwrap().1;

---- tests::decay::decay_energy_conservation_selective stdout ----

thread 'tests::decay::decay_energy_conservation_selective' (3268153) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (6 total):
P-I1(ii): plateau BasisEdge(2): tile union starts at 2, expected 2
P-I1(ii): plateau BasisEdge(4): tile union starts at 4, expected 4
P-I1(ii): plateau BasisEdge(8): tile union starts at 8, expected 8
P-I1(ii): plateau BasisEdge(10): tile union starts at 10, expected 10
P-I1(ii): plateau BasisEdge(12): tile union starts at 12, expected 12
P-I1(ii): plateau BasisEdge(14): tile union starts at 14, expected 14

---- tests::decay::decay_energy_conservation_uniform stdout ----

thread 'tests::decay::decay_energy_conservation_uniform' (3268154) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (6 total):
P-I1(ii): plateau BasisEdge(2): tile union starts at 2, expected 2
P-I1(ii): plateau BasisEdge(4): tile union starts at 4, expected 4
P-I1(ii): plateau BasisEdge(8): tile union starts at 8, expected 8
P-I1(ii): plateau BasisEdge(10): tile union starts at 10, expected 10
P-I1(ii): plateau BasisEdge(12): tile union starts at 12, expected 12
P-I1(ii): plateau BasisEdge(14): tile union starts at 14, expected 14

---- tests::decay::decay_f64_tree stdout ----

thread 'tests::decay::decay_f64_tree' (3268155) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (5 total):
P-I1(ii): plateau BasisEdge(2.0): tile union starts at 2, expected 2
P-I1(ii): plateau BasisEdge(3.0): tile union starts at 3, expected 3
P-I1(ii): plateau BasisEdge(4.0): tile union starts at 4, expected 4
P-I1(ii): plateau BasisEdge(8.0): tile union starts at 8, expected 8
P-I1(ii): plateau BasisEdge(12.0): tile union starts at 12, expected 12

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 289 passed; 57 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
