*** packages/mudlark/src/invariants.rs:1164:21: replace - with + in check_p_i1_ii_tile_contiguity

*** mutation diff:
--- packages/mudlark/src/invariants.rs
+++ replace - with + in check_p_i1_ii_tile_contiguity
@@ -1156,17 +1156,17 @@
             errors.push(format!(
                 "P-I1(ii): plateau {key:?}: tile union starts at {}, expected {expected_lo}",
                 tiles[0].0
             ));
         }
 
         // Check right boundary.
         let last_hi = tiles.last().unwrap().1;
-        if (last_hi - expected_hi).abs() > 1e-12 {
+        if (last_hi + /* ~ changed by cargo-mutants ~ */ expected_hi).abs() > 1e-12 {
             errors.push(format!(
                 "P-I1(ii): plateau {key:?}: tile union ends at {last_hi}, expected {expected_hi}"
             ));
         }
 
         // Check no internal gaps (tiles must be contiguous).
         for w in tiles.windows(2) {
             if w[1].0 - w[0].1 > 1e-12 {

---- tests::decay::decay_energy_conservation_selective stdout ----

thread 'tests::decay::decay_energy_conservation_selective' (3292801) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (7 total):
P-I1(ii): plateau BasisEdge(0): tile union ends at 2, expected 2
P-I1(ii): plateau BasisEdge(2): tile union ends at 4, expected 4
P-I1(ii): plateau BasisEdge(4): tile union ends at 8, expected 8
P-I1(ii): plateau BasisEdge(8): tile union ends at 10, expected 10
P-I1(ii): plateau BasisEdge(10): tile union ends at 12, expected 12
P-I1(ii): plateau BasisEdge(12): tile union ends at 14, expected 14
P-I1(ii): plateau BasisEdge(14): tile union ends at 16, expected 16

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (3292800) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (7 total):
P-I1(ii): plateau BasisEdge(0): tile union ends at 2, expected 2
P-I1(ii): plateau BasisEdge(2): tile union ends at 4, expected 4
P-I1(ii): plateau BasisEdge(4): tile union ends at 8, expected 8
P-I1(ii): plateau BasisEdge(8): tile union ends at 10, expected 10
P-I1(ii): plateau BasisEdge(10): tile union ends at 12, expected 12
P-I1(ii): plateau BasisEdge(12): tile union ends at 14, expected 14
P-I1(ii): plateau BasisEdge(14): tile union ends at 16, expected 16

---- tests::decay::decay_f64_tree stdout ----

thread 'tests::decay::decay_f64_tree' (3292803) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (6 total):
P-I1(ii): plateau BasisEdge(0.0): tile union ends at 2, expected 2
P-I1(ii): plateau BasisEdge(2.0): tile union ends at 3, expected 3
P-I1(ii): plateau BasisEdge(3.0): tile union ends at 4, expected 4
P-I1(ii): plateau BasisEdge(4.0): tile union ends at 8, expected 8
P-I1(ii): plateau BasisEdge(8.0): tile union ends at 12, expected 12
P-I1(ii): plateau BasisEdge(12.0): tile union ends at 16, expected 16

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 257 passed; 89 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
