*** packages/mudlark/src/invariants.rs:1164:42: replace > with >= in check_p_i1_ii_tile_contiguity

*** mutation diff:
--- packages/mudlark/src/invariants.rs
+++ replace > with >= in check_p_i1_ii_tile_contiguity
@@ -1156,17 +1156,17 @@
             errors.push(format!(
                 "P-I1(ii): plateau {key:?}: tile union starts at {}, expected {expected_lo}",
                 tiles[0].0
             ));
         }
 
         // Check right boundary.
         let last_hi = tiles.last().unwrap().1;
-        if (last_hi - expected_hi).abs() > 1e-12 {
+        if (last_hi - expected_hi).abs() >= /* ~ changed by cargo-mutants ~ */ 1e-12 {
             errors.push(format!(
                 "P-I1(ii): plateau {key:?}: tile union ends at {last_hi}, expected {expected_hi}"
             ));
         }
 
         // Check no internal gaps (tiles must be contiguous).
         for w in tiles.windows(2) {
             if w[1].0 - w[0].1 > 1e-12 {

*** result: Success
