*** packages/mudlark/src/invariants.rs:1172:23: replace - with / in check_p_i1_ii_tile_contiguity

*** mutation diff:
--- packages/mudlark/src/invariants.rs
+++ replace - with / in check_p_i1_ii_tile_contiguity
@@ -1164,17 +1164,17 @@
         if (last_hi - expected_hi).abs() > 1e-12 {
             errors.push(format!(
                 "P-I1(ii): plateau {key:?}: tile union ends at {last_hi}, expected {expected_hi}"
             ));
         }
 
         // Check no internal gaps (tiles must be contiguous).
         for w in tiles.windows(2) {
-            if w[1].0 - w[0].1 > 1e-12 {
+            if w[1].0 / /* ~ changed by cargo-mutants ~ */ w[0].1 > 1e-12 {
                 errors.push(format!(
                     "P-I1(ii): plateau {key:?}: gap in tiles between {} and {}",
                     w[0].1, w[1].0
                 ));
             }
         }
     }
 }

---- tests::decay_f64_depth::trace_f64_depth_inconsistency_step_by_step stdout ----

thread 'tests::decay_f64_depth::trace_f64_depth_inconsistency_step_by_step' (3319923) panicked at packages/mudlark/src/tests/decay_f64_depth.rs:178:13:
Invariant violation at step 7. See stderr for full diagnosis.

---- tests::diagnostic::plateau_sum_check_runs_without_tracing stdout ----

thread 'tests::diagnostic::plateau_sum_check_runs_without_tracing' (3319940) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
P-I1(ii): plateau BasisEdge(4): gap in tiles between 8 and 8

---- tests::graph::check_evictions_bounded_respects_limit stdout ----

thread 'tests::graph::check_evictions_bounded_respects_limit' (3319964) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
P-I1(ii): plateau BasisEdge(160): gap in tiles between 192 and 192

failures:
    tests::decay_f64_depth::trace_f64_depth_inconsistency_step_by_step
    tests::diagnostic::plateau_sum_check_runs_without_tracing
    tests::graph::check_evictions_bounded_respects_limit
    tests::graph::check_evictions_trailing_rebalance_clears_violations
    tests::graph::check_evictions_unbounded_evicts_all
    tests::graph::get_semi_internal_depth_is_trimmed_depth
    tests::graph::get_semi_internal_left_child_trims_right
    tests::graph::get_semi_internal_right_child_trims_left
    tests::observe::observe_invariants_hold_after_eviction_cycle
    tests::structural::get_all_terminals_covered
    tests::worked_example::step4_split_into_atomic_interval

test result: FAILED. 335 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
