*** packages/mudlark/src/invariants.rs:1198:31: replace + with * in check_p_i1_iii_run_contains_tile

*** mutation diff:
--- packages/mudlark/src/invariants.rs
+++ replace + with * in check_p_i1_iii_run_contains_tile
@@ -1190,17 +1190,17 @@
 ) {
     let plateaus = &graph.plateaus;
     let pb = graph.plateau_basis();
     let keys: Vec<BasisEdge<C>> = plateaus.keys().copied().collect();
     let domain_max = C::domain_max(N);
 
     for (i, &key) in keys.iter().enumerate() {
         let plateau = &plateaus[&key];
-        let next_start = if i + 1 < keys.len() { keys[i + 1].0 } else { domain_max };
+        let next_start = if i * /* ~ changed by cargo-mutants ~ */ 1 < keys.len() { keys[i + 1].0 } else { domain_max };
 
         let elements = pb.basis_elements(&key);
         if elements.is_empty() {
             continue; // Already caught by P-I1(ii).
         }
 
         // Compute run from basis spans.
         let mut min_lo = f64::INFINITY;

---- tests::decay::decay_panics_nan_q stdout ----

thread 'tests::decay::decay_panics_nan_q' (3334026) panicked at packages/mudlark/src/invariants.rs:1198:89:
index out of bounds: the len is 7 but the index is 7
note: panic did not contain expected string
      panic message: "index out of bounds: the len is 7 but the index is 7"
 expected substring: "q must be in"

---- tests::decay::decay_multiple_selective_preserves_invariants stdout ----

thread 'tests::decay::decay_multiple_selective_preserves_invariants' (3334022) panicked at packages/mudlark/src/invariants.rs:1198:89:
index out of bounds: the len is 7 but the index is 7

---- tests::decay::decay_f64_tree stdout ----

thread 'tests::decay::decay_f64_tree' (3334021) panicked at packages/mudlark/src/invariants.rs:1198:89:
index out of bounds: the len is 6 but the index is 6

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 257 passed; 89 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
