*** packages/mudlark/src/invariants.rs:1198:35: replace < with > in check_p_i1_iii_run_contains_tile

*** mutation diff:
--- packages/mudlark/src/invariants.rs
+++ replace < with > in check_p_i1_iii_run_contains_tile
@@ -1190,17 +1190,17 @@
 ) {
     let plateaus = &graph.plateaus;
     let pb = graph.plateau_basis();
     let keys: Vec<BasisEdge<C>> = plateaus.keys().copied().collect();
     let domain_max = C::domain_max(N);
 
     for (i, &key) in keys.iter().enumerate() {
         let plateau = &plateaus[&key];
-        let next_start = if i + 1 < keys.len() { keys[i + 1].0 } else { domain_max };
+        let next_start = if i + 1 > /* ~ changed by cargo-mutants ~ */ keys.len() { keys[i + 1].0 } else { domain_max };
 
         let elements = pb.basis_elements(&key);
         if elements.is_empty() {
             continue; // Already caught by P-I1(ii).
         }
 
         // Compute run from basis spans.
         let mut min_lo = f64::INFINITY;

---- tests::decay::decay_energy_conservation_selective stdout ----

thread 'tests::decay::decay_energy_conservation_selective' (3325854) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (6 total):
P-I1(iii): plateau BasisEdge(0): run end 2 < tile end 16
P-I1(iii): plateau BasisEdge(2): run end 4 < tile end 16
P-I1(iii): plateau BasisEdge(4): run end 8 < tile end 16
P-I1(iii): plateau BasisEdge(8): run end 10 < tile end 16
P-I1(iii): plateau BasisEdge(10): run end 12 < tile end 16
P-I1(iii): plateau BasisEdge(12): run end 14 < tile end 16

---- tests::decay::decay_amplification_above_one stdout ----

thread 'tests::decay::decay_amplification_above_one' (3325852) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (6 total):
P-I1(iii): plateau BasisEdge(0): run end 2 < tile end 16
P-I1(iii): plateau BasisEdge(2): run end 4 < tile end 16
P-I1(iii): plateau BasisEdge(4): run end 8 < tile end 16
P-I1(iii): plateau BasisEdge(8): run end 10 < tile end 16
P-I1(iii): plateau BasisEdge(10): run end 12 < tile end 16
P-I1(iii): plateau BasisEdge(12): run end 14 < tile end 16

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (3325853) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (6 total):
P-I1(iii): plateau BasisEdge(0): run end 2 < tile end 16
P-I1(iii): plateau BasisEdge(2): run end 4 < tile end 16
P-I1(iii): plateau BasisEdge(4): run end 8 < tile end 16
P-I1(iii): plateau BasisEdge(8): run end 10 < tile end 16
P-I1(iii): plateau BasisEdge(10): run end 12 < tile end 16
P-I1(iii): plateau BasisEdge(12): run end 14 < tile end 16

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 294 passed; 52 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
