*** packages/mudlark/src/invariants.rs:1209:16: delete ! in check_p_i1_iii_run_contains_tile

*** mutation diff:
--- packages/mudlark/src/invariants.rs
+++ delete ! in check_p_i1_iii_run_contains_tile
@@ -1201,17 +1201,17 @@
         if elements.is_empty() {
             continue; // Already caught by P-I1(ii).
         }
 
         // Compute run from basis spans.
         let mut min_lo = f64::INFINITY;
         let mut max_hi = f64::NEG_INFINITY;
         for &gid in elements {
-            if !graph.gnodes().is_occupied(gid.index()) {
+            if  /* ~ changed by cargo-mutants ~ */graph.gnodes().is_occupied(gid.index()) {
                 continue;
             }
             let g = graph.gnodes().get(gid.index());
             let lo = g.lo.to_f64();
             let hi = g.hi.to_f64();
             if lo < min_lo {
                 min_lo = lo;
             }

---- tests::decay::decay_multiple_selective_preserves_invariants stdout ----

thread 'tests::decay::decay_multiple_selective_preserves_invariants' (3342111) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (14 total):
P-I1(iii): plateau BasisEdge(0): start=0, expected min(basis.lo)=inf
P-I1(iii): plateau BasisEdge(0): end=2, expected max(basis.hi)=-inf
P-I1(iii): plateau BasisEdge(2): start=2, expected min(basis.lo)=inf
P-I1(iii): plateau BasisEdge(2): end=4, expected max(basis.hi)=-inf
P-I1(iii): plateau BasisEdge(4): start=4, expected min(basis.lo)=inf
P-I1(iii): plateau BasisEdge(4): end=8, expected max(basis.hi)=-inf
P-I1(iii): plateau BasisEdge(8): start=8, expected min(basis.lo)=inf
P-I1(iii): plateau BasisEdge(8): end=10, expected max(basis.hi)=-inf
P-I1(iii): plateau BasisEdge(10): start=10, expected min(basis.lo)=inf
P-I1(iii): plateau BasisEdge(10): end

---- tests::decay::decay_amplification_above_one stdout ----

thread 'tests::decay::decay_amplification_above_one' (3342106) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (14 total):
P-I1(iii): plateau BasisEdge(0): start=0, expected min(basis.lo)=inf
P-I1(iii): plateau BasisEdge(0): end=2, expected max(basis.hi)=-inf
P-I1(iii): plateau BasisEdge(2): start=2, expected min(basis.lo)=inf
P-I1(iii): plateau BasisEdge(2): end=4, expected max(basis.hi)=-inf
P-I1(iii): plateau BasisEdge(4): start=4, expected min(basis.lo)=inf
P-I1(iii): plateau BasisEdge(4): end=8, expected max(basis.hi)=-inf
P-I1(iii): plateau BasisEdge(8): start=8, expected min(basis.lo)=inf
P-I1(iii): plateau BasisEdge(8): end=10, expected max(basis.hi)=-inf
P-I1(iii): plateau BasisEdge(10): start=10, expected min(basis.lo)=inf
P-I1(iii): plateau BasisEdge(10): end=12, expected max(basis.hi)=-inf

---- tests::decay::decay_f64_tree stdout ----

thread 'tests::decay::decay_f64_tree' (3342110) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (12 total):
P-I1(iii): plateau BasisEdge(0.0): start=0, expected min(basis.lo)=inf
P-I1(iii): plateau BasisEdge(0.0): end=2, expected max(basis.hi)=-inf
P-I1(iii): plateau BasisEdge(2.0): start=2, expected min(basis.lo)=inf
P-I1(iii): plateau BasisEdge(2.0): end=3, expected max(basis.hi)=-inf
P-I1(iii): plateau BasisEdge(3.0): start=3, expected min(basis.lo)=inf
P-I1(iii): plateau BasisEdge(3.0): end=4, expected max(basis.hi)=-inf
P-I1(iii): plateau BasisEdge(4.0): start=4, expected min(basis.lo)=inf
P-I1(iii): plateau BasisEdge(4.0): end=8, expected max(basis.hi)=-inf
P-I1(iii): plateau BasisEdge(8.0): start=8, expected min(basis.lo)=inf
P-I1(iii): plateau BasisEdge(8.0): end=12, expected max(basis.hi)=-inf

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 257 passed; 89 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
