*** packages/mudlark/src/invariants.rs:1215:19: replace < with > in check_p_i1_iii_run_contains_tile

*** mutation diff:
--- packages/mudlark/src/invariants.rs
+++ replace < with > in check_p_i1_iii_run_contains_tile
@@ -1207,17 +1207,17 @@
         let mut max_hi = f64::NEG_INFINITY;
         for &gid in elements {
             if !graph.gnodes().is_occupied(gid.index()) {
                 continue;
             }
             let g = graph.gnodes().get(gid.index());
             let lo = g.lo.to_f64();
             let hi = g.hi.to_f64();
-            if lo < min_lo {
+            if lo > /* ~ changed by cargo-mutants ~ */ min_lo {
                 min_lo = lo;
             }
             if hi > max_hi {
                 max_hi = hi;
             }
         }
 
         // Verify plateau.start / plateau.end match basis span.

---- tests::decay::decay_multiple_uniform_preserves_invariants stdout ----

thread 'tests::decay::decay_multiple_uniform_preserves_invariants' (3351821) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (7 total):
P-I1(iii): plateau BasisEdge(0): start=0, expected min(basis.lo)=inf
P-I1(iii): plateau BasisEdge(2): start=2, expected min(basis.lo)=inf
P-I1(iii): plateau BasisEdge(4): start=4, expected min(basis.lo)=inf
P-I1(iii): plateau BasisEdge(8): start=8, expected min(basis.lo)=inf
P-I1(iii): plateau BasisEdge(10): start=10, expected min(basis.lo)=inf
P-I1(iii): plateau BasisEdge(12): start=12, expected min(basis.lo)=inf
P-I1(iii): plateau BasisEdge(14): start=14, expected min(basis.lo)=inf

---- tests::decay::decay_panics_nan_attenuation stdout ----

thread 'tests::decay::decay_panics_nan_attenuation' (3351823) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (7 total):
P-I1(iii): plateau BasisEdge(0): start=0, expected min(basis.lo)=inf
P-I1(iii): plateau BasisEdge(2): start=2, expected min(basis.lo)=inf
P-I1(iii): plateau BasisEdge(4): start=4, expected min(basis.lo)=inf
P-I1(iii): plateau BasisEdge(8): start=8, expected min(basis.lo)=inf
P-I1(iii): plateau BasisEdge(10): start=10, expected min(basis.lo)=inf
P-I1(iii): plateau BasisEdge(12): start=12, expected min(basis.lo)=inf
P-I1(iii): plateau BasisEdge(14): start=14, expected min(basis.lo)=inf
note: panic did not contain expected string
 expected substring: "attenuation must be > 0"

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (3351816) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (7 total):
P-I1(iii): plateau BasisEdge(0): start=0, expected min(basis.lo)=inf
P-I1(iii): plateau BasisEdge(2): start=2, expected min(basis.lo)=inf
P-I1(iii): plateau BasisEdge(4): start=4, expected min(basis.lo)=inf
P-I1(iii): plateau BasisEdge(8): start=8, expected min(basis.lo)=inf
P-I1(iii): plateau BasisEdge(10): start=10, expected min(basis.lo)=inf
P-I1(iii): plateau BasisEdge(12): start=12, expected min(basis.lo)=inf
P-I1(iii): plateau BasisEdge(14): start=14, expected min(basis.lo)=inf

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 257 passed; 89 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.11s

*** result: Failure(101)
