*** packages/mudlark/src/invariants.rs:1218:19: replace > with == in check_p_i1_iii_run_contains_tile

*** mutation diff:
--- packages/mudlark/src/invariants.rs
+++ replace > with == in check_p_i1_iii_run_contains_tile
@@ -1210,17 +1210,17 @@
                 continue;
             }
             let g = graph.gnodes().get(gid.index());
             let lo = g.lo.to_f64();
             let hi = g.hi.to_f64();
             if lo < min_lo {
                 min_lo = lo;
             }
-            if hi > max_hi {
+            if hi == /* ~ changed by cargo-mutants ~ */ max_hi {
                 max_hi = hi;
             }
         }
 
         // Verify plateau.start / plateau.end match basis span.
         let p_start = plateau.start.to_f64();
         let p_end = plateau.end.to_f64();
         if (p_start - min_lo).abs() > 1e-12 {

---- tests::decay::decay_amplification_above_one stdout ----

thread 'tests::decay::decay_amplification_above_one' (3358052) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (7 total):
P-I1(iii): plateau BasisEdge(0): end=2, expected max(basis.hi)=-inf
P-I1(iii): plateau BasisEdge(2): end=4, expected max(basis.hi)=-inf
P-I1(iii): plateau BasisEdge(4): end=8, expected max(basis.hi)=-inf
P-I1(iii): plateau BasisEdge(8): end=10, expected max(basis.hi)=-inf
P-I1(iii): plateau BasisEdge(10): end=12, expected max(basis.hi)=-inf
P-I1(iii): plateau BasisEdge(12): end=14, expected max(basis.hi)=-inf
P-I1(iii): plateau BasisEdge(14): end=16, expected max(basis.hi)=-inf

---- tests::decay::decay_f64_tree stdout ----

thread 'tests::decay::decay_f64_tree' (3358056) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (6 total):
P-I1(iii): plateau BasisEdge(0.0): end=2, expected max(basis.hi)=-inf
P-I1(iii): plateau BasisEdge(2.0): end=3, expected max(basis.hi)=-inf
P-I1(iii): plateau BasisEdge(3.0): end=4, expected max(basis.hi)=-inf
P-I1(iii): plateau BasisEdge(4.0): end=8, expected max(basis.hi)=-inf
P-I1(iii): plateau BasisEdge(8.0): end=12, expected max(basis.hi)=-inf
P-I1(iii): plateau BasisEdge(12.0): end=16, expected max(basis.hi)=-inf

---- tests::decay::decay_single_node_tree stdout ----

thread 'tests::decay::decay_single_node_tree' (3358077) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
P-I1(iii): plateau BasisEdge(0): end=16, expected max(basis.hi)=-inf

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 257 passed; 89 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
