*** packages/mudlark/src/invariants.rs:1226:21: replace - with / in check_p_i1_iii_run_contains_tile

*** mutation diff:
--- packages/mudlark/src/invariants.rs
+++ replace - with / in check_p_i1_iii_run_contains_tile
@@ -1218,17 +1218,17 @@
             if hi > max_hi {
                 max_hi = hi;
             }
         }
 
         // Verify plateau.start / plateau.end match basis span.
         let p_start = plateau.start.to_f64();
         let p_end = plateau.end.to_f64();
-        if (p_start - min_lo).abs() > 1e-12 {
+        if (p_start / /* ~ changed by cargo-mutants ~ */ min_lo).abs() > 1e-12 {
             errors.push(format!(
                 "P-I1(iii): plateau {key:?}: start={p_start}, expected min(basis.lo)={min_lo}"
             ));
         }
         if (p_end - max_hi).abs() > 1e-12 {
             errors.push(format!(
                 "P-I1(iii): plateau {key:?}: end={p_end}, expected max(basis.hi)={max_hi}"
             ));

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (3393595) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (6 total):
P-I1(iii): plateau BasisEdge(2): start=2, expected min(basis.lo)=2
P-I1(iii): plateau BasisEdge(4): start=4, expected min(basis.lo)=4
P-I1(iii): plateau BasisEdge(8): start=8, expected min(basis.lo)=8
P-I1(iii): plateau BasisEdge(10): start=10, expected min(basis.lo)=10
P-I1(iii): plateau BasisEdge(12): start=12, expected min(basis.lo)=12
P-I1(iii): plateau BasisEdge(14): start=14, expected min(basis.lo)=14

---- tests::decay::decay_energy_conservation_uniform stdout ----

thread 'tests::decay::decay_energy_conservation_uniform' (3393597) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (6 total):
P-I1(iii): plateau BasisEdge(2): start=2, expected min(basis.lo)=2
P-I1(iii): plateau BasisEdge(4): start=4, expected min(basis.lo)=4
P-I1(iii): plateau BasisEdge(8): start=8, expected min(basis.lo)=8
P-I1(iii): plateau BasisEdge(10): start=10, expected min(basis.lo)=10
P-I1(iii): plateau BasisEdge(12): start=12, expected min(basis.lo)=12
P-I1(iii): plateau BasisEdge(14): start=14, expected min(basis.lo)=14

---- tests::decay::decay_amplification_above_one stdout ----

thread 'tests::decay::decay_amplification_above_one' (3393594) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (6 total):
P-I1(iii): plateau BasisEdge(2): start=2, expected min(basis.lo)=2
P-I1(iii): plateau BasisEdge(4): start=4, expected min(basis.lo)=4
P-I1(iii): plateau BasisEdge(8): start=8, expected min(basis.lo)=8
P-I1(iii): plateau BasisEdge(10): start=10, expected min(basis.lo)=10
P-I1(iii): plateau BasisEdge(12): start=12, expected min(basis.lo)=12
P-I1(iii): plateau BasisEdge(14): start=14, expected min(basis.lo)=14

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 290 passed; 56 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
