*** packages/mudlark/src/invariants.rs:1231:19: replace - with / in check_p_i1_iii_run_contains_tile

*** mutation diff:
--- packages/mudlark/src/invariants.rs
+++ replace - with / in check_p_i1_iii_run_contains_tile
@@ -1223,17 +1223,17 @@
         // Verify plateau.start / plateau.end match basis span.
         let p_start = plateau.start.to_f64();
         let p_end = plateau.end.to_f64();
         if (p_start - min_lo).abs() > 1e-12 {
             errors.push(format!(
                 "P-I1(iii): plateau {key:?}: start={p_start}, expected min(basis.lo)={min_lo}"
             ));
         }
-        if (p_end - max_hi).abs() > 1e-12 {
+        if (p_end / /* ~ changed by cargo-mutants ~ */ max_hi).abs() > 1e-12 {
             errors.push(format!(
                 "P-I1(iii): plateau {key:?}: end={p_end}, expected max(basis.hi)={max_hi}"
             ));
         }
 
         // Verify run ⊇ tile range: [key, next_start).
         let tile_lo = key.0.to_f64();
         let tile_hi = next_start.to_f64();

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (3415366) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (7 total):
P-I1(iii): plateau BasisEdge(0): end=2, expected max(basis.hi)=2
P-I1(iii): plateau BasisEdge(2): end=4, expected max(basis.hi)=4
P-I1(iii): plateau BasisEdge(4): end=8, expected max(basis.hi)=8
P-I1(iii): plateau BasisEdge(8): end=10, expected max(basis.hi)=10
P-I1(iii): plateau BasisEdge(10): end=12, expected max(basis.hi)=12
P-I1(iii): plateau BasisEdge(12): end=14, expected max(basis.hi)=14
P-I1(iii): plateau BasisEdge(14): end=16, expected max(basis.hi)=16

---- tests::decay::decay_energy_conservation_selective stdout ----

thread 'tests::decay::decay_energy_conservation_selective' (3415367) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (7 total):
P-I1(iii): plateau BasisEdge(0): end=2, expected max(basis.hi)=2
P-I1(iii): plateau BasisEdge(2): end=4, expected max(basis.hi)=4
P-I1(iii): plateau BasisEdge(4): end=8, expected max(basis.hi)=8
P-I1(iii): plateau BasisEdge(8): end=10, expected max(basis.hi)=10
P-I1(iii): plateau BasisEdge(10): end=12, expected max(basis.hi)=12
P-I1(iii): plateau BasisEdge(12): end=14, expected max(basis.hi)=14
P-I1(iii): plateau BasisEdge(14): end=16, expected max(basis.hi)=16

---- tests::decay::decay_amplification_above_one stdout ----

thread 'tests::decay::decay_amplification_above_one' (3415365) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (7 total):
P-I1(iii): plateau BasisEdge(0): end=2, expected max(basis.hi)=2
P-I1(iii): plateau BasisEdge(2): end=4, expected max(basis.hi)=4
P-I1(iii): plateau BasisEdge(4): end=8, expected max(basis.hi)=8
P-I1(iii): plateau BasisEdge(8): end=10, expected max(basis.hi)=10
P-I1(iii): plateau BasisEdge(10): end=12, expected max(basis.hi)=12
P-I1(iii): plateau BasisEdge(12): end=14, expected max(basis.hi)=14
P-I1(iii): plateau BasisEdge(14): end=16, expected max(basis.hi)=16

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 257 passed; 89 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
