*** packages/mudlark/src/invariants.rs:1240:30: replace > with < in check_p_i1_iii_run_contains_tile

*** mutation diff:
--- packages/mudlark/src/invariants.rs
+++ replace > with < in check_p_i1_iii_run_contains_tile
@@ -1232,17 +1232,17 @@
             errors.push(format!(
                 "P-I1(iii): plateau {key:?}: end={p_end}, expected max(basis.hi)={max_hi}"
             ));
         }
 
         // Verify run ⊇ tile range: [key, next_start).
         let tile_lo = key.0.to_f64();
         let tile_hi = next_start.to_f64();
-        if p_start - tile_lo > 1e-12 {
+        if p_start - tile_lo < /* ~ changed by cargo-mutants ~ */ 1e-12 {
             errors.push(format!(
                 "P-I1(iii): plateau {key:?}: run start {p_start} > tile start {tile_lo}"
             ));
         }
         if tile_hi - p_end > 1e-12 {
             errors.push(format!("P-I1(iii): plateau {key:?}: run end {p_end} < tile end {tile_hi}"));
         }
     }

---- tests::decay::decay_amplification_above_one stdout ----

thread 'tests::decay::decay_amplification_above_one' (3422115) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (7 total):
P-I1(iii): plateau BasisEdge(0): run start 0 > tile start 0
P-I1(iii): plateau BasisEdge(2): run start 2 > tile start 2
P-I1(iii): plateau BasisEdge(4): run start 4 > tile start 4
P-I1(iii): plateau BasisEdge(8): run start 8 > tile start 8
P-I1(iii): plateau BasisEdge(10): run start 10 > tile start 10
P-I1(iii): plateau BasisEdge(12): run start 12 > tile start 12
P-I1(iii): plateau BasisEdge(14): run start 14 > tile start 14

---- tests::decay::decay_f64_tree stdout ----

thread 'tests::decay::decay_f64_tree' (3422119) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (6 total):
P-I1(iii): plateau BasisEdge(0.0): run start 0 > tile start 0
P-I1(iii): plateau BasisEdge(2.0): run start 2 > tile start 2
P-I1(iii): plateau BasisEdge(3.0): run start 3 > tile start 3
P-I1(iii): plateau BasisEdge(4.0): run start 4 > tile start 4
P-I1(iii): plateau BasisEdge(8.0): run start 8 > tile start 8
P-I1(iii): plateau BasisEdge(12.0): run start 12 > tile start 12

---- tests::decay::decay_energy_conservation_uniform stdout ----

thread 'tests::decay::decay_energy_conservation_uniform' (3422118) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (7 total):
P-I1(iii): plateau BasisEdge(0): run start 0 > tile start 0
P-I1(iii): plateau BasisEdge(2): run start 2 > tile start 2
P-I1(iii): plateau BasisEdge(4): run start 4 > tile start 4
P-I1(iii): plateau BasisEdge(8): run start 8 > tile start 8
P-I1(iii): plateau BasisEdge(10): run start 10 > tile start 10
P-I1(iii): plateau BasisEdge(12): run start 12 > tile start 12
P-I1(iii): plateau BasisEdge(14): run start 14 > tile start 14

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 257 passed; 89 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
