*** packages/mudlark/src/invariants.rs:1245:20: replace - with + in check_p_i1_iii_run_contains_tile

*** mutation diff:
--- packages/mudlark/src/invariants.rs
+++ replace - with + in check_p_i1_iii_run_contains_tile
@@ -1237,17 +1237,17 @@
         // Verify run ⊇ tile range: [key, next_start).
         let tile_lo = key.0.to_f64();
         let tile_hi = next_start.to_f64();
         if p_start - tile_lo > 1e-12 {
             errors.push(format!(
                 "P-I1(iii): plateau {key:?}: run start {p_start} > tile start {tile_lo}"
             ));
         }
-        if tile_hi - p_end > 1e-12 {
+        if tile_hi + /* ~ changed by cargo-mutants ~ */ p_end > 1e-12 {
             errors.push(format!("P-I1(iii): plateau {key:?}: run end {p_end} < tile end {tile_hi}"));
         }
     }
 }
 
 // ── P-I2: Minimal deterministic basis ──────────────────────────────
 
 /// Each basis element must be maximally consolidated: if an element's

---- tests::decay::decay_energy_conservation_selective stdout ----

thread 'tests::decay::decay_energy_conservation_selective' (3453976) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (7 total):
P-I1(iii): plateau BasisEdge(0): run end 2 < tile end 2
P-I1(iii): plateau BasisEdge(2): run end 4 < tile end 4
P-I1(iii): plateau BasisEdge(4): run end 8 < tile end 8
P-I1(iii): plateau BasisEdge(8): run end 10 < tile end 10
P-I1(iii): plateau BasisEdge(10): run end 12 < tile end 12
P-I1(iii): plateau BasisEdge(12): run end 14 < tile end 14
P-I1(iii): plateau BasisEdge(14): run end 16 < tile end 16

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (3453975) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (7 total):
P-I1(iii): plateau BasisEdge(0): run end 2 < tile end 2
P-I1(iii): plateau BasisEdge(2): run end 4 < tile end 4
P-I1(iii): plateau BasisEdge(4): run end 8 < tile end 8
P-I1(iii): plateau BasisEdge(8): run end 10 < tile end 10
P-I1(iii): plateau BasisEdge(10): run end 12 < tile end 12
P-I1(iii): plateau BasisEdge(12): run end 14 < tile end 14
P-I1(iii): plateau BasisEdge(14): run end 16 < tile end 16

---- tests::decay::decay_multiple_uniform_preserves_invariants stdout ----

thread 'tests::decay::decay_multiple_uniform_preserves_invariants' (3453980) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (7 total):
P-I1(iii): plateau BasisEdge(0): run end 2 < tile end 2
P-I1(iii): plateau BasisEdge(2): run end 4 < tile end 4
P-I1(iii): plateau BasisEdge(4): run end 8 < tile end 8
P-I1(iii): plateau BasisEdge(8): run end 10 < tile end 10
P-I1(iii): plateau BasisEdge(10): run end 12 < tile end 12
P-I1(iii): plateau BasisEdge(12): run end 14 < tile end 14
P-I1(iii): plateau BasisEdge(14): run end 16 < tile end 16

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 257 passed; 89 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
