*** packages/mudlark/src/invariants.rs:1245:28: replace > with >= in check_p_i1_iii_run_contains_tile

*** mutation diff:
--- packages/mudlark/src/invariants.rs
+++ replace > with >= in check_p_i1_iii_run_contains_tile
@@ -1237,17 +1237,17 @@
         // Verify run ⊇ tile range: [key, next_start).
         let tile_lo = key.0.to_f64();
         let tile_hi = next_start.to_f64();
         if p_start - tile_lo > 1e-12 {
             errors.push(format!(
                 "P-I1(iii): plateau {key:?}: run start {p_start} > tile start {tile_lo}"
             ));
         }
-        if tile_hi - p_end > 1e-12 {
+        if tile_hi - p_end >= /* ~ changed by cargo-mutants ~ */ 1e-12 {
             errors.push(format!("P-I1(iii): plateau {key:?}: run end {p_end} < tile end {tile_hi}"));
         }
     }
 }
 
 // ── P-I2: Minimal deterministic basis ──────────────────────────────
 
 /// Each basis element must be maximally consolidated: if an element's

*** result: Success
