*** packages/mudlark/src/invariants.rs:124:35: replace == with != in semi_internal_lineage

*** mutation diff:
--- packages/mudlark/src/invariants.rs
+++ replace == with != in semi_internal_lineage
@@ -116,17 +116,17 @@
     // Walk ancestors: for each, if THEY are a child of a semi-internal,
     // that means this node has an ancestor who is an SI-child.
     let mut cur = g.parent;
     let mut depth = 1; // 1=parent, 2=grandparent, etc.
     while let Some(anc_id) = cur {
         let anc = graph.gnodes().get(anc_id.index());
         if let Some(anc_parent_id) = anc.parent {
             let anc_parent = graph.gnodes().get(anc_parent_id.index());
-            if anc_parent.state() == GState::SemiInternal {
+            if anc_parent.state() != /* ~ changed by cargo-mutants ~ */ GState::SemiInternal {
                 parts.push(format!(
                     "{} is SI-child (G({}) under G({}))",
                     ancestor_name(depth),
                     anc_id.index(),
                     anc_parent_id.index()
                 ));
             }
         }

*** result: Success
