*** packages/mudlark/src/invariants.rs:1338:29: replace > with == in check_p_i3_basis_disjointness

*** mutation diff:
--- packages/mudlark/src/invariants.rs
+++ replace > with == in check_p_i3_basis_disjointness
@@ -1330,17 +1330,17 @@
             tiles.push((tlo.to_f64(), thi.to_f64(), key));
         }
     }
     tiles.sort_by(|a, b| a.0.total_cmp(&b.0).then_with(|| a.1.total_cmp(&b.1)));
 
     for w in tiles.windows(2) {
         let (lo1, hi1, k1) = &w[0];
         let (lo2, _hi2, k2) = &w[1];
-        if k1 != k2 && *hi1 > *lo2 + 1e-12 {
+        if k1 != k2 && *hi1 == /* ~ changed by cargo-mutants ~ */ *lo2 + 1e-12 {
             errors.push(format!(
                 "P-I3 tile disjointness: tile in plateau {k1:?} [{lo1}, {hi1}) \
                  overlaps tile in plateau {k2:?} [{lo2}, ..)"
             ));
         }
     }
 }

---- break_buffer_4_invariants_hold stdout ----

thread 'break_buffer_4_invariants_hold' (3492556) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
P-I3 tile disjointness: tile in plateau BasisEdge(0) [0, 32768) overlaps tile in plateau BasisEdge(32768) [32768, ..)

---- break_buffer_4_burst_inversion stdout ----

thread 'break_buffer_4_burst_inversion' (3492553) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (15 total):
P-I3 tile disjointness: tile in plateau BasisEdge(8192) [8192, 16384) overlaps tile in plateau BasisEdge(16384) [16384, ..)
P-I3 tile disjointness: tile in plateau BasisEdge(16384) [32768, 49152) overlaps tile in plateau BasisEdge(49152) [49152, ..)
P-I3 tile disjointness: tile in plateau BasisEdge(49152) [49152, 57344) overlaps tile in plateau BasisEdge(57344) [57344, ..)
P-I3 tile disjointness: tile in plateau BasisEdge(57344) [57344, 61440) overlaps tile in plateau BasisEdge(61440) [61440, ..)
P-I3 tile disjointness: tile in plateau BasisEdge(61440) [61440, 63488) overlaps tile in plateau BasisEdge(63488) [63488, ..)
P-I3 tile disjointness: tile in plateau BasisEdge(63488) [63488, 64512) overlaps tile i

---- break_buffer_4_staircase stdout ----

thread 'break_buffer_4_staircase' (3492559) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (39 total):
P-I3 tile disjointness: tile in plateau BasisEdge(15360) [15360, 16384) overlaps tile in plateau BasisEdge(16384) [16384, ..)
P-I3 tile disjointness: tile in plateau BasisEdge(16384) [16384, 18432) overlaps tile in plateau BasisEdge(18432) [18432, ..)
P-I3 tile disjointness: tile in plateau BasisEdge(18432) [18432, 19456) overlaps tile in plateau BasisEdge(19456) [19456, ..)
P-I3 tile disjointness: tile in plateau BasisEdge(19456) [19456, 19968) overlaps tile in plateau BasisEdge(19968) [19968, ..)
P-I3 tile disjointness: tile in plateau BasisEdge(19968) [19968, 20096) overlaps tile in plateau BasisEdge(20096) [20096, ..)
P-I3 tile disjointness: tile in plateau BasisEdge(20096) [20096, 20224) overlaps tile in plateau

failures:
    break_buffer_4_burst_inversion
    break_buffer_4_combined_assault
    break_buffer_4_hyper_escalation
    break_buffer_4_invariants_hold
    break_buffer_4_multi_front_battle
    break_buffer_4_staircase

test result: FAILED. 17 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.14s

*** result: Failure(101)
