*** packages/mudlark/src/invariants.rs:1338:36: replace + with * in check_p_i3_basis_disjointness

*** mutation diff:
--- packages/mudlark/src/invariants.rs
+++ replace + with * in check_p_i3_basis_disjointness
@@ -1330,17 +1330,17 @@
             tiles.push((tlo.to_f64(), thi.to_f64(), key));
         }
     }
     tiles.sort_by(|a, b| a.0.total_cmp(&b.0).then_with(|| a.1.total_cmp(&b.1)));
 
     for w in tiles.windows(2) {
         let (lo1, hi1, k1) = &w[0];
         let (lo2, _hi2, k2) = &w[1];
-        if k1 != k2 && *hi1 > *lo2 + 1e-12 {
+        if k1 != k2 && *hi1 > *lo2 * /* ~ changed by cargo-mutants ~ */ 1e-12 {
             errors.push(format!(
                 "P-I3 tile disjointness: tile in plateau {k1:?} [{lo1}, {hi1}) \
                  overlaps tile in plateau {k2:?} [{lo2}, ..)"
             ));
         }
     }
 }

---- tests::decay::decay_f64_tree stdout ----

thread 'tests::decay::decay_f64_tree' (3507020) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (5 total):
P-I3 tile disjointness: tile in plateau BasisEdge(0.0) [0, 2) overlaps tile in plateau BasisEdge(2.0) [2, ..)
P-I3 tile disjointness: tile in plateau BasisEdge(2.0) [2, 3) overlaps tile in plateau BasisEdge(3.0) [3, ..)
P-I3 tile disjointness: tile in plateau BasisEdge(3.0) [3, 4) overlaps tile in plateau BasisEdge(4.0) [4, ..)
P-I3 tile disjointness: tile in plateau BasisEdge(4.0) [4, 8) overlaps tile in plateau BasisEdge(8.0) [8, ..)
P-I3 tile disjointness: tile in plateau BasisEdge(8.0) [8, 12) overlaps tile in plateau BasisEdge(12.0) [12, ..)

---- tests::decay::decay_multiple_uniform_preserves_invariants stdout ----

thread 'tests::decay::decay_multiple_uniform_preserves_invariants' (3507022) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (6 total):
P-I3 tile disjointness: tile in plateau BasisEdge(0) [0, 2) overlaps tile in plateau BasisEdge(2) [2, ..)
P-I3 tile disjointness: tile in plateau BasisEdge(2) [2, 4) overlaps tile in plateau BasisEdge(4) [4, ..)
P-I3 tile disjointness: tile in plateau BasisEdge(4) [4, 8) overlaps tile in plateau BasisEdge(8) [8, ..)
P-I3 tile disjointness: tile in plateau BasisEdge(8) [8, 10) overlaps tile in plateau BasisEdge(10) [10, ..)
P-I3 tile disjointness: tile in plateau BasisEdge(10) [10, 12) overlaps tile in plateau BasisEdge(12) [12, ..)
P-I3 tile disjointness: tile in plateau BasisEdge(12) [12, 14) overlaps tile in plateau BasisEdge(14) [14, ..)

---- tests::decay::decay_noop_at_attenuation_one stdout ----

thread 'tests::decay::decay_noop_at_attenuation_one' (3507023) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (6 total):
P-I3 tile disjointness: tile in plateau BasisEdge(0) [0, 2) overlaps tile in plateau BasisEdge(2) [2, ..)
P-I3 tile disjointness: tile in plateau BasisEdge(2) [2, 4) overlaps tile in plateau BasisEdge(4) [4, ..)
P-I3 tile disjointness: tile in plateau BasisEdge(4) [4, 8) overlaps tile in plateau BasisEdge(8) [8, ..)
P-I3 tile disjointness: tile in plateau BasisEdge(8) [8, 10) overlaps tile in plateau BasisEdge(10) [10, ..)
P-I3 tile disjointness: tile in plateau BasisEdge(10) [10, 12) overlaps tile in plateau BasisEdge(12) [12, ..)
P-I3 tile disjointness: tile in plateau BasisEdge(12) [12, 14) overlaps tile in plateau BasisEdge(14) [14, ..)

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 289 passed; 57 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
