*** packages/mudlark/src/invariants.rs:134:15: replace += with -= in semi_internal_lineage

*** mutation diff:
--- packages/mudlark/src/invariants.rs
+++ replace += with -= in semi_internal_lineage
@@ -126,17 +126,17 @@
                     "{} is SI-child (G({}) under G({}))",
                     ancestor_name(depth),
                     anc_id.index(),
                     anc_parent_id.index()
                 ));
             }
         }
         cur = anc.parent;
-        depth += 1;
+        depth -= /* ~ changed by cargo-mutants ~ */ 1;
     }
 
     if parts.is_empty() {
         String::new()
     } else {
         format!("  [{}]", parts.join("; "))
     }
 }

---- debug_clean_accounting_after_budget_eviction stdout ----

thread 'debug_clean_accounting_after_budget_eviction' (2847599) panicked at packages/mudlark/src/invariants.rs:134:9:
attempt to subtract with overflow

---- debug_budget_burst_eviction stdout ----

thread 'debug_budget_burst_eviction' (2847598) panicked at packages/mudlark/src/invariants.rs:134:9:
attempt to subtract with overflow

---- debug_growth_pressure_relax_cycle stdout ----

thread 'debug_growth_pressure_relax_cycle' (2847601) panicked at packages/mudlark/src/invariants.rs:134:9:
attempt to subtract with overflow

failures:
    debug_budget_burst_eviction
    debug_clean_accounting_after_budget_eviction
    debug_energy_conserved_after_budget_evictions
    debug_growth_pressure_relax_cycle
    debug_semi_internal_routing_then_observe
    debug_semi_internal_routing_via_budget_eviction
    debug_semi_internal_surviving_child_unaffected

test result: FAILED. 0 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
