*** packages/mudlark/src/invariants.rs:1363:26: replace != with == in check_p_i4_thatch_one_hop

*** mutation diff:
--- packages/mudlark/src/invariants.rs
+++ replace != with == in check_p_i4_thatch_one_hop
@@ -1355,17 +1355,17 @@
 ) {
     let pb = graph.plateau_basis();
     for (&key, gnodes) in pb.iter() {
         for &gid in gnodes {
             if !graph.gnodes().is_occupied(gid.index()) {
                 continue;
             }
             let g = graph.gnodes().get(gid.index());
-            if g.state() != GState::SemiInternal {
+            if g.state() == /* ~ changed by cargo-mutants ~ */ GState::SemiInternal {
                 continue;
             }
 
             // Find the surviving child.
             let child = g.left.or(g.right);
             let Some(child_id) = child else {
                 errors.push(format!("P-I4: semi-internal {gid:?} in plateau {key:?} has no children"));
                 continue;

---- tests::decay::decay_f64_tree stdout ----

thread 'tests::decay::decay_f64_tree' (3514008) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (6 total):
P-I4: semi-internal GNodeId(8) in plateau BasisEdge(0.0) has no children
P-I4 thatch one-hop: semi-internal GNodeId(10) in plateau BasisEdge(2.0) thatches child GNodeId(14), but child's plateau key BasisEdge(2.0) == parent's
P-I4: semi-internal GNodeId(11) in plateau BasisEdge(3.0) has no children
P-I4: semi-internal GNodeId(5) in plateau BasisEdge(4.0) has no children
P-I4 thatch one-hop: semi-internal GNodeId(6) in plateau BasisEdge(8.0) thatches child GNodeId(12), but child's plateau key BasisEdge(8.0) == parent's
P-I4: semi-internal GNodeId(7) in plateau BasisEdge(12.0) has no children

---- tests::decay::decay_multiple_selective_preserves_invariants stdout ----

thread 'tests::decay::decay_multiple_selective_preserves_invariants' (3514009) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (7 total):
P-I4: semi-internal GNodeId(8) in plateau BasisEdge(0) has no children
P-I4 thatch one-hop: semi-internal GNodeId(9) in plateau BasisEdge(2) thatches child GNodeId(14), but child's plateau key BasisEdge(2) == parent's
P-I4: semi-internal GNodeId(7) in plateau BasisEdge(4) has no children
P-I4: semi-internal GNodeId(10) in plateau BasisEdge(8) has no children
P-I4 thatch one-hop: semi-internal GNodeId(11) in plateau BasisEdge(10) thatches child GNodeId(16), but child's plateau key BasisEdge(10) == parent's
P-I4: semi-internal GNodeId(12) in plateau BasisEdge(12) has no children
P-I4 thatch one-hop: semi-internal GNodeId(13) in plateau BasisEdge(14) th

---- tests::decay::decay_energy_conservation_uniform stdout ----

thread 'tests::decay::decay_energy_conservation_uniform' (3514007) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (7 total):
P-I4: semi-internal GNodeId(8) in plateau BasisEdge(0) has no children
P-I4 thatch one-hop: semi-internal GNodeId(9) in plateau BasisEdge(2) thatches child GNodeId(14), but child's plateau key BasisEdge(2) == parent's
P-I4: semi-internal GNodeId(7) in plateau BasisEdge(4) has no children
P-I4: semi-internal GNodeId(10) in plateau BasisEdge(8) has no children
P-I4 thatch one-hop: semi-internal GNodeId(11) in plateau BasisEdge(10) thatches child GNodeId(16), but child's plateau key BasisEdge(10) == parent's
P-I4: semi-internal GNodeId(12) in plateau BasisEdge(12) has no children
P-I4 thatch one-hop: semi-internal GNodeId(13) in plateau BasisEdge(14) thatches child GNodeId(18)

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 257 passed; 89 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
