*** packages/mudlark/src/invariants.rs:1384:29: replace match guard ck == key with true in check_p_i4_thatch_one_hop

*** mutation diff:
--- packages/mudlark/src/invariants.rs
+++ replace match guard ck == key with true in check_p_i4_thatch_one_hop
@@ -1376,17 +1376,17 @@
             let child_g = graph.gnodes().get(child_id.index());
             let child_lo = child_g.lo;
 
             // Route through the BTreeMap to find which plateau covers
             // child.lo.
             let child_plateau_key = graph.plateaus.range(..=BasisEdge(child_lo)).next_back().map(|(&k, _)| k);
 
             match child_plateau_key {
-                Some(ck) if ck == key => {
+                Some(ck) if true /* ~ changed by cargo-mutants ~ */ => {
                     errors.push(format!(
                         "P-I4 thatch one-hop: semi-internal {gid:?} in plateau {key:?} \
                          thatches child {child_id:?}, but child's plateau key {ck:?} == parent's"
                     ));
                 }
                 None => {
                     errors.push(format!(
                         "P-I4 thatch one-hop: semi-internal {gid:?} in plateau {key:?}: \

---- tests::evict::evict_after_observations_conserves_energy stdout ----

thread 'tests::evict::evict_after_observations_conserves_energy' (3518845) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
P-I4 thatch one-hop: semi-internal GNodeId(1) in plateau BasisEdge(0) thatches child GNodeId(3), but child's plateau key BasisEdge(8) == parent's

---- tests::evict::evict_both_children_makes_parent_terminal stdout ----

thread 'tests::evict::evict_both_children_makes_parent_terminal' (3518846) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
P-I4 thatch one-hop: semi-internal GNodeId(1) in plateau BasisEdge(0) thatches child GNodeId(3), but child's plateau key BasisEdge(8) == parent's

---- tests::evict::evict_single_terminal_child stdout ----

thread 'tests::evict::evict_single_terminal_child' (3518847) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
P-I4 thatch one-hop: semi-internal GNodeId(1) in plateau BasisEdge(0) thatches child GNodeId(3), but child's plateau key BasisEdge(8) == parent's

failures:
    tests::evict::evict_after_observations_conserves_energy
    tests::evict::evict_both_children_makes_parent_terminal
    tests::evict::evict_single_terminal_child
    tests::evict::evict_to_semi_internal_creates_thatch
    tests::evict::evict_to_terminal_destroys_thatch
    tests::graph::check_evictions_bounded_respects_limit
    tests::graph::check_evictions_trailing_rebalance_clears_violations
    tests::graph::check_evictions_unbounded_evicts_all
    tests::graph::get_semi_internal_depth_is_trimmed_depth
    tests::graph::get_semi_internal_left_child_trims_right
    tests::graph::get_semi_internal_right_child_trims_left
    tests::observe::observe_invariants_hold_after_eviction_cycle

test result: FAILED. 331 passed; 15 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
