*** packages/mudlark/src/invariants.rs:1433:20: delete ! in check_p_i5_thatch_depth

*** mutation diff:
--- packages/mudlark/src/invariants.rs
+++ delete ! in check_p_i5_thatch_depth
@@ -1425,17 +1425,17 @@
     samples.dedup_by(|a, b| a.total_cmp(b) == std::cmp::Ordering::Equal);
 
     for x in &samples {
         // Count thatch depth: how many plateaus have a basis element
         // whose [lo, hi) contains x.
         let mut thatch_count = 0u32;
         for (&_key, gnodes) in pb.iter() {
             let covers = gnodes.iter().any(|&gid| {
-                if !graph.gnodes().is_occupied(gid.index()) {
+                if  /* ~ changed by cargo-mutants ~ */graph.gnodes().is_occupied(gid.index()) {
                     return false;
                 }
                 let g = graph.gnodes().get(gid.index());
                 g.lo.total_cmp(x) != std::cmp::Ordering::Greater && x.total_cmp(&g.hi) == std::cmp::Ordering::Less
             });
             if covers {
                 thatch_count += 1;
             }

*** result: Success
