*** packages/mudlark/src/invariants.rs:1437:35: replace != with == in check_p_i5_thatch_depth

*** mutation diff:
--- packages/mudlark/src/invariants.rs
+++ replace != with == in check_p_i5_thatch_depth
@@ -1429,17 +1429,17 @@
         // whose [lo, hi) contains x.
         let mut thatch_count = 0u32;
         for (&_key, gnodes) in pb.iter() {
             let covers = gnodes.iter().any(|&gid| {
                 if !graph.gnodes().is_occupied(gid.index()) {
                     return false;
                 }
                 let g = graph.gnodes().get(gid.index());
-                g.lo.total_cmp(x) != std::cmp::Ordering::Greater && x.total_cmp(&g.hi) == std::cmp::Ordering::Less
+                g.lo.total_cmp(x) == /* ~ changed by cargo-mutants ~ */ std::cmp::Ordering::Greater && x.total_cmp(&g.hi) == std::cmp::Ordering::Less
             });
             if covers {
                 thatch_count += 1;
             }
         }
 
         // Compute d_geo(x) by routing from root to the terminal.
         let d_geo = route_to_depth(graph, *x);

---- tests::decay::decay_f64_tree stdout ----

thread 'tests::decay::decay_f64_tree' (3542301) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
P-I5 thatch depth: at x=0.0, thatch_depth=5 > d_geo=3 + 1

---- tests::decay::decay_multiple_selective_preserves_invariants stdout ----

thread 'tests::decay::decay_multiple_selective_preserves_invariants' (3542302) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (2 total):
P-I5 thatch depth: at x=0, thatch_depth=6 > d_geo=3 + 1
P-I5 thatch depth: at x=4, thatch_depth=4 > d_geo=2 + 1

---- tests::decay::decay_energy_conservation_uniform stdout ----

thread 'tests::decay::decay_energy_conservation_uniform' (3542300) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (2 total):
P-I5 thatch depth: at x=0, thatch_depth=6 > d_geo=3 + 1
P-I5 thatch depth: at x=4, thatch_depth=4 > d_geo=2 + 1

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 317 passed; 29 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.12s

*** result: Failure(101)
