*** packages/mudlark/src/invariants.rs:1440:30: replace += with -= in check_p_i5_thatch_depth

*** mutation diff:
--- packages/mudlark/src/invariants.rs
+++ replace += with -= in check_p_i5_thatch_depth
@@ -1432,17 +1432,17 @@
             let covers = gnodes.iter().any(|&gid| {
                 if !graph.gnodes().is_occupied(gid.index()) {
                     return false;
                 }
                 let g = graph.gnodes().get(gid.index());
                 g.lo.total_cmp(x) != std::cmp::Ordering::Greater && x.total_cmp(&g.hi) == std::cmp::Ordering::Less
             });
             if covers {
-                thatch_count += 1;
+                thatch_count -= /* ~ changed by cargo-mutants ~ */ 1;
             }
         }
 
         // Compute d_geo(x) by routing from root to the terminal.
         let d_geo = route_to_depth(graph, *x);
 
         if thatch_count > d_geo + 1 {
             errors.push(format!(

---- tests::decay::decay_energy_conservation_uniform stdout ----

thread 'tests::decay::decay_energy_conservation_uniform' (3553212) panicked at packages/mudlark/src/invariants.rs:1440:17:
attempt to subtract with overflow

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (3553210) panicked at packages/mudlark/src/invariants.rs:1440:17:
attempt to subtract with overflow

---- tests::decay::decay_f64_tree stdout ----

thread 'tests::decay::decay_f64_tree' (3553213) panicked at packages/mudlark/src/invariants.rs:1440:17:
attempt to subtract with overflow

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 257 passed; 89 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
