*** packages/mudlark/src/invariants.rs:1447:25: replace > with < in check_p_i5_thatch_depth

*** mutation diff:
--- packages/mudlark/src/invariants.rs
+++ replace > with < in check_p_i5_thatch_depth
@@ -1439,17 +1439,17 @@
             if covers {
                 thatch_count += 1;
             }
         }
 
         // Compute d_geo(x) by routing from root to the terminal.
         let d_geo = route_to_depth(graph, *x);
 
-        if thatch_count > d_geo + 1 {
+        if thatch_count < /* ~ changed by cargo-mutants ~ */ d_geo + 1 {
             errors.push(format!(
                 "P-I5 thatch depth: at x={x:?}, thatch_depth={thatch_count} > d_geo={d_geo} + 1"
             ));
         }
     }
 }
 
 /// Route from G-root to the terminal containing `x`, returning its

---- tests::decay::decay_energy_conservation_uniform stdout ----

thread 'tests::decay::decay_energy_conservation_uniform' (3565310) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (7 total):
P-I5 thatch depth: at x=0, thatch_depth=1 > d_geo=3 + 1
P-I5 thatch depth: at x=2, thatch_depth=1 > d_geo=4 + 1
P-I5 thatch depth: at x=4, thatch_depth=1 > d_geo=2 + 1
P-I5 thatch depth: at x=8, thatch_depth=1 > d_geo=3 + 1
P-I5 thatch depth: at x=10, thatch_depth=1 > d_geo=4 + 1
P-I5 thatch depth: at x=12, thatch_depth=1 > d_geo=3 + 1
P-I5 thatch depth: at x=14, thatch_depth=1 > d_geo=4 + 1

---- tests::decay::decay_energy_conservation_selective stdout ----

thread 'tests::decay::decay_energy_conservation_selective' (3565308) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (7 total):
P-I5 thatch depth: at x=0, thatch_depth=1 > d_geo=3 + 1
P-I5 thatch depth: at x=2, thatch_depth=1 > d_geo=4 + 1
P-I5 thatch depth: at x=4, thatch_depth=1 > d_geo=2 + 1
P-I5 thatch depth: at x=8, thatch_depth=1 > d_geo=3 + 1
P-I5 thatch depth: at x=10, thatch_depth=1 > d_geo=4 + 1
P-I5 thatch depth: at x=12, thatch_depth=1 > d_geo=3 + 1
P-I5 thatch depth: at x=14, thatch_depth=1 > d_geo=4 + 1

---- tests::decay::decay_amplification_above_one stdout ----

thread 'tests::decay::decay_amplification_above_one' (3565306) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (7 total):
P-I5 thatch depth: at x=0, thatch_depth=1 > d_geo=3 + 1
P-I5 thatch depth: at x=2, thatch_depth=1 > d_geo=4 + 1
P-I5 thatch depth: at x=4, thatch_depth=1 > d_geo=2 + 1
P-I5 thatch depth: at x=8, thatch_depth=1 > d_geo=3 + 1
P-I5 thatch depth: at x=10, thatch_depth=1 > d_geo=4 + 1
P-I5 thatch depth: at x=12, thatch_depth=1 > d_geo=3 + 1
P-I5 thatch depth: at x=14, thatch_depth=1 > d_geo=4 + 1

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 266 passed; 80 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
