*** packages/mudlark/src/invariants.rs:1447:25: replace > with >= in check_p_i5_thatch_depth

*** mutation diff:
--- packages/mudlark/src/invariants.rs
+++ replace > with >= in check_p_i5_thatch_depth
@@ -1439,17 +1439,17 @@
             if covers {
                 thatch_count += 1;
             }
         }
 
         // Compute d_geo(x) by routing from root to the terminal.
         let d_geo = route_to_depth(graph, *x);
 
-        if thatch_count > d_geo + 1 {
+        if thatch_count >= /* ~ changed by cargo-mutants ~ */ d_geo + 1 {
             errors.push(format!(
                 "P-I5 thatch depth: at x={x:?}, thatch_depth={thatch_count} > d_geo={d_geo} + 1"
             ));
         }
     }
 }
 
 /// Route from G-root to the terminal containing `x`, returning its

---- tests::decay::decay_single_node_selective stdout ----

thread 'tests::decay::decay_single_node_selective' (3566344) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
P-I5 thatch depth: at x=0, thatch_depth=1 > d_geo=0 + 1

---- tests::evict::evict_single_terminal_child stdout ----

thread 'tests::evict::evict_single_terminal_child' (3566379) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (2 total):
P-I5 thatch depth: at x=0, thatch_depth=1 > d_geo=0 + 1
P-I5 thatch depth: at x=8, thatch_depth=2 > d_geo=1 + 1

---- tests::evict::evict_after_observations_conserves_energy stdout ----

thread 'tests::evict::evict_after_observations_conserves_energy' (3566377) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (2 total):
P-I5 thatch depth: at x=0, thatch_depth=1 > d_geo=0 + 1
P-I5 thatch depth: at x=8, thatch_depth=2 > d_geo=1 + 1

failures:
    tests::decay::decay_single_node_selective
    tests::decay::decay_single_node_tree
    tests::evict::evict_after_observations_conserves_energy
    tests::evict::evict_both_children_makes_parent_terminal
    tests::evict::evict_single_terminal_child
    tests::evict::evict_to_semi_internal_creates_thatch
    tests::evict::evict_to_terminal_destroys_thatch
    tests::observe::observe_accumulates_additively
    tests::observe::observe_accumulates_own
    tests::observe::observe_invariants_hold_after_eviction_cycle
    tests::observe::observe_no_split_below_threshold
    tests::observe::observe_updates_plateau_sum

test result: FAILED. 331 passed; 15 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
