*** packages/mudlark/src/invariants.rs:1447:33: replace + with - in check_p_i5_thatch_depth

*** mutation diff:
--- packages/mudlark/src/invariants.rs
+++ replace + with - in check_p_i5_thatch_depth
@@ -1439,17 +1439,17 @@
             if covers {
                 thatch_count += 1;
             }
         }
 
         // Compute d_geo(x) by routing from root to the terminal.
         let d_geo = route_to_depth(graph, *x);
 
-        if thatch_count > d_geo + 1 {
+        if thatch_count > d_geo - /* ~ changed by cargo-mutants ~ */ 1 {
             errors.push(format!(
                 "P-I5 thatch depth: at x={x:?}, thatch_depth={thatch_count} > d_geo={d_geo} + 1"
             ));
         }
     }
 }
 
 /// Route from G-root to the terminal containing `x`, returning its

---- tests::decay::decay_single_node_selective stdout ----

thread 'tests::decay::decay_single_node_selective' (3573565) panicked at packages/mudlark/src/invariants.rs:1447:27:
attempt to subtract with overflow

---- tests::decay::decay_single_node_tree stdout ----

thread 'tests::decay::decay_single_node_tree' (3573566) panicked at packages/mudlark/src/invariants.rs:1447:27:
attempt to subtract with overflow

---- tests::diagnostic::catalytic_split_creates_span stdout ----

thread 'tests::diagnostic::catalytic_split_creates_span' (3573580) panicked at packages/mudlark/src/tests/diagnostic.rs:310:5:
expected 'catalytic_split' span in: ["bootstrap_split", "plateau_after_bootstrap_split"]

failures:
    tests::decay::decay_single_node_selective
    tests::decay::decay_single_node_tree
    tests::decay_f64_depth::minimal_f64_depth_saturation
    tests::decay_f64_depth::trace_f64_depth_inconsistency_step_by_step
    tests::diagnostic::catalytic_split_creates_span
    tests::evict::evict_after_observations_conserves_energy
    tests::evict::evict_both_children_makes_parent_terminal
    tests::evict::evict_single_terminal_child
    tests::evict::evict_to_semi_internal_creates_thatch
    tests::evict::evict_to_terminal_destroys_thatch
    tests::evict::no_candidates_when_within_d_evict
    tests::graph::check_evictions_noop_when_none_eligible

test result: FAILED. 297 passed; 49 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
