*** packages/mudlark/src/invariants.rs:1466:41: replace == with != in route_to_depth

*** mutation diff:
--- packages/mudlark/src/invariants.rs
+++ replace == with != in route_to_depth
@@ -1458,17 +1458,17 @@
 fn route_to_depth<C: Coordinate, V: Accumulator + Inspectable, const N: u32>(graph: &GvGraph<C, V, N>, x: C) -> u32 {
     let mut cur = graph.g_root();
     for _ in 0..=N + 1 {
         let g = graph.gnodes().get(cur.index());
         if g.is_terminal() {
             return gnode_depth_from_interval(g.lo, g.hi, N);
         }
         let mid = C::midpoint(g.lo, g.hi);
-        let next = if x.total_cmp(&mid) == std::cmp::Ordering::Less {
+        let next = if x.total_cmp(&mid) != /* ~ changed by cargo-mutants ~ */ std::cmp::Ordering::Less {
             g.left
         } else {
             g.right
         };
         match next {
             Some(child) => cur = child,
             None => return gnode_depth_from_interval(g.lo, g.hi, N),
         }

---- tests::evict::evict_after_observations_conserves_energy stdout ----

thread 'tests::evict::evict_after_observations_conserves_energy' (3587680) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
P-I5 thatch depth: at x=8, thatch_depth=2 > d_geo=0 + 1

---- tests::evict::evict_both_children_makes_parent_terminal stdout ----

thread 'tests::evict::evict_both_children_makes_parent_terminal' (3587681) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
P-I5 thatch depth: at x=8, thatch_depth=2 > d_geo=0 + 1

---- tests::evict::evict_single_terminal_child stdout ----

thread 'tests::evict::evict_single_terminal_child' (3587682) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
P-I5 thatch depth: at x=8, thatch_depth=2 > d_geo=0 + 1

failures:
    tests::evict::evict_after_observations_conserves_energy
    tests::evict::evict_both_children_makes_parent_terminal
    tests::evict::evict_single_terminal_child
    tests::evict::evict_to_semi_internal_creates_thatch
    tests::evict::evict_to_terminal_destroys_thatch
    tests::observe::observe_invariants_hold_after_eviction_cycle
    tests::observe::observe_violations_empty_after_eviction
    tests::structural::semi_internal_surviving_child_unaffected

test result: FAILED. 338 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
