*** packages/mudlark/src/invariants.rs:350:46: replace + with - in check_g_i1_summation

*** mutation diff:
--- packages/mudlark/src/invariants.rs
+++ replace + with - in check_g_i1_summation
@@ -342,17 +342,17 @@
 
 fn check_g_i1_summation<C: Coordinate, V: Accumulator + Inspectable, const N: u32>(
     graph: &GvGraph<C, V, N>,
     errors: &mut Vec<String>,
 ) {
     for (idx, g) in graph.gnodes().iter_occupied() {
         let left_sum = g.left.map_or(0.0, |l| graph.gnodes().get(l.index()).sum.to_f64_approx());
         let right_sum = g.right.map_or(0.0, |r| graph.gnodes().get(r.index()).sum.to_f64_approx());
-        let expected = g.own.to_f64_approx() + left_sum + right_sum;
+        let expected = g.own.to_f64_approx() - /* ~ changed by cargo-mutants ~ */ left_sum + right_sum;
         let actual = g.sum.to_f64_approx();
         if (expected - actual).abs() > 1e-9 {
             errors.push(format!(
                 "G-I1 violated at G-node {idx}: expected sum={expected}, actual sum={actual} \
                  (own={}, left_sum={left_sum}, right_sum={right_sum})",
                 g.own.to_f64_approx()
             ));
         }

---- tests::decay::decay_amplification_above_one stdout ----

thread 'tests::decay::decay_amplification_above_one' (2902764) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (6 total):
G-I1 violated at G-node 0: expected sum=0, actual sum=180 (own=10, left_sum=90, right_sum=80)
G-I1 violated at G-node 1: expected sum=-70, actual sum=90 (own=10, left_sum=80, right_sum=0)
G-I1 violated at G-node 2: expected sum=-10, actual sum=80 (own=8, left_sum=45, right_sum=27)
G-I1 violated at G-node 8: expected sum=-10, actual sum=70 (own=30, left_sum=40, right_sum=0)
G-I1 violated at G-node 10: expected sum=5, actual sum=35 (own=20, left_sum=15, right_sum=0)
G-I1 violated at G-node 12: expected sum=3, actual sum=21 (own=12, left_sum=9, right_sum=0)

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (2902765) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (6 total):
G-I1 violated at G-node 0: expected sum=0, actual sum=180 (own=10, left_sum=90, right_sum=80)
G-I1 violated at G-node 1: expected sum=-70, actual sum=90 (own=10, left_sum=80, right_sum=0)
G-I1 violated at G-node 2: expected sum=-10, actual sum=80 (own=8, left_sum=45, right_sum=27)
G-I1 violated at G-node 8: expected sum=-10, actual sum=70 (own=30, left_sum=40, right_sum=0)
G-I1 violated at G-node 10: expected sum=5, actual sum=35 (own=20, left_sum=15, right_sum=0)
G-I1 violated at G-node 12: expected sum=3, actual sum=21 (own=12, left_sum=9, right_sum=0)

---- tests::decay::decay_energy_conservation_selective stdout ----

thread 'tests::decay::decay_energy_conservation_selective' (2902766) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (6 total):
G-I1 violated at G-node 0: expected sum=0, actual sum=180 (own=10, left_sum=90, right_sum=80)
G-I1 violated at G-node 1: expected sum=-70, actual sum=90 (own=10, left_sum=80, right_sum=0)
G-I1 violated at G-node 2: expected sum=-10, actual sum=80 (own=8, left_sum=45, right_sum=27)
G-I1 violated at G-node 8: expected sum=-10, actual sum=70 (own=30, left_sum=40, right_sum=0)
G-I1 violated at G-node 10: expected sum=5, actual sum=35 (own=20, left_sum=15, right_sum=0)
G-I1 violated at G-node 12: expected sum=3, actual sum=21 (own=12, left_sum=9, right_sum=0)

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 280 passed; 66 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
