*** packages/mudlark/src/invariants.rs:369:51: replace + with - in check_g_i2_variable_fanout

*** mutation diff:
--- packages/mudlark/src/invariants.rs
+++ replace + with - in check_g_i2_variable_fanout
@@ -361,17 +361,17 @@
 
 // ── G-I2: Variable fanout ───────────────────────────────────────────
 
 fn check_g_i2_variable_fanout<C: Coordinate, V: Accumulator + Inspectable, const N: u32>(
     graph: &GvGraph<C, V, N>,
     errors: &mut Vec<String>,
 ) {
     for (idx, g) in graph.gnodes().iter_occupied() {
-        let count = usize::from(g.left.is_some()) + usize::from(g.right.is_some());
+        let count = usize::from(g.left.is_some()) - /* ~ changed by cargo-mutants ~ */ usize::from(g.right.is_some());
         if count > 2 {
             errors.push(format!("G-I2 violated at G-node {idx}: {count} children (max 2)"));
         }
     }
 }
 
 // ── G-I4: Entry consistency ─────────────────────────────────────────

---- tests::evict::evict_both_children_makes_parent_terminal stdout ----

thread 'tests::evict::evict_both_children_makes_parent_terminal' (2929160) panicked at packages/mudlark/src/invariants.rs:369:21:
attempt to subtract with overflow

---- tests::evict::evict_after_observations_conserves_energy stdout ----

thread 'tests::evict::evict_after_observations_conserves_energy' (2929159) panicked at packages/mudlark/src/invariants.rs:369:21:
attempt to subtract with overflow

---- tests::graph::check_evictions_bounded_respects_limit stdout ----

thread 'tests::graph::check_evictions_bounded_respects_limit' (2929178) panicked at packages/mudlark/src/invariants.rs:369:21:
attempt to subtract with overflow

failures:
    tests::evict::evict_after_observations_conserves_energy
    tests::evict::evict_both_children_makes_parent_terminal
    tests::evict::evict_single_terminal_child
    tests::evict::evict_to_semi_internal_creates_thatch
    tests::evict::evict_to_terminal_destroys_thatch
    tests::graph::check_evictions_bounded_respects_limit
    tests::graph::check_evictions_trailing_rebalance_clears_violations
    tests::graph::check_evictions_unbounded_evicts_all
    tests::graph::get_semi_internal_depth_is_trimmed_depth
    tests::graph::get_semi_internal_left_child_trims_right
    tests::graph::get_semi_internal_right_child_trims_left
    tests::observe::observe_invariants_hold_after_eviction_cycle

test result: FAILED. 332 passed; 14 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
