*** packages/mudlark/src/invariants.rs:370:18: replace > with == in check_g_i2_variable_fanout

*** mutation diff:
--- packages/mudlark/src/invariants.rs
+++ replace > with == in check_g_i2_variable_fanout
@@ -362,17 +362,17 @@
 // ── G-I2: Variable fanout ───────────────────────────────────────────
 
 fn check_g_i2_variable_fanout<C: Coordinate, V: Accumulator + Inspectable, const N: u32>(
     graph: &GvGraph<C, V, N>,
     errors: &mut Vec<String>,
 ) {
     for (idx, g) in graph.gnodes().iter_occupied() {
         let count = usize::from(g.left.is_some()) + usize::from(g.right.is_some());
-        if count > 2 {
+        if count == /* ~ changed by cargo-mutants ~ */ 2 {
             errors.push(format!("G-I2 violated at G-node {idx}: {count} children (max 2)"));
         }
     }
 }
 
 // ── G-I4: Entry consistency ─────────────────────────────────────────
 
 fn check_g_i4_entry_consistency<C: Coordinate, V: Accumulator + Inspectable, const N: u32>(

---- tests::decay::decay_amplification_above_one stdout ----

thread 'tests::decay::decay_amplification_above_one' (2937101) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (9 total):
G-I2 violated at G-node 0: 2 children (max 2)
G-I2 violated at G-node 1: 2 children (max 2)
G-I2 violated at G-node 2: 2 children (max 2)
G-I2 violated at G-node 3: 2 children (max 2)
G-I2 violated at G-node 4: 2 children (max 2)
G-I2 violated at G-node 5: 2 children (max 2)
G-I2 violated at G-node 8: 2 children (max 2)
G-I2 violated at G-node 10: 2 children (max 2)
G-I2 violated at G-node 12: 2 children (max 2)

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (2937102) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (9 total):
G-I2 violated at G-node 0: 2 children (max 2)
G-I2 violated at G-node 1: 2 children (max 2)
G-I2 violated at G-node 2: 2 children (max 2)
G-I2 violated at G-node 3: 2 children (max 2)
G-I2 violated at G-node 4: 2 children (max 2)
G-I2 violated at G-node 5: 2 children (max 2)
G-I2 violated at G-node 8: 2 children (max 2)
G-I2 violated at G-node 10: 2 children (max 2)
G-I2 violated at G-node 12: 2 children (max 2)

---- tests::decay::decay_energy_conservation_selective stdout ----

thread 'tests::decay::decay_energy_conservation_selective' (2937103) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (9 total):
G-I2 violated at G-node 0: 2 children (max 2)
G-I2 violated at G-node 1: 2 children (max 2)
G-I2 violated at G-node 2: 2 children (max 2)
G-I2 violated at G-node 3: 2 children (max 2)
G-I2 violated at G-node 4: 2 children (max 2)
G-I2 violated at G-node 5: 2 children (max 2)
G-I2 violated at G-node 8: 2 children (max 2)
G-I2 violated at G-node 10: 2 children (max 2)
G-I2 violated at G-node 12: 2 children (max 2)

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 266 passed; 80 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
