*** packages/mudlark/src/invariants.rs:384:16: delete ! in check_g_i4_entry_consistency

*** mutation diff:
--- packages/mudlark/src/invariants.rs
+++ delete ! in check_g_i4_entry_consistency
@@ -376,17 +376,17 @@
 // ── G-I4: Entry consistency ─────────────────────────────────────────
 
 fn check_g_i4_entry_consistency<C: Coordinate, V: Accumulator + Inspectable, const N: u32>(
     graph: &GvGraph<C, V, N>,
     errors: &mut Vec<String>,
 ) {
     for (idx, g) in graph.gnodes().iter_occupied() {
         if let Some(v_id) = g.entry {
-            if !graph.vnodes().is_occupied(v_id.index()) {
+            if  /* ~ changed by cargo-mutants ~ */graph.vnodes().is_occupied(v_id.index()) {
                 errors.push(format!(
                     "G-I4 violated at G-node {idx}: entry V-node {} is not occupied",
                     v_id.index()
                 ));
                 continue;
             }
             let v = graph.vnodes().get(v_id.index());

---- tests::decay::decay_amplification_above_one stdout ----

thread 'tests::decay::decay_amplification_above_one' (2948957) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (19 total):
G-I4 violated at G-node 0: entry V-node 0 is not occupied
G-I4 violated at G-node 1: entry V-node 1 is not occupied
G-I4 violated at G-node 2: entry V-node 2 is not occupied
G-I4 violated at G-node 3: entry V-node 5 is not occupied
G-I4 violated at G-node 4: entry V-node 6 is not occupied
G-I4 violated at G-node 5: entry V-node 9 is not occupied
G-I4 violated at G-node 6: entry V-node 10 is not occupied
G-I4 violated at G-node 7: entry V-node 3 is not occupied
G-I4 violated at G-node 8: entry V-node 13 is not occupied
G-I4 violated at G-node 9: entry V-node 15 is not occupied

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (2948958) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (19 total):
G-I4 violated at G-node 0: entry V-node 0 is not occupied
G-I4 violated at G-node 1: entry V-node 1 is not occupied
G-I4 violated at G-node 2: entry V-node 2 is not occupied
G-I4 violated at G-node 3: entry V-node 5 is not occupied
G-I4 violated at G-node 4: entry V-node 6 is not occupied
G-I4 violated at G-node 5: entry V-node 9 is not occupied
G-I4 violated at G-node 6: entry V-node 10 is not occupied
G-I4 violated at G-node 7: entry V-node 3 is not occupied
G-I4 violated at G-node 8: entry V-node 13 is not occupied
G-I4 violated at G-node 9: entry V-node 15 is not occupied

---- tests::decay::decay_energy_conservation_uniform stdout ----

thread 'tests::decay::decay_energy_conservation_uniform' (2948960) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (19 total):
G-I4 violated at G-node 0: entry V-node 0 is not occupied
G-I4 violated at G-node 1: entry V-node 1 is not occupied
G-I4 violated at G-node 2: entry V-node 2 is not occupied
G-I4 violated at G-node 3: entry V-node 5 is not occupied
G-I4 violated at G-node 4: entry V-node 6 is not occupied
G-I4 violated at G-node 5: entry V-node 9 is not occupied
G-I4 violated at G-node 6: entry V-node 10 is not occupied
G-I4 violated at G-node 7: entry V-node 3 is not occupied
G-I4 violated at G-node 8: entry V-node 13 is not occupied
G-I4 violated at G-node 9: entry V-node 15 is not occupied

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 257 passed; 89 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
