*** packages/mudlark/src/invariants.rs:396:38: replace > with < in check_g_i4_entry_consistency

*** mutation diff:
--- packages/mudlark/src/invariants.rs
+++ replace > with < in check_g_i4_entry_consistency
@@ -388,17 +388,17 @@
                 ));
                 continue;
             }
             let v = graph.vnodes().get(v_id.index());
 
             // Intensity must match own.
             let g_own = g.own.to_f64_approx();
             let v_int = v.intensity.to_f64_approx();
-            if (g_own - v_int).abs() > 1e-9 {
+            if (g_own - v_int).abs() < /* ~ changed by cargo-mutants ~ */ 1e-9 {
                 errors.push(format!(
                     "G-I4 violated at G-node {idx}: g.own={g_own}, entry.intensity={v_int}"
                 ));
             }
 
             // Back-link: entry must be a VKind::Entry pointing back.
             match &v.kind {
                 VKind::Entry { gnode, .. } => {

---- tests::decay::decay_f64_tree stdout ----

thread 'tests::decay::decay_f64_tree' (2949784) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (15 total):
G-I4 violated at G-node 0: g.own=10, entry.intensity=10
G-I4 violated at G-node 1: g.own=10, entry.intensity=10
G-I4 violated at G-node 2: g.own=10, entry.intensity=10
G-I4 violated at G-node 3: g.own=20, entry.intensity=20
G-I4 violated at G-node 4: g.own=0, entry.intensity=0
G-I4 violated at G-node 5: g.own=20, entry.intensity=20
G-I4 violated at G-node 6: g.own=0, entry.intensity=0
G-I4 violated at G-node 7: g.own=0, entry.intensity=0
G-I4 violated at G-node 8: g.own=20, entry.intensity=20
G-I4 violated at G-node 9: g.own=40, entry.intensity=40

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (2949781) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (19 total):
G-I4 violated at G-node 0: g.own=10, entry.intensity=10
G-I4 violated at G-node 1: g.own=10, entry.intensity=10
G-I4 violated at G-node 2: g.own=8, entry.intensity=8
G-I4 violated at G-node 3: g.own=10, entry.intensity=10
G-I4 violated at G-node 4: g.own=6, entry.intensity=6
G-I4 violated at G-node 5: g.own=10, entry.intensity=10
G-I4 violated at G-node 6: g.own=0, entry.intensity=0
G-I4 violated at G-node 7: g.own=0, entry.intensity=0
G-I4 violated at G-node 8: g.own=30, entry.intensity=30
G-I4 violated at G-node 9: g.own=0, entry.intensity=0

---- tests::decay::decay_energy_conservation_uniform stdout ----

thread 'tests::decay::decay_energy_conservation_uniform' (2949783) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (19 total):
G-I4 violated at G-node 0: g.own=10, entry.intensity=10
G-I4 violated at G-node 1: g.own=10, entry.intensity=10
G-I4 violated at G-node 2: g.own=8, entry.intensity=8
G-I4 violated at G-node 3: g.own=10, entry.intensity=10
G-I4 violated at G-node 4: g.own=6, entry.intensity=6
G-I4 violated at G-node 5: g.own=10, entry.intensity=10
G-I4 violated at G-node 6: g.own=0, entry.intensity=0
G-I4 violated at G-node 7: g.own=0, entry.intensity=0
G-I4 violated at G-node 8: g.own=30, entry.intensity=30
G-I4 violated at G-node 9: g.own=0, entry.intensity=0

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 257 passed; 89 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
