*** packages/mudlark/src/invariants.rs:406:31: replace != with == in check_g_i4_entry_consistency

*** mutation diff:
--- packages/mudlark/src/invariants.rs
+++ replace != with == in check_g_i4_entry_consistency
@@ -398,17 +398,17 @@
                     "G-I4 violated at G-node {idx}: g.own={g_own}, entry.intensity={v_int}"
                 ));
             }
 
             // Back-link: entry must be a VKind::Entry pointing back.
             match &v.kind {
                 VKind::Entry { gnode, .. } => {
                     let g_id = GNodeId::from_index(idx);
-                    if *gnode != g_id {
+                    if *gnode == /* ~ changed by cargo-mutants ~ */ g_id {
                         errors.push(format!(
                             "G-I4 violated at G-node {idx}: entry's gnode={gnode:?}, expected {g_id:?}"
                         ));
                     }
                 }
                 VKind::Structural { .. } => {
                     errors.push(format!(
                         "G-I4 violated at G-node {idx}: entry is a structural V-node, not an entry"

---- tests::decay::decay_energy_conservation_selective stdout ----

thread 'tests::decay::decay_energy_conservation_selective' (2973474) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (19 total):
G-I4 violated at G-node 0: entry's gnode=GNodeId(1), expected GNodeId(1)
G-I4 violated at G-node 1: entry's gnode=GNodeId(2), expected GNodeId(2)
G-I4 violated at G-node 2: entry's gnode=GNodeId(3), expected GNodeId(3)
G-I4 violated at G-node 3: entry's gnode=GNodeId(4), expected GNodeId(4)
G-I4 violated at G-node 4: entry's gnode=GNodeId(5), expected GNodeId(5)
G-I4 violated at G-node 5: entry's gnode=GNodeId(6), expected GNodeId(6)
G-I4 violated at G-node 6: entry's gnode=GNodeId(7), expected GNodeId(7)
G-I4 violated at G-node 7: entry's gnode=GNodeId(8), expected GNodeId(8)
G-I4 violated at G-node 8: entry's gnode=GNodeId(9), expected GNodeId(9)
G-I4 violated at G-n

---- tests::decay::decay_amplification_above_one stdout ----

thread 'tests::decay::decay_amplification_above_one' (2973472) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (19 total):
G-I4 violated at G-node 0: entry's gnode=GNodeId(1), expected GNodeId(1)
G-I4 violated at G-node 1: entry's gnode=GNodeId(2), expected GNodeId(2)
G-I4 violated at G-node 2: entry's gnode=GNodeId(3), expected GNodeId(3)
G-I4 violated at G-node 3: entry's gnode=GNodeId(4), expected GNodeId(4)
G-I4 violated at G-node 4: entry's gnode=GNodeId(5), expected GNodeId(5)
G-I4 violated at G-node 5: entry's gnode=GNodeId(6), expected GNodeId(6)
G-I4 violated at G-node 6: entry's gnode=GNodeId(7), expected GNodeId(7)
G-I4 violated at G-node 7: entry's gnode=GNodeId(8), expected GNodeId(8)
G-I4 violated at G-node 8: entry's gnode=GNodeId(9), expected GNodeId(9)
G-I4 violated at G-node 9: entry

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (2973473) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (19 total):
G-I4 violated at G-node 0: entry's gnode=GNodeId(1), expected GNodeId(1)
G-I4 violated at G-node 1: entry's gnode=GNodeId(2), expected GNodeId(2)
G-I4 violated at G-node 2: entry's gnode=GNodeId(3), expected GNodeId(3)
G-I4 violated at G-node 3: entry's gnode=GNodeId(4), expected GNodeId(4)
G-I4 violated at G-node 4: entry's gnode=GNodeId(5), expected GNodeId(5)
G-I4 violated at G-node 5: entry's gnode=GNodeId(6), expected GNodeId(6)
G-I4 violated at G-node 6: entry's gnode=GNodeId(7), expected GNodeId(7)
G-I4 violated at G-node 7: entry's gnode=GNodeId(8), expected GNodeId(8)
G-I4 violated at G-node 8: entry's gnode=GNodeId(9), expected GNodeId(9)
G-I4 violated at G-node 9: entry's gnode

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 257 passed; 89 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
