*** packages/mudlark/src/invariants.rs:436:20: delete ! in check_v_i1_structural_sum

*** mutation diff:
--- packages/mudlark/src/invariants.rs
+++ delete ! in check_v_i1_structural_sum
@@ -428,17 +428,17 @@
     for (idx, v) in graph.vnodes().iter_occupied() {
         if let VKind::Structural { children, .. } = &v.kind {
             // Check that node intensity equals sum of children's intensities.
             let mut sum = 0.0_f64;
             for i in 0..children.len() {
                 let (child_id, cached_int) = children.get(i);
 
                 // Verify cached intensity matches authoritative child intensity.
-                if !graph.vnodes().is_occupied(child_id.index()) {
+                if  /* ~ changed by cargo-mutants ~ */graph.vnodes().is_occupied(child_id.index()) {
                     errors.push(format!(
                         "V-I1 violated at V-node {idx}: child {} is not occupied",
                         child_id.index()
                     ));
                     continue;
                 }
                 let actual_int = graph.vnodes().get(child_id.index()).intensity;
                 if (cached_int.to_f64_approx() - actual_int.to_f64_approx()).abs() > 1e-9 {

---- tests::decay::decay_energy_conservation_uniform stdout ----

thread 'tests::decay::decay_energy_conservation_uniform' (2976056) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (47 total):
V-I1 violated at V-node 4: child 12 is not occupied
V-I1 violated at V-node 4: child 8 is not occupied
V-I1 violated at V-node 4: child 0 is not occupied
V-I1 violated at V-node 4: intensity=180, sum of children=0
V-I1 violated at V-node 8: child 28 is not occupied
V-I1 violated at V-node 8: child 33 is not occupied
V-I1 violated at V-node 8: intensity=80, sum of children=0
V-I1 violated at V-node 11: child 5 is not occupied
V-I1 violated at V-node 11: child 2 is not occupied
V-I1 violated at V-node 11: intensity=18, sum of children=0

---- tests::decay::decay_amplification_above_one stdout ----

thread 'tests::decay::decay_amplification_above_one' (2976053) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (47 total):
V-I1 violated at V-node 4: child 12 is not occupied
V-I1 violated at V-node 4: child 8 is not occupied
V-I1 violated at V-node 4: child 0 is not occupied
V-I1 violated at V-node 4: intensity=180, sum of children=0
V-I1 violated at V-node 8: child 28 is not occupied
V-I1 violated at V-node 8: child 33 is not occupied
V-I1 violated at V-node 8: intensity=80, sum of children=0
V-I1 violated at V-node 11: child 5 is not occupied
V-I1 violated at V-node 11: child 2 is not occupied
V-I1 violated at V-node 11: intensity=18, sum of children=0

---- tests::decay::decay_energy_conservation_selective stdout ----

thread 'tests::decay::decay_energy_conservation_selective' (2976055) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (47 total):
V-I1 violated at V-node 4: child 12 is not occupied
V-I1 violated at V-node 4: child 8 is not occupied
V-I1 violated at V-node 4: child 0 is not occupied
V-I1 violated at V-node 4: intensity=180, sum of children=0
V-I1 violated at V-node 8: child 28 is not occupied
V-I1 violated at V-node 8: child 33 is not occupied
V-I1 violated at V-node 8: intensity=80, sum of children=0
V-I1 violated at V-node 11: child 5 is not occupied
V-I1 violated at V-node 11: child 2 is not occupied
V-I1 violated at V-node 11: intensity=18, sum of children=0

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 265 passed; 81 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
