*** packages/mudlark/src/invariants.rs:444:84: replace > with < in check_v_i1_structural_sum

*** mutation diff:
--- packages/mudlark/src/invariants.rs
+++ replace > with < in check_v_i1_structural_sum
@@ -436,17 +436,17 @@
                 if !graph.vnodes().is_occupied(child_id.index()) {
                     errors.push(format!(
                         "V-I1 violated at V-node {idx}: child {} is not occupied",
                         child_id.index()
                     ));
                     continue;
                 }
                 let actual_int = graph.vnodes().get(child_id.index()).intensity;
-                if (cached_int.to_f64_approx() - actual_int.to_f64_approx()).abs() > 1e-9 {
+                if (cached_int.to_f64_approx() - actual_int.to_f64_approx()).abs() < /* ~ changed by cargo-mutants ~ */ 1e-9 {
                     errors.push(format!(
                         "V-I1 cached intensity mismatch at V-node {idx}, child {}: \
                          cached={}, actual={}",
                         child_id.index(),
                         cached_int.to_f64_approx(),
                         actual_int.to_f64_approx()
                     ));
                 }

---- tests::decay::decay_f64_tree stdout ----

thread 'tests::decay::decay_f64_tree' (2980595) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (25 total):
V-I1 cached intensity mismatch at V-node 4, child 13: cached=80, actual=80
V-I1 cached intensity mismatch at V-node 4, child 22: cached=70, actual=70
V-I1 cached intensity mismatch at V-node 11, child 3: cached=0, actual=0
V-I1 cached intensity mismatch at V-node 11, child 6: cached=0, actual=0
V-I1 cached intensity mismatch at V-node 13, child 8: cached=40, actual=40
V-I1 cached intensity mismatch at V-node 13, child 23: cached=40, actual=40
V-I1 cached intensity mismatch at V-node 13, child 25: cached=0, actual=0
V-I1 cached intensity mismatch at V-node 14, child 9: cached=20, actual=20
V-I1 cached intensity mismatch at V-node 14, child 18: cached=10, actual=10
V-I1 cached intensity mismatch at V-node 14, ch

---- tests::decay::decay_panics_zero_attenuation stdout ----

thread 'tests::decay::decay_panics_zero_attenuation' (2980606) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (33 total):
V-I1 cached intensity mismatch at V-node 4, child 12: cached=90, actual=90
V-I1 cached intensity mismatch at V-node 4, child 8: cached=80, actual=80
V-I1 cached intensity mismatch at V-node 4, child 0: cached=10, actual=10
V-I1 cached intensity mismatch at V-node 8, child 28: cached=42, actual=42
V-I1 cached intensity mismatch at V-node 8, child 33: cached=38, actual=38
V-I1 cached intensity mismatch at V-node 11, child 5: cached=10, actual=10
V-I1 cached intensity mismatch at V-node 11, child 2: cached=8, actual=8
V-I1 cached intensity mismatch at V-node 12, child 25: cached=40, actual=40
V-I1 cached intensity mismatch at V-node 12, child 18: cached=50, actual=50
V-I1 cached inte

---- tests::decay::decay_panics_q_above_one stdout ----

thread 'tests::decay::decay_panics_q_above_one' (2980605) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (33 total):
V-I1 cached intensity mismatch at V-node 4, child 12: cached=90, actual=90
V-I1 cached intensity mismatch at V-node 4, child 8: cached=80, actual=80
V-I1 cached intensity mismatch at V-node 4, child 0: cached=10, actual=10
V-I1 cached intensity mismatch at V-node 8, child 28: cached=42, actual=42
V-I1 cached intensity mismatch at V-node 8, child 33: cached=38, actual=38
V-I1 cached intensity mismatch at V-node 11, child 5: cached=10, actual=10
V-I1 cached intensity mismatch at V-node 11, child 2: cached=8, actual=8
V-I1 cached intensity mismatch at V-node 12, child 25: cached=40, actual=40
V-I1 cached intensity mismatch at V-node 12, child 18: cached=50, actual=50
V-I1 cached intensity mism

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 265 passed; 81 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
