*** packages/mudlark/src/invariants.rs:457:26: replace - with / in check_v_i1_structural_sum

*** mutation diff:
--- packages/mudlark/src/invariants.rs
+++ replace - with / in check_v_i1_structural_sum
@@ -449,17 +449,17 @@
                         cached_int.to_f64_approx(),
                         actual_int.to_f64_approx()
                     ));
                 }
                 sum += cached_int.to_f64_approx();
             }
 
             let node_int = v.intensity.to_f64_approx();
-            if (node_int - sum).abs() > 1e-9 {
+            if (node_int / /* ~ changed by cargo-mutants ~ */ sum).abs() > 1e-9 {
                 errors.push(format!(
                     "V-I1 violated at V-node {idx}: intensity={node_int}, sum of children={sum}"
                 ));
             }
         }
     }
 }

---- tests::decay::decay_energy_conservation_selective stdout ----

thread 'tests::decay::decay_energy_conservation_selective' (3023873) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (14 total):
V-I1 violated at V-node 4: intensity=180, sum of children=180
V-I1 violated at V-node 8: intensity=80, sum of children=80
V-I1 violated at V-node 11: intensity=18, sum of children=18
V-I1 violated at V-node 12: intensity=90, sum of children=90
V-I1 violated at V-node 14: intensity=10, sum of children=10
V-I1 violated at V-node 18: intensity=50, sum of children=50
V-I1 violated at V-node 20: intensity=6, sum of children=6
V-I1 violated at V-node 21: intensity=21, sum of children=21
V-I1 violated at V-node 22: intensity=20, sum of children=20
V-I1 violated at V-node 25: intensity=40, sum of children=40

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (3023872) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (14 total):
V-I1 violated at V-node 4: intensity=180, sum of children=180
V-I1 violated at V-node 8: intensity=80, sum of children=80
V-I1 violated at V-node 11: intensity=18, sum of children=18
V-I1 violated at V-node 12: intensity=90, sum of children=90
V-I1 violated at V-node 14: intensity=10, sum of children=10
V-I1 violated at V-node 18: intensity=50, sum of children=50
V-I1 violated at V-node 20: intensity=6, sum of children=6
V-I1 violated at V-node 21: intensity=21, sum of children=21
V-I1 violated at V-node 22: intensity=20, sum of children=20
V-I1 violated at V-node 25: intensity=40, sum of children=40

---- tests::decay::decay_panics_q_above_one stdout ----

thread 'tests::decay::decay_panics_q_above_one' (3023884) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (14 total):
V-I1 violated at V-node 4: intensity=180, sum of children=180
V-I1 violated at V-node 8: intensity=80, sum of children=80
V-I1 violated at V-node 11: intensity=18, sum of children=18
V-I1 violated at V-node 12: intensity=90, sum of children=90
V-I1 violated at V-node 14: intensity=10, sum of children=10
V-I1 violated at V-node 18: intensity=50, sum of children=50
V-I1 violated at V-node 20: intensity=6, sum of children=6
V-I1 violated at V-node 21: intensity=21, sum of children=21
V-I1 violated at V-node 22: intensity=20, sum of children=20
V-I1 violated at V-node 25: intensity=40, sum of children=40

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 265 passed; 81 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
