*** packages/mudlark/src/invariants.rs:475:25: replace && with || in check_v_i2_branching_factor

*** mutation diff:
--- packages/mudlark/src/invariants.rs
+++ replace && with || in check_v_i2_branching_factor
@@ -467,17 +467,17 @@
 
 fn check_v_i2_branching_factor<C: Coordinate, V: Accumulator + Inspectable, const N: u32>(
     graph: &GvGraph<C, V, N>,
     errors: &mut Vec<String>,
 ) {
     for (idx, v) in graph.vnodes().iter_occupied() {
         if let VKind::Structural { children, .. } = &v.kind {
             let len = children.len();
-            if len != 2 && len != 3 {
+            if len != 2 || /* ~ changed by cargo-mutants ~ */ len != 3 {
                 errors.push(format!("V-I2 violated at V-node {idx}: {len} children (must be 2 or 3)"));
             }
         }
     }
 }
 
 // ── V-I3: Max-uncle constraint ──────────────────────────────────────

---- tests::decay::decay_f64_tree stdout ----

thread 'tests::decay::decay_f64_tree' (3026374) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (11 total):
V-I2 violated at V-node 4: 2 children (must be 2 or 3)
V-I2 violated at V-node 11: 2 children (must be 2 or 3)
V-I2 violated at V-node 13: 3 children (must be 2 or 3)
V-I2 violated at V-node 14: 3 children (must be 2 or 3)
V-I2 violated at V-node 15: 2 children (must be 2 or 3)
V-I2 violated at V-node 17: 3 children (must be 2 or 3)
V-I2 violated at V-node 18: 2 children (must be 2 or 3)
V-I2 violated at V-node 21: 2 children (must be 2 or 3)
V-I2 violated at V-node 22: 2 children (must be 2 or 3)
V-I2 violated at V-node 23: 2 children (must be 2 or 3)

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (3026371) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (15 total):
V-I2 violated at V-node 4: 3 children (must be 2 or 3)
V-I2 violated at V-node 8: 2 children (must be 2 or 3)
V-I2 violated at V-node 11: 2 children (must be 2 or 3)
V-I2 violated at V-node 12: 2 children (must be 2 or 3)
V-I2 violated at V-node 14: 3 children (must be 2 or 3)
V-I2 violated at V-node 18: 2 children (must be 2 or 3)
V-I2 violated at V-node 20: 2 children (must be 2 or 3)
V-I2 violated at V-node 21: 3 children (must be 2 or 3)
V-I2 violated at V-node 22: 2 children (must be 2 or 3)
V-I2 violated at V-node 25: 2 children (must be 2 or 3)

---- tests::decay::decay_energy_conservation_selective stdout ----

thread 'tests::decay::decay_energy_conservation_selective' (3026372) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (15 total):
V-I2 violated at V-node 4: 3 children (must be 2 or 3)
V-I2 violated at V-node 8: 2 children (must be 2 or 3)
V-I2 violated at V-node 11: 2 children (must be 2 or 3)
V-I2 violated at V-node 12: 2 children (must be 2 or 3)
V-I2 violated at V-node 14: 3 children (must be 2 or 3)
V-I2 violated at V-node 18: 2 children (must be 2 or 3)
V-I2 violated at V-node 20: 2 children (must be 2 or 3)
V-I2 violated at V-node 21: 3 children (must be 2 or 3)
V-I2 violated at V-node 22: 2 children (must be 2 or 3)
V-I2 violated at V-node 25: 2 children (must be 2 or 3)

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 265 passed; 81 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
