*** packages/mudlark/src/invariants.rs:475:32: replace != with == in check_v_i2_branching_factor

*** mutation diff:
--- packages/mudlark/src/invariants.rs
+++ replace != with == in check_v_i2_branching_factor
@@ -467,17 +467,17 @@
 
 fn check_v_i2_branching_factor<C: Coordinate, V: Accumulator + Inspectable, const N: u32>(
     graph: &GvGraph<C, V, N>,
     errors: &mut Vec<String>,
 ) {
     for (idx, v) in graph.vnodes().iter_occupied() {
         if let VKind::Structural { children, .. } = &v.kind {
             let len = children.len();
-            if len != 2 && len != 3 {
+            if len != 2 && len == /* ~ changed by cargo-mutants ~ */ 3 {
                 errors.push(format!("V-I2 violated at V-node {idx}: {len} children (must be 2 or 3)"));
             }
         }
     }
 }
 
 // ── V-I3: Max-uncle constraint ──────────────────────────────────────

---- tests::decay::decay_multiple_uniform_preserves_invariants stdout ----

thread 'tests::decay::decay_multiple_uniform_preserves_invariants' (3033308) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (3 total):
V-I2 violated at V-node 4: 3 children (must be 2 or 3)
V-I2 violated at V-node 14: 3 children (must be 2 or 3)
V-I2 violated at V-node 21: 3 children (must be 2 or 3)

---- tests::decay::decay_f64_tree stdout ----

thread 'tests::decay::decay_f64_tree' (3033306) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (3 total):
V-I2 violated at V-node 13: 3 children (must be 2 or 3)
V-I2 violated at V-node 14: 3 children (must be 2 or 3)
V-I2 violated at V-node 17: 3 children (must be 2 or 3)

---- tests::decay::decay_panics_zero_attenuation stdout ----

thread 'tests::decay::decay_panics_zero_attenuation' (3033315) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (3 total):
V-I2 violated at V-node 4: 3 children (must be 2 or 3)
V-I2 violated at V-node 14: 3 children (must be 2 or 3)
V-I2 violated at V-node 21: 3 children (must be 2 or 3)
note: panic did not contain expected string
      panic message: "Invariant violations (3 total):\nV-I2 violated at V-node 4: 3 children (must be 2 or 3)\nV-I2 violated at V-node 14: 3 children (must be 2 or 3)\nV-I2 violated at V-node 21: 3 children (must be 2 or 3)"
 expected substring: "attenuation must be > 0"

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 284 passed; 62 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
