*** packages/mudlark/src/invariants.rs:520:20: delete ! in check_v_i5_entry_leaf

*** mutation diff:
--- packages/mudlark/src/invariants.rs
+++ delete ! in check_v_i5_entry_leaf
@@ -512,17 +512,17 @@
     //
     // Additionally: verify no entry is referenced as a structural child
     // that itself is structural. (This is structurally guaranteed by
     // the type system, but document the intent.)
     for (idx, v) in graph.vnodes().iter_occupied() {
         if let VKind::Structural { children, .. } = &v.kind {
             for i in 0..children.len() {
                 let (child_id, _) = children.get(i);
-                if !graph.vnodes().is_occupied(child_id.index()) {
+                if  /* ~ changed by cargo-mutants ~ */graph.vnodes().is_occupied(child_id.index()) {
                     errors.push(format!(
                         "V-I5 violated at V-node {idx}: child {} is not occupied",
                         child_id.index()
                     ));
                 }
             }
         }
     }

---- tests::decay::decay_amplification_above_one stdout ----

thread 'tests::decay::decay_amplification_above_one' (3037466) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (33 total):
V-I5 violated at V-node 4: child 12 is not occupied
V-I5 violated at V-node 4: child 8 is not occupied
V-I5 violated at V-node 4: child 0 is not occupied
V-I5 violated at V-node 8: child 28 is not occupied
V-I5 violated at V-node 8: child 33 is not occupied
V-I5 violated at V-node 11: child 5 is not occupied
V-I5 violated at V-node 11: child 2 is not occupied
V-I5 violated at V-node 12: child 25 is not occupied
V-I5 violated at V-node 12: child 18 is not occupied
V-I5 violated at V-node 14: child 9 is not occupied

---- tests::decay::decay_energy_conservation_uniform stdout ----

thread 'tests::decay::decay_energy_conservation_uniform' (3037469) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (33 total):
V-I5 violated at V-node 4: child 12 is not occupied
V-I5 violated at V-node 4: child 8 is not occupied
V-I5 violated at V-node 4: child 0 is not occupied
V-I5 violated at V-node 8: child 28 is not occupied
V-I5 violated at V-node 8: child 33 is not occupied
V-I5 violated at V-node 11: child 5 is not occupied
V-I5 violated at V-node 11: child 2 is not occupied
V-I5 violated at V-node 12: child 25 is not occupied
V-I5 violated at V-node 12: child 18 is not occupied
V-I5 violated at V-node 14: child 9 is not occupied

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (3037467) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (33 total):
V-I5 violated at V-node 4: child 12 is not occupied
V-I5 violated at V-node 4: child 8 is not occupied
V-I5 violated at V-node 4: child 0 is not occupied
V-I5 violated at V-node 8: child 28 is not occupied
V-I5 violated at V-node 8: child 33 is not occupied
V-I5 violated at V-node 11: child 5 is not occupied
V-I5 violated at V-node 11: child 2 is not occupied
V-I5 violated at V-node 12: child 25 is not occupied
V-I5 violated at V-node 12: child 18 is not occupied
V-I5 violated at V-node 14: child 9 is not occupied

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 265 passed; 81 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
