*** packages/mudlark/src/invariants.rs:539:16: delete ! in check_v_i6_exposed_flag

*** mutation diff:
--- packages/mudlark/src/invariants.rs
+++ delete ! in check_v_i6_exposed_flag
@@ -531,17 +531,17 @@
 // ── V-I6: Terminal flag on entries ──────────────────────────────────
 
 fn check_v_i6_exposed_flag<C: Coordinate, V: Accumulator + Inspectable, const N: u32>(
     graph: &GvGraph<C, V, N>,
     errors: &mut Vec<String>,
 ) {
     for (idx, v) in graph.vnodes().iter_occupied() {
         if let VKind::Entry { gnode, is_exposed, .. } = &v.kind {
-            if !graph.gnodes().is_occupied(gnode.index()) {
+            if  /* ~ changed by cargo-mutants ~ */graph.gnodes().is_occupied(gnode.index()) {
                 errors.push(format!(
                     "V-I6 violated at V-node {idx}: backing G-node {} is not occupied",
                     gnode.index()
                 ));
                 continue;
             }
             let g = graph.gnodes().get(gnode.index());
             let expected = g.uncovered_range().is_some();

---- tests::decay::decay_energy_conservation_uniform stdout ----

thread 'tests::decay::decay_energy_conservation_uniform' (3038211) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (19 total):
V-I6 violated at V-node 0: backing G-node 0 is not occupied
V-I6 violated at V-node 1: backing G-node 1 is not occupied
V-I6 violated at V-node 2: backing G-node 2 is not occupied
V-I6 violated at V-node 3: backing G-node 7 is not occupied
V-I6 violated at V-node 5: backing G-node 3 is not occupied
V-I6 violated at V-node 6: backing G-node 4 is not occupied
V-I6 violated at V-node 7: backing G-node 11 is not occupied
V-I6 violated at V-node 9: backing G-node 5 is not occupied
V-I6 violated at V-node 10: backing G-node 6 is not occupied
V-I6 violated at V-node 13: backing G-node 8 is not occupied

---- tests::decay::decay_amplification_above_one stdout ----

thread 'tests::decay::decay_amplification_above_one' (3038208) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (19 total):
V-I6 violated at V-node 0: backing G-node 0 is not occupied
V-I6 violated at V-node 1: backing G-node 1 is not occupied
V-I6 violated at V-node 2: backing G-node 2 is not occupied
V-I6 violated at V-node 3: backing G-node 7 is not occupied
V-I6 violated at V-node 5: backing G-node 3 is not occupied
V-I6 violated at V-node 6: backing G-node 4 is not occupied
V-I6 violated at V-node 7: backing G-node 11 is not occupied
V-I6 violated at V-node 9: backing G-node 5 is not occupied
V-I6 violated at V-node 10: backing G-node 6 is not occupied
V-I6 violated at V-node 13: backing G-node 8 is not occupied

---- tests::decay::decay_energy_conservation_selective stdout ----

thread 'tests::decay::decay_energy_conservation_selective' (3038210) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (19 total):
V-I6 violated at V-node 0: backing G-node 0 is not occupied
V-I6 violated at V-node 1: backing G-node 1 is not occupied
V-I6 violated at V-node 2: backing G-node 2 is not occupied
V-I6 violated at V-node 3: backing G-node 7 is not occupied
V-I6 violated at V-node 5: backing G-node 3 is not occupied
V-I6 violated at V-node 6: backing G-node 4 is not occupied
V-I6 violated at V-node 7: backing G-node 11 is not occupied
V-I6 violated at V-node 9: backing G-node 5 is not occupied
V-I6 violated at V-node 10: backing G-node 6 is not occupied
V-I6 violated at V-node 13: backing G-node 8 is not occupied

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 257 passed; 89 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
