*** packages/mudlark/src/invariants.rs:548:28: replace != with == in check_v_i6_exposed_flag

*** mutation diff:
--- packages/mudlark/src/invariants.rs
+++ replace != with == in check_v_i6_exposed_flag
@@ -540,17 +540,17 @@
                 errors.push(format!(
                     "V-I6 violated at V-node {idx}: backing G-node {} is not occupied",
                     gnode.index()
                 ));
                 continue;
             }
             let g = graph.gnodes().get(gnode.index());
             let expected = g.uncovered_range().is_some();
-            if *is_exposed != expected {
+            if *is_exposed == /* ~ changed by cargo-mutants ~ */ expected {
                 errors.push(format!(
                     "V-I6 violated at V-node {idx}: is_exposed={is_exposed}, \
                      expected={expected} (state={:?})",
                     g.state()
                 ));
             }
         }
     }

---- tests::decay::decay_amplification_above_one stdout ----

thread 'tests::decay::decay_amplification_above_one' (3043652) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (19 total):
V-I6 violated at V-node 0: is_exposed=false, expected=false (state=Internal)
V-I6 violated at V-node 1: is_exposed=false, expected=false (state=Internal)
V-I6 violated at V-node 2: is_exposed=false, expected=false (state=Internal)
V-I6 violated at V-node 3: is_exposed=true, expected=true (state=Terminal)
V-I6 violated at V-node 5: is_exposed=false, expected=false (state=Internal)
V-I6 violated at V-node 6: is_exposed=false, expected=false (state=Internal)
V-I6 violated at V-node 7: is_exposed=true, expected=true (state=Terminal)
V-I6 violated at V-node 9: is_exposed=false, expected=false (state=Internal)
V-I6 violated at V-node 10: is_exposed=true, expected=true (state=Terminal)
V

---- tests::decay::decay_energy_conservation_selective stdout ----

thread 'tests::decay::decay_energy_conservation_selective' (3043654) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (19 total):
V-I6 violated at V-node 0: is_exposed=false, expected=false (state=Internal)
V-I6 violated at V-node 1: is_exposed=false, expected=false (state=Internal)
V-I6 violated at V-node 2: is_exposed=false, expected=false (state=Internal)
V-I6 violated at V-node 3: is_exposed=true, expected=true (state=Terminal)
V-I6 violated at V-node 5: is_exposed=false, expected=false (state=Internal)
V-I6 violated at V-node 6: is_exposed=false, expected=false (state=Internal)
V-I6 violated at V-node 7: is_exposed=true, expected=true (state=Terminal)
V-I6 violated at V-node 9: is_exposed=false, expected=false (state=Internal)
V-I6 violated at V-node 10: is_exposed=true, expected=true (state

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (3043653) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (19 total):
V-I6 violated at V-node 0: is_exposed=false, expected=false (state=Internal)
V-I6 violated at V-node 1: is_exposed=false, expected=false (state=Internal)
V-I6 violated at V-node 2: is_exposed=false, expected=false (state=Internal)
V-I6 violated at V-node 3: is_exposed=true, expected=true (state=Terminal)
V-I6 violated at V-node 5: is_exposed=false, expected=false (state=Internal)
V-I6 violated at V-node 6: is_exposed=false, expected=false (state=Internal)
V-I6 violated at V-node 7: is_exposed=true, expected=true (state=Terminal)
V-I6 violated at V-node 9: is_exposed=false, expected=false (state=Internal)
V-I6 violated at V-node 10: is_exposed=true, expected=true (state=Terminal)
V-I6 viol

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 257 passed; 89 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
