*** packages/mudlark/src/invariants.rs:578:30: replace != with == in check_v_i6b_evictable_flag

*** mutation diff:
--- packages/mudlark/src/invariants.rs
+++ replace != with == in check_v_i6b_evictable_flag
@@ -570,17 +570,17 @@
             ..
         } = &v.kind
         {
             if !graph.gnodes().is_occupied(gnode.index()) {
                 continue; // Already caught by V-I6.
             }
             let g = graph.gnodes().get(gnode.index());
             let expected = g.is_terminal();
-            if *is_evictable != expected {
+            if *is_evictable == /* ~ changed by cargo-mutants ~ */ expected {
                 errors.push(format!(
                     "V-I6b violated at V-node {idx}: is_evictable={is_evictable}, \
                      expected={expected} (state={:?})",
                     g.state()
                 ));
             }
             // Implied: is_evictable ⟹ is_exposed
             if *is_evictable && !*is_exposed {

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (3050025) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (19 total):
V-I6b violated at V-node 0: is_evictable=false, expected=false (state=Internal)
V-I6b violated at V-node 1: is_evictable=false, expected=false (state=Internal)
V-I6b violated at V-node 2: is_evictable=false, expected=false (state=Internal)
V-I6b violated at V-node 3: is_evictable=true, expected=true (state=Terminal)
V-I6b violated at V-node 5: is_evictable=false, expected=false (state=Internal)
V-I6b violated at V-node 6: is_evictable=false, expected=false (state=Internal)
V-I6b violated at V-node 7: is_evictable=true, expected=true (state=Terminal)
V-I6b violated at V-node 9: is_evictable=false, expected=false (state=Internal)
V-I6b violated at V-node 10: is_evictable=true, expected=true

---- tests::decay::decay_energy_conservation_selective stdout ----

thread 'tests::decay::decay_energy_conservation_selective' (3050026) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (19 total):
V-I6b violated at V-node 0: is_evictable=false, expected=false (state=Internal)
V-I6b violated at V-node 1: is_evictable=false, expected=false (state=Internal)
V-I6b violated at V-node 2: is_evictable=false, expected=false (state=Internal)
V-I6b violated at V-node 3: is_evictable=true, expected=true (state=Terminal)
V-I6b violated at V-node 5: is_evictable=false, expected=false (state=Internal)
V-I6b violated at V-node 6: is_evictable=false, expected=false (state=Internal)
V-I6b violated at V-node 7: is_evictable=true, expected=true (state=Terminal)
V-I6b violated at V-node 9: is_evictable=false, expected=false (state=Internal)
V-I6b violated at V-node 10: is_evictable

---- tests::decay::decay_energy_conservation_uniform stdout ----

thread 'tests::decay::decay_energy_conservation_uniform' (3050028) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (19 total):
V-I6b violated at V-node 0: is_evictable=false, expected=false (state=Internal)
V-I6b violated at V-node 1: is_evictable=false, expected=false (state=Internal)
V-I6b violated at V-node 2: is_evictable=false, expected=false (state=Internal)
V-I6b violated at V-node 3: is_evictable=true, expected=true (state=Terminal)
V-I6b violated at V-node 5: is_evictable=false, expected=false (state=Internal)
V-I6b violated at V-node 6: is_evictable=false, expected=false (state=Internal)
V-I6b violated at V-node 7: is_evictable=true, expected=true (state=Terminal)
V-I6b violated at V-node 9: is_evictable=false, expected=false (state=Internal)
V-I6b violated at V-node 10: is_evictable=tru

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 257 passed; 89 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
