*** packages/mudlark/src/invariants.rs:586:30: replace && with || in check_v_i6b_evictable_flag

*** mutation diff:
--- packages/mudlark/src/invariants.rs
+++ replace && with || in check_v_i6b_evictable_flag
@@ -578,17 +578,17 @@
             if *is_evictable != expected {
                 errors.push(format!(
                     "V-I6b violated at V-node {idx}: is_evictable={is_evictable}, \
                      expected={expected} (state={:?})",
                     g.state()
                 ));
             }
             // Implied: is_evictable ⟹ is_exposed
-            if *is_evictable && !*is_exposed {
+            if *is_evictable || /* ~ changed by cargo-mutants ~ */ !*is_exposed {
                 errors.push(format!(
                     "V-I6b violated at V-node {idx}: is_evictable=true but is_exposed=false"
                 ));
             }
         }
     }
 }

---- tests::decay::decay_energy_conservation_uniform stdout ----

thread 'tests::decay::decay_energy_conservation_uniform' (3051091) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (19 total):
V-I6b violated at V-node 0: is_evictable=true but is_exposed=false
V-I6b violated at V-node 1: is_evictable=true but is_exposed=false
V-I6b violated at V-node 2: is_evictable=true but is_exposed=false
V-I6b violated at V-node 3: is_evictable=true but is_exposed=false
V-I6b violated at V-node 5: is_evictable=true but is_exposed=false
V-I6b violated at V-node 6: is_evictable=true but is_exposed=false
V-I6b violated at V-node 7: is_evictable=true but is_exposed=false
V-I6b violated at V-node 9: is_evictable=true but is_exposed=false
V-I6b violated at V-node 10: is_evictable=true but is_exposed=false
V-I6b violated at V-node 13: is_evictable=true but is_exposed=false

---- tests::decay::decay_amplification_above_one stdout ----

thread 'tests::decay::decay_amplification_above_one' (3051088) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (19 total):
V-I6b violated at V-node 0: is_evictable=true but is_exposed=false
V-I6b violated at V-node 1: is_evictable=true but is_exposed=false
V-I6b violated at V-node 2: is_evictable=true but is_exposed=false
V-I6b violated at V-node 3: is_evictable=true but is_exposed=false
V-I6b violated at V-node 5: is_evictable=true but is_exposed=false
V-I6b violated at V-node 6: is_evictable=true but is_exposed=false
V-I6b violated at V-node 7: is_evictable=true but is_exposed=false
V-I6b violated at V-node 9: is_evictable=true but is_exposed=false
V-I6b violated at V-node 10: is_evictable=true but is_exposed=false
V-I6b violated at V-node 13: is_evictable=true but is_exposed=false

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (3051089) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (19 total):
V-I6b violated at V-node 0: is_evictable=true but is_exposed=false
V-I6b violated at V-node 1: is_evictable=true but is_exposed=false
V-I6b violated at V-node 2: is_evictable=true but is_exposed=false
V-I6b violated at V-node 3: is_evictable=true but is_exposed=false
V-I6b violated at V-node 5: is_evictable=true but is_exposed=false
V-I6b violated at V-node 6: is_evictable=true but is_exposed=false
V-I6b violated at V-node 7: is_evictable=true but is_exposed=false
V-I6b violated at V-node 9: is_evictable=true but is_exposed=false
V-I6b violated at V-node 10: is_evictable=true but is_exposed=false
V-I6b violated at V-node 13: is_evictable=true but is_exposed=false

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 257 passed; 89 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
