*** packages/mudlark/src/invariants.rs:614:31: replace != with == in check_v_i7_structural_flag

*** mutation diff:
--- packages/mudlark/src/invariants.rs
+++ replace != with == in check_v_i7_structural_flag
@@ -606,17 +606,17 @@
                     return false;
                 }
                 let child = graph.vnodes().get(child_id.index());
                 match &child.kind {
                     VKind::Entry { is_evictable, .. } => *is_evictable,
                     VKind::Structural { has_evictable, .. } => *has_evictable,
                 }
             });
-            if *has_evictable != expected {
+            if *has_evictable == /* ~ changed by cargo-mutants ~ */ expected {
                 errors.push(format!(
                     "V-I7 violated at V-node {idx}: has_evictable={has_evictable}, \
                      expected={expected}"
                 ));
             }
         }
     }
 }

---- tests::decay::decay_energy_conservation_selective stdout ----

thread 'tests::decay::decay_energy_conservation_selective' (3062814) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (15 total):
V-I7 violated at V-node 4: has_evictable=true, expected=true
V-I7 violated at V-node 8: has_evictable=true, expected=true
V-I7 violated at V-node 11: has_evictable=false, expected=false
V-I7 violated at V-node 12: has_evictable=true, expected=true
V-I7 violated at V-node 14: has_evictable=true, expected=true
V-I7 violated at V-node 18: has_evictable=true, expected=true
V-I7 violated at V-node 20: has_evictable=true, expected=true
V-I7 violated at V-node 21: has_evictable=true, expected=true
V-I7 violated at V-node 22: has_evictable=true, expected=true
V-I7 violated at V-node 25: has_evictable=true, expected=true

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (3062813) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (15 total):
V-I7 violated at V-node 4: has_evictable=true, expected=true
V-I7 violated at V-node 8: has_evictable=true, expected=true
V-I7 violated at V-node 11: has_evictable=false, expected=false
V-I7 violated at V-node 12: has_evictable=true, expected=true
V-I7 violated at V-node 14: has_evictable=true, expected=true
V-I7 violated at V-node 18: has_evictable=true, expected=true
V-I7 violated at V-node 20: has_evictable=true, expected=true
V-I7 violated at V-node 21: has_evictable=true, expected=true
V-I7 violated at V-node 22: has_evictable=true, expected=true
V-I7 violated at V-node 25: has_evictable=true, expected=true

---- tests::decay::decay_energy_conservation_uniform stdout ----

thread 'tests::decay::decay_energy_conservation_uniform' (3062815) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (15 total):
V-I7 violated at V-node 4: has_evictable=true, expected=true
V-I7 violated at V-node 8: has_evictable=true, expected=true
V-I7 violated at V-node 11: has_evictable=false, expected=false
V-I7 violated at V-node 12: has_evictable=true, expected=true
V-I7 violated at V-node 14: has_evictable=true, expected=true
V-I7 violated at V-node 18: has_evictable=true, expected=true
V-I7 violated at V-node 20: has_evictable=true, expected=true
V-I7 violated at V-node 21: has_evictable=true, expected=true
V-I7 violated at V-node 22: has_evictable=true, expected=true
V-I7 violated at V-node 25: has_evictable=true, expected=true

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 265 passed; 81 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
