*** packages/mudlark/src/invariants.rs:637:17: replace - with + in check_clean_accounting

*** mutation diff:
--- packages/mudlark/src/invariants.rs
+++ replace - with + in check_clean_accounting
@@ -629,17 +629,17 @@
 ) {
     let mut total_v = 0.0_f64;
     for (_, v) in graph.vnodes().iter_occupied() {
         if matches!(v.kind, VKind::Entry { .. }) {
             total_v += v.intensity.to_f64_approx();
         }
     }
     let g_root_sum = graph.gnodes().get(graph.g_root().index()).sum.to_f64_approx();
-    if (total_v - g_root_sum).abs() > 1e-9 {
+    if (total_v + /* ~ changed by cargo-mutants ~ */ g_root_sum).abs() > 1e-9 {
         errors.push(format!(
             "Clean accounting violated: V-entry sum={total_v}, G-root sum={g_root_sum}"
         ));
     }
 }
 
 // ── Parent link consistency ─────────────────────────────────────────

---- tests::decay::decay_energy_conservation_selective stdout ----

thread 'tests::decay::decay_energy_conservation_selective' (3084762) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
Clean accounting violated: V-entry sum=180, G-root sum=180

---- tests::decay::decay_energy_conservation_uniform stdout ----

thread 'tests::decay::decay_energy_conservation_uniform' (3084765) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
Clean accounting violated: V-entry sum=180, G-root sum=180

---- tests::decay::decay_amplification_above_one stdout ----

thread 'tests::decay::decay_amplification_above_one' (3084757) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
Clean accounting violated: V-entry sum=180, G-root sum=180

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 257 passed; 89 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.11s

*** result: Failure(101)
