*** packages/mudlark/src/invariants.rs:63:8: delete ! in assert_invariants

*** mutation diff:
--- packages/mudlark/src/invariants.rs
+++ delete ! in assert_invariants
@@ -55,17 +55,17 @@
 ///
 /// # Panics
 ///
 /// Panics with a descriptive message listing every invariant that is
 /// violated.  The panic message includes all failures, not just the
 /// first.
 pub fn assert_invariants<C: Coordinate, V: Accumulator + Inspectable, const N: u32>(graph: &GvGraph<C, V, N>) {
     let errors = check_all_invariants(graph);
-    if !errors.is_empty() {
+    if  /* ~ changed by cargo-mutants ~ */errors.is_empty() {
         let msg = errors.join("\n");
         panic!("Invariant violations ({} total):\n{msg}", errors.len());
     }
 }
 
 /// Check only plateau-related invariants. Used for debugging.
 #[cfg(feature = "dynamic-contour-tracking")]
 #[allow(dead_code)]

---- tests::decay::decay_amplification_above_one stdout ----

thread 'tests::decay::decay_amplification_above_one' (2831438) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (0 total):

---- tests::decay::decay_energy_conservation_uniform stdout ----

thread 'tests::decay::decay_energy_conservation_uniform' (2831441) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (0 total):

---- tests::decay::decay_multiple_selective_preserves_invariants stdout ----

thread 'tests::decay::decay_multiple_selective_preserves_invariants' (2831443) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (0 total):

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 259 passed; 87 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
