*** packages/mudlark/src/invariants.rs:656:33: replace != with == in check_parent_link_consistency

*** mutation diff:
--- packages/mudlark/src/invariants.rs
+++ replace != with == in check_parent_link_consistency
@@ -648,17 +648,17 @@
     errors: &mut Vec<String>,
 ) {
     // G-Tree parent links.
     for (idx, g) in graph.gnodes().iter_occupied() {
         let g_id = GNodeId::from_index(idx);
         if let Some(left) = g.left {
             if graph.gnodes().is_occupied(left.index()) {
                 let child_parent = graph.gnodes().get(left.index()).parent;
-                if child_parent != Some(g_id) {
+                if child_parent == /* ~ changed by cargo-mutants ~ */ Some(g_id) {
                     errors.push(format!(
                         "G-parent link: G-node {idx}'s left child {}'s parent is {:?}, expected {g_id:?}",
                         left.index(),
                         child_parent
                     ));
                 }
             }
         }

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (3095555) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (9 total):
G-parent link: G-node 0's left child 1's parent is Some(GNodeId(1)), expected GNodeId(1)
G-parent link: G-node 1's left child 5's parent is Some(GNodeId(2)), expected GNodeId(2)
G-parent link: G-node 2's left child 3's parent is Some(GNodeId(3)), expected GNodeId(3)
G-parent link: G-node 3's left child 9's parent is Some(GNodeId(4)), expected GNodeId(4)
G-parent link: G-node 4's left child 11's parent is Some(GNodeId(5)), expected GNodeId(5)
G-parent link: G-node 5's left child 7's parent is Some(GNodeId(6)), expected GNodeId(6)
G-parent link: G-node 8's left child 13's parent is Some(GNodeId(9)), expected GNodeId(9)
G-parent link: G-node 10's left child 15's parent is Some(GNodeId(11)), e

---- tests::decay::decay_amplification_above_one stdout ----

thread 'tests::decay::decay_amplification_above_one' (3095554) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (9 total):
G-parent link: G-node 0's left child 1's parent is Some(GNodeId(1)), expected GNodeId(1)
G-parent link: G-node 1's left child 5's parent is Some(GNodeId(2)), expected GNodeId(2)
G-parent link: G-node 2's left child 3's parent is Some(GNodeId(3)), expected GNodeId(3)
G-parent link: G-node 3's left child 9's parent is Some(GNodeId(4)), expected GNodeId(4)
G-parent link: G-node 4's left child 11's parent is Some(GNodeId(5)), expected GNodeId(5)
G-parent link: G-node 5's left child 7's parent is Some(GNodeId(6)), expected GNodeId(6)
G-parent link: G-node 8's left child 13's parent is Some(GNodeId(9)), expected GNodeId(9)
G-parent link: G-node 10's left child 15's parent is Some(GNodeId

---- tests::decay::decay_energy_conservation_selective stdout ----

thread 'tests::decay::decay_energy_conservation_selective' (3095556) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (9 total):
G-parent link: G-node 0's left child 1's parent is Some(GNodeId(1)), expected GNodeId(1)
G-parent link: G-node 1's left child 5's parent is Some(GNodeId(2)), expected GNodeId(2)
G-parent link: G-node 2's left child 3's parent is Some(GNodeId(3)), expected GNodeId(3)
G-parent link: G-node 3's left child 9's parent is Some(GNodeId(4)), expected GNodeId(4)
G-parent link: G-node 4's left child 11's parent is Some(GNodeId(5)), expected GNodeId(5)
G-parent link: G-node 5's left child 7's parent is Some(GNodeId(6)), expected GNodeId(6)
G-parent link: G-node 8's left child 13's parent is Some(GNodeId(9)), expected GNodeId(9)
G-parent link: G-node 10's left child 15's parent is

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 265 passed; 81 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
