*** packages/mudlark/src/invariants.rs:687:37: replace != with == in check_parent_link_consistency

*** mutation diff:
--- packages/mudlark/src/invariants.rs
+++ replace != with == in check_parent_link_consistency
@@ -679,17 +679,17 @@
     // V-Tree parent links.
     for (idx, v) in graph.vnodes().iter_occupied() {
         let v_id = VNodeId::from_index(idx);
         if let VKind::Structural { children, .. } = &v.kind {
             for i in 0..children.len() {
                 let (child_id, _) = children.get(i);
                 if graph.vnodes().is_occupied(child_id.index()) {
                     let child_parent = graph.vnodes().get(child_id.index()).parent;
-                    if child_parent != Some(v_id) {
+                    if child_parent == /* ~ changed by cargo-mutants ~ */ Some(v_id) {
                         errors.push(format!(
                             "V-parent link: V-node {idx}'s child {}'s parent is {:?}, expected {v_id:?}",
                             child_id.index(),
                             child_parent
                         ));
                     }
                 }
             }

---- tests::decay::decay_energy_conservation_selective stdout ----

thread 'tests::decay::decay_energy_conservation_selective' (3098157) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (33 total):
V-parent link: V-node 4's child 12's parent is Some(VNodeId(5)), expected VNodeId(5)
V-parent link: V-node 4's child 8's parent is Some(VNodeId(5)), expected VNodeId(5)
V-parent link: V-node 4's child 0's parent is Some(VNodeId(5)), expected VNodeId(5)
V-parent link: V-node 8's child 28's parent is Some(VNodeId(9)), expected VNodeId(9)
V-parent link: V-node 8's child 33's parent is Some(VNodeId(9)), expected VNodeId(9)
V-parent link: V-node 11's child 5's parent is Some(VNodeId(12)), expected VNodeId(12)
V-parent link: V-node 11's child 2's parent is Some(VNodeId(12)), expected VNodeId(12)
V-parent link: V-node 12's child 25's parent is Some(VNodeId(13)), expected VNod

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (3098156) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (33 total):
V-parent link: V-node 4's child 12's parent is Some(VNodeId(5)), expected VNodeId(5)
V-parent link: V-node 4's child 8's parent is Some(VNodeId(5)), expected VNodeId(5)
V-parent link: V-node 4's child 0's parent is Some(VNodeId(5)), expected VNodeId(5)
V-parent link: V-node 8's child 28's parent is Some(VNodeId(9)), expected VNodeId(9)
V-parent link: V-node 8's child 33's parent is Some(VNodeId(9)), expected VNodeId(9)
V-parent link: V-node 11's child 5's parent is Some(VNodeId(12)), expected VNodeId(12)
V-parent link: V-node 11's child 2's parent is Some(VNodeId(12)), expected VNodeId(12)
V-parent link: V-node 12's child 25's parent is Some(VNodeId(13)), expected VNodeId(13)
V-parent lin

---- tests::decay::decay_energy_conservation_uniform stdout ----

thread 'tests::decay::decay_energy_conservation_uniform' (3098158) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (33 total):
V-parent link: V-node 4's child 12's parent is Some(VNodeId(5)), expected VNodeId(5)
V-parent link: V-node 4's child 8's parent is Some(VNodeId(5)), expected VNodeId(5)
V-parent link: V-node 4's child 0's parent is Some(VNodeId(5)), expected VNodeId(5)
V-parent link: V-node 8's child 28's parent is Some(VNodeId(9)), expected VNodeId(9)
V-parent link: V-node 8's child 33's parent is Some(VNodeId(9)), expected VNodeId(9)
V-parent link: V-node 11's child 5's parent is Some(VNodeId(12)), expected VNodeId(12)
V-parent link: V-node 11's child 2's parent is Some(VNodeId(12)), expected VNodeId(12)
V-parent link: V-node 12's child 25's parent is Some(VNodeId(13)), expected VNodeId(

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 265 passed; 81 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
