*** packages/mudlark/src/invariants.rs:727:12: delete ! in check_v_root_consistency

*** mutation diff:
--- packages/mudlark/src/invariants.rs
+++ delete ! in check_v_root_consistency
@@ -719,17 +719,17 @@
 
 // ── V-root consistency ──────────────────────────────────────────────
 
 fn check_v_root_consistency<C: Coordinate, V: Accumulator + Inspectable, const N: u32>(
     graph: &GvGraph<C, V, N>,
     errors: &mut Vec<String>,
 ) {
     if let Some(root_id) = graph.v_root() {
-        if !graph.vnodes().is_occupied(root_id.index()) {
+        if  /* ~ changed by cargo-mutants ~ */graph.vnodes().is_occupied(root_id.index()) {
             errors.push(format!("V-root consistency: v_root {} is not occupied", root_id.index()));
             return;
         }
         let root = graph.vnodes().get(root_id.index());
         if root.parent.is_some() {
             errors.push(format!(
                 "V-root consistency: v_root {} has parent {:?}, expected None",
                 root_id.index(),

---- tests::decay::decay_f64_tree stdout ----

thread 'tests::decay::decay_f64_tree' (3104313) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
V-root consistency: v_root 4 is not occupied

---- tests::decay::decay_multiple_selective_preserves_invariants stdout ----

thread 'tests::decay::decay_multiple_selective_preserves_invariants' (3104314) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
V-root consistency: v_root 4 is not occupied

---- tests::decay::decay_multiple_uniform_preserves_invariants stdout ----

thread 'tests::decay::decay_multiple_uniform_preserves_invariants' (3104315) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
V-root consistency: v_root 4 is not occupied

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 257 passed; 89 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
