*** packages/mudlark/src/invariants.rs:764:15: replace != with == in check_terminal_count_consistency

*** mutation diff:
--- packages/mudlark/src/invariants.rs
+++ replace != with == in check_terminal_count_consistency
@@ -756,17 +756,17 @@
 
 fn check_terminal_count_consistency<C: Coordinate, V: Accumulator + Inspectable, const N: u32>(
     graph: &GvGraph<C, V, N>,
     errors: &mut Vec<String>,
 ) {
     #[allow(clippy::cast_possible_truncation)] // arena can't exceed u32::MAX G-nodes
     let actual = graph.gnodes().iter_occupied().filter(|(_, g)| g.is_terminal()).count() as u32;
     let expected = graph.terminal_count();
-    if actual != expected {
+    if actual == /* ~ changed by cargo-mutants ~ */ expected {
         errors.push(format!(
             "Terminal count: graph.terminal_count()={expected}, arena walk={actual}"
         ));
     }
 }
 
 // ── Hard budget (ADR-M-018) ───────────────────────────────────────────

---- tests::decay::decay_amplification_above_one stdout ----

thread 'tests::decay::decay_amplification_above_one' (3108461) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
Terminal count: graph.terminal_count()=10, arena walk=10

---- tests::decay::decay_energy_conservation_selective stdout ----

thread 'tests::decay::decay_energy_conservation_selective' (3108463) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
Terminal count: graph.terminal_count()=10, arena walk=10

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (3108462) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
Terminal count: graph.terminal_count()=10, arena walk=10

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 257 passed; 89 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
