*** packages/mudlark/src/invariants.rs:778:40: replace > with == in check_hard_budget

*** mutation diff:
--- packages/mudlark/src/invariants.rs
+++ replace > with == in check_hard_budget
@@ -770,17 +770,17 @@
 
 // ── Hard budget (ADR-M-018) ───────────────────────────────────────────
 
 fn check_hard_budget<C: Coordinate, V: Accumulator + Inspectable, const N: u32>(
     graph: &GvGraph<C, V, N>,
     errors: &mut Vec<String>,
 ) {
     if let Some(budget) = graph.config().budget {
-        if graph.node_count() as usize > budget {
+        if graph.node_count() as usize == /* ~ changed by cargo-mutants ~ */ budget {
             errors.push(format!(
                 "Hard budget violated (ADR-M-018): node_count ({}) > budget ({})",
                 graph.node_count(),
                 budget
             ));
         }
     }
 }

---- hotspot_under_minimum_budget stdout ----

thread 'hotspot_under_minimum_budget' (3110196) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
Hard budget violated (ADR-M-018): node_count (10) > budget (10)

failures:
    hotspot_under_minimum_budget

test result: FAILED. 23 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
