*** packages/mudlark/src/invariants.rs:799:17: replace >= with < in check_depth_gate_invariants

*** mutation diff:
--- packages/mudlark/src/invariants.rs
+++ replace >= with < in check_depth_gate_invariants
@@ -791,17 +791,17 @@
     graph: &GvGraph<C, V, N>,
     errors: &mut Vec<String>,
 ) {
     let d_create = graph.depth_create();
     let d_evict = graph.depth_evict();
     let buffer = graph.depth_buffer();
 
     // D-I3: D_create < D_evict (strict ordering).
-    if d_create >= d_evict {
+    if d_create < /* ~ changed by cargo-mutants ~ */ d_evict {
         errors.push(format!(
             "D-I3: live_depth_create ({d_create}) must be < live_depth_evict ({d_evict})"
         ));
     }
 
     // Floor: D_evict >= buffer + 1.
     if d_evict < buffer + 1 {
         errors.push(format!(

---- tests::decay::decay_amplification_above_one stdout ----

thread 'tests::decay::decay_amplification_above_one' (3119761) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
D-I3: live_depth_create (3) must be < live_depth_evict (8)

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (3119762) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
D-I3: live_depth_create (3) must be < live_depth_evict (8)

---- tests::decay::decay_energy_conservation_uniform stdout ----

thread 'tests::decay::decay_energy_conservation_uniform' (3119764) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
D-I3: live_depth_create (3) must be < live_depth_evict (8)

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 257 passed; 89 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
