*** packages/mudlark/src/invariants.rs:806:16: replace < with == in check_depth_gate_invariants

*** mutation diff:
--- packages/mudlark/src/invariants.rs
+++ replace < with == in check_depth_gate_invariants
@@ -798,17 +798,17 @@
     // D-I3: D_create < D_evict (strict ordering).
     if d_create >= d_evict {
         errors.push(format!(
             "D-I3: live_depth_create ({d_create}) must be < live_depth_evict ({d_evict})"
         ));
     }
 
     // Floor: D_evict >= buffer + 1.
-    if d_evict < buffer + 1 {
+    if d_evict == /* ~ changed by cargo-mutants ~ */ buffer + 1 {
         errors.push(format!(
             "D-I3 floor: live_depth_evict ({d_evict}) < depth_buffer ({buffer}) + 1"
         ));
     }
 
     // Buffer consistency: D_create == D_evict - buffer.
     // Only check if floor holds (avoids underflow).
     if d_evict >= buffer && d_create != d_evict - buffer {

---- tests::observe::observe_invariants_hold_after_eviction_cycle stdout ----

thread 'tests::observe::observe_invariants_hold_after_eviction_cycle' (3121208) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
D-I3 floor: live_depth_evict (2) < depth_buffer (1) + 1

---- tests::graph::check_evictions_bounded_respects_limit stdout ----

thread 'tests::graph::check_evictions_bounded_respects_limit' (3121159) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
D-I3 floor: live_depth_evict (2) < depth_buffer (1) + 1

---- tests::observe::observe_triggers_eviction_when_over_budget stdout ----

thread 'tests::observe::observe_triggers_eviction_when_over_budget' (3121214) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
D-I3 floor: live_depth_evict (2) < depth_buffer (1) + 1

failures:
    tests::graph::check_evictions_bounded_respects_limit
    tests::graph::check_evictions_trailing_rebalance_clears_violations
    tests::graph::check_evictions_unbounded_evicts_all
    tests::graph::get_semi_internal_depth_is_trimmed_depth
    tests::graph::get_semi_internal_left_child_trims_right
    tests::graph::get_semi_internal_right_child_trims_left
    tests::observe::observe_invariants_hold_after_eviction_cycle
    tests::observe::observe_triggers_eviction_when_over_budget
    tests::observe::observe_violations_empty_after_eviction
    tests::split::depth_gate_rejects_deep_split
    tests::structural::semi_internal_surviving_child_unaffected

test result: FAILED. 335 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
