*** packages/mudlark/src/invariants.rs:806:16: replace < with > in check_depth_gate_invariants

*** mutation diff:
--- packages/mudlark/src/invariants.rs
+++ replace < with > in check_depth_gate_invariants
@@ -798,17 +798,17 @@
     // D-I3: D_create < D_evict (strict ordering).
     if d_create >= d_evict {
         errors.push(format!(
             "D-I3: live_depth_create ({d_create}) must be < live_depth_evict ({d_evict})"
         ));
     }
 
     // Floor: D_evict >= buffer + 1.
-    if d_evict < buffer + 1 {
+    if d_evict > /* ~ changed by cargo-mutants ~ */ buffer + 1 {
         errors.push(format!(
             "D-I3 floor: live_depth_evict ({d_evict}) < depth_buffer ({buffer}) + 1"
         ));
     }
 
     // Buffer consistency: D_create == D_evict - buffer.
     // Only check if floor holds (avoids underflow).
     if d_evict >= buffer && d_create != d_evict - buffer {

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (3125352) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
D-I3 floor: live_depth_evict (8) < depth_buffer (5) + 1

---- tests::decay::decay_amplification_above_one stdout ----

thread 'tests::decay::decay_amplification_above_one' (3125351) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
D-I3 floor: live_depth_evict (8) < depth_buffer (5) + 1

---- tests::decay::decay_energy_conservation_selective stdout ----

thread 'tests::decay::decay_energy_conservation_selective' (3125353) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
D-I3 floor: live_depth_evict (8) < depth_buffer (5) + 1

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 267 passed; 79 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
