*** packages/mudlark/src/invariants.rs:806:25: replace + with * in check_depth_gate_invariants

*** mutation diff:
--- packages/mudlark/src/invariants.rs
+++ replace + with * in check_depth_gate_invariants
@@ -798,17 +798,17 @@
     // D-I3: D_create < D_evict (strict ordering).
     if d_create >= d_evict {
         errors.push(format!(
             "D-I3: live_depth_create ({d_create}) must be < live_depth_evict ({d_evict})"
         ));
     }
 
     // Floor: D_evict >= buffer + 1.
-    if d_evict < buffer + 1 {
+    if d_evict < buffer * /* ~ changed by cargo-mutants ~ */ 1 {
         errors.push(format!(
             "D-I3 floor: live_depth_evict ({d_evict}) < depth_buffer ({buffer}) + 1"
         ));
     }
 
     // Buffer consistency: D_create == D_evict - buffer.
     // Only check if floor holds (avoids underflow).
     if d_evict >= buffer && d_create != d_evict - buffer {

*** result: Success
