*** packages/mudlark/src/invariants.rs:814:49: replace - with + in check_depth_gate_invariants

*** mutation diff:
--- packages/mudlark/src/invariants.rs
+++ replace - with + in check_depth_gate_invariants
@@ -806,17 +806,17 @@
     if d_evict < buffer + 1 {
         errors.push(format!(
             "D-I3 floor: live_depth_evict ({d_evict}) < depth_buffer ({buffer}) + 1"
         ));
     }
 
     // Buffer consistency: D_create == D_evict - buffer.
     // Only check if floor holds (avoids underflow).
-    if d_evict >= buffer && d_create != d_evict - buffer {
+    if d_evict >= buffer && d_create != d_evict + /* ~ changed by cargo-mutants ~ */ buffer {
         errors.push(format!(
             "D-I3 buffer: live_depth_create ({d_create}) != live_depth_evict ({d_evict}) - depth_buffer ({buffer})"
         ));
     }
 }
 
 // ══════════════════════════════════════════════════════════════════════
 // Plateau invariant checks (ADR-M-026, Step 2F)

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (3156199) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
D-I3 buffer: live_depth_create (3) != live_depth_evict (8) - depth_buffer (5)

---- tests::decay::decay_panics_negative_attenuation stdout ----

thread 'tests::decay::decay_panics_negative_attenuation' (3156208) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
D-I3 buffer: live_depth_create (3) != live_depth_evict (8) - depth_buffer (5)
note: panic did not contain expected string
      panic message: "Invariant violations (1 total):\nD-I3 buffer: live_depth_create (3) != live_depth_evict (8) - depth_buffer (5)"
 expected substring: "attenuation must be > 0"

---- tests::decay::decay_panics_nan_q stdout ----

thread 'tests::decay::decay_panics_nan_q' (3156207) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
D-I3 buffer: live_depth_create (3) != live_depth_evict (8) - depth_buffer (5)
note: panic did not contain expected string
      panic message: "Invariant violations (1 total):\nD-I3 buffer: live_depth_create (3) != live_depth_evict (8) - depth_buffer (5)"
 expected substring: "q must be in"

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 257 passed; 89 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
