*** packages/mudlark/src/invariants.rs:834:31: replace != with == in check_plateau_btreemap_key_consistency

*** mutation diff:
--- packages/mudlark/src/invariants.rs
+++ replace != with == in check_plateau_btreemap_key_consistency
@@ -826,17 +826,17 @@
 
 /// For each `(key, plateau)` in the `BTreeMap`: `plateau.basis_edge == key`.
 #[cfg(feature = "dynamic-contour-tracking")]
 fn check_plateau_btreemap_key_consistency<C: Coordinate, V: Accumulator + Inspectable, const N: u32>(
     graph: &GvGraph<C, V, N>,
     errors: &mut Vec<String>,
 ) {
     for (&key, plateau) in &graph.plateaus {
-        if plateau.basis_edge != key {
+        if plateau.basis_edge == /* ~ changed by cargo-mutants ~ */ key {
             errors.push(format!(
                 "Plateau key consistency: BTreeMap key {key:?} != plateau.basis_edge {:?}",
                 plateau.basis_edge
             ));
         }
     }
 }

---- tests::decay::decay_multiple_selective_preserves_invariants stdout ----

thread 'tests::decay::decay_multiple_selective_preserves_invariants' (3162907) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (7 total):
Plateau key consistency: BTreeMap key BasisEdge(0) != plateau.basis_edge BasisEdge(0)
Plateau key consistency: BTreeMap key BasisEdge(2) != plateau.basis_edge BasisEdge(2)
Plateau key consistency: BTreeMap key BasisEdge(4) != plateau.basis_edge BasisEdge(4)
Plateau key consistency: BTreeMap key BasisEdge(8) != plateau.basis_edge BasisEdge(8)
Plateau key consistency: BTreeMap key BasisEdge(10) != plateau.basis_edge BasisEdge(10)
Plateau key consistency: BTreeMap key BasisEdge(12) != plateau.basis_edge BasisEdge(12)
Plateau key consistency: BTreeMap key BasisEdge(14) != plateau.basis_edge BasisEdge(14)

---- tests::decay::decay_energy_conservation_uniform stdout ----

thread 'tests::decay::decay_energy_conservation_uniform' (3162905) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (7 total):
Plateau key consistency: BTreeMap key BasisEdge(0) != plateau.basis_edge BasisEdge(0)
Plateau key consistency: BTreeMap key BasisEdge(2) != plateau.basis_edge BasisEdge(2)
Plateau key consistency: BTreeMap key BasisEdge(4) != plateau.basis_edge BasisEdge(4)
Plateau key consistency: BTreeMap key BasisEdge(8) != plateau.basis_edge BasisEdge(8)
Plateau key consistency: BTreeMap key BasisEdge(10) != plateau.basis_edge BasisEdge(10)
Plateau key consistency: BTreeMap key BasisEdge(12) != plateau.basis_edge BasisEdge(12)
Plateau key consistency: BTreeMap key BasisEdge(14) != plateau.basis_edge BasisEdge(14)

---- tests::decay::decay_multiple_uniform_preserves_invariants stdout ----

thread 'tests::decay::decay_multiple_uniform_preserves_invariants' (3162908) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (7 total):
Plateau key consistency: BTreeMap key BasisEdge(0) != plateau.basis_edge BasisEdge(0)
Plateau key consistency: BTreeMap key BasisEdge(2) != plateau.basis_edge BasisEdge(2)
Plateau key consistency: BTreeMap key BasisEdge(4) != plateau.basis_edge BasisEdge(4)
Plateau key consistency: BTreeMap key BasisEdge(8) != plateau.basis_edge BasisEdge(8)
Plateau key consistency: BTreeMap key BasisEdge(10) != plateau.basis_edge BasisEdge(10)
Plateau key consistency: BTreeMap key BasisEdge(12) != plateau.basis_edge BasisEdge(12)
Plateau key consistency: BTreeMap key BasisEdge(14) != plateau.basis_edge BasisEdge(14)

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 257 passed; 89 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
