*** packages/mudlark/src/invariants.rs:862:16: delete ! in check_plateau_basis_consistency

*** mutation diff:
--- packages/mudlark/src/invariants.rs
+++ delete ! in check_plateau_basis_consistency
@@ -854,17 +854,17 @@
     errors: &mut Vec<String>,
 ) {
     let pb = graph.plateau_basis();
 
     // Forward → back consistency + liveness.
     for (&key, gnodes) in pb.iter() {
         for &gid in gnodes {
             // Liveness check.
-            if !graph.gnodes().is_occupied(gid.index()) {
+            if  /* ~ changed by cargo-mutants ~ */graph.gnodes().is_occupied(gid.index()) {
                 errors.push(format!(
                     "Plateau basis: basis element {gid:?} in plateau {key:?} is not a live arena slot"
                 ));
                 continue;
             }
             // Back-pointer check.
             match pb.plateau_key(gid) {
                 Some(back_key) if back_key == key => {} // OK

---- tests::decay::decay_amplification_above_one stdout ----

thread 'tests::decay::decay_amplification_above_one' (3165768) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (7 total):
Plateau basis: basis element GNodeId(8) in plateau BasisEdge(0) is not a live arena slot
Plateau basis: basis element GNodeId(9) in plateau BasisEdge(2) is not a live arena slot
Plateau basis: basis element GNodeId(7) in plateau BasisEdge(4) is not a live arena slot
Plateau basis: basis element GNodeId(10) in plateau BasisEdge(8) is not a live arena slot
Plateau basis: basis element GNodeId(11) in plateau BasisEdge(10) is not a live arena slot
Plateau basis: basis element GNodeId(12) in plateau BasisEdge(12) is not a live arena slot
Plateau basis: basis element GNodeId(13) in plateau BasisEdge(14) is not a live arena slot

---- tests::decay::decay_energy_conservation_uniform stdout ----

thread 'tests::decay::decay_energy_conservation_uniform' (3165771) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (7 total):
Plateau basis: basis element GNodeId(8) in plateau BasisEdge(0) is not a live arena slot
Plateau basis: basis element GNodeId(9) in plateau BasisEdge(2) is not a live arena slot
Plateau basis: basis element GNodeId(7) in plateau BasisEdge(4) is not a live arena slot
Plateau basis: basis element GNodeId(10) in plateau BasisEdge(8) is not a live arena slot
Plateau basis: basis element GNodeId(11) in plateau BasisEdge(10) is not a live arena slot
Plateau basis: basis element GNodeId(12) in plateau BasisEdge(12) is not a live arena slot
Plateau basis: basis element GNodeId(13) in plateau BasisEdge(14) is not a live arena slot

---- tests::decay::decay_energy_conservation_selective stdout ----

thread 'tests::decay::decay_energy_conservation_selective' (3165770) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (7 total):
Plateau basis: basis element GNodeId(8) in plateau BasisEdge(0) is not a live arena slot
Plateau basis: basis element GNodeId(9) in plateau BasisEdge(2) is not a live arena slot
Plateau basis: basis element GNodeId(7) in plateau BasisEdge(4) is not a live arena slot
Plateau basis: basis element GNodeId(10) in plateau BasisEdge(8) is not a live arena slot
Plateau basis: basis element GNodeId(11) in plateau BasisEdge(10) is not a live arena slot
Plateau basis: basis element GNodeId(12) in plateau BasisEdge(12) is not a live arena slot
Plateau basis: basis element GNodeId(13) in plateau BasisEdge(14) is not a live arena slot

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 257 passed; 89 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
