*** packages/mudlark/src/invariants.rs:870:44: replace == with != in check_plateau_basis_consistency

*** mutation diff:
--- packages/mudlark/src/invariants.rs
+++ replace == with != in check_plateau_basis_consistency
@@ -862,17 +862,17 @@
             if !graph.gnodes().is_occupied(gid.index()) {
                 errors.push(format!(
                     "Plateau basis: basis element {gid:?} in plateau {key:?} is not a live arena slot"
                 ));
                 continue;
             }
             // Back-pointer check.
             match pb.plateau_key(gid) {
-                Some(back_key) if back_key == key => {} // OK
+                Some(back_key) if back_key != /* ~ changed by cargo-mutants ~ */ key => {} // OK
                 Some(back_key) => {
                     errors.push(format!(
                         "Plateau basis forward→back: {gid:?} in forward[{key:?}] but back[{gid:?}] = {back_key:?}"
                     ));
                 }
                 None => {
                     errors.push(format!(
                         "Plateau basis forward→back: {gid:?} in forward[{key:?}] but not in back map"

---- tests::decay::decay_f64_tree stdout ----

thread 'tests::decay::decay_f64_tree' (3166870) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (6 total):
Plateau basis forward→back: GNodeId(8) in forward[BasisEdge(0.0)] but back[GNodeId(8)] = BasisEdge(0.0)
Plateau basis forward→back: GNodeId(10) in forward[BasisEdge(2.0)] but back[GNodeId(10)] = BasisEdge(2.0)
Plateau basis forward→back: GNodeId(11) in forward[BasisEdge(3.0)] but back[GNodeId(11)] = BasisEdge(3.0)
Plateau basis forward→back: GNodeId(5) in forward[BasisEdge(4.0)] but back[GNodeId(5)] = BasisEdge(4.0)
Plateau basis forward→back: GNodeId(6) in forward[BasisEdge(8.0)] but back[GNodeId(6)] = BasisEdge(8.0)
Plateau basis forward→back: GNodeId(7) in forward[BasisEdge(12.0)] but back[GNodeId(7)] = BasisEdge(12.0)

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (3166867) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (7 total):
Plateau basis forward→back: GNodeId(8) in forward[BasisEdge(0)] but back[GNodeId(8)] = BasisEdge(0)
Plateau basis forward→back: GNodeId(9) in forward[BasisEdge(2)] but back[GNodeId(9)] = BasisEdge(2)
Plateau basis forward→back: GNodeId(7) in forward[BasisEdge(4)] but back[GNodeId(7)] = BasisEdge(4)
Plateau basis forward→back: GNodeId(10) in forward[BasisEdge(8)] but back[GNodeId(10)] = BasisEdge(8)
Plateau basis forward→back: GNodeId(11) in forward[BasisEdge(10)] but back[GNodeId(11)] = BasisEdge(10)
Plateau basis forward→back: GNodeId(12) in forward[BasisEdge(12)] but back[GNodeId(12)] = BasisEdge(12)
Plateau basis forward→back: GNodeId(13) in forward[BasisEdge(14)] but back[GNodeId(13)]

---- tests::decay::decay_energy_conservation_selective stdout ----

thread 'tests::decay::decay_energy_conservation_selective' (3166868) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (7 total):
Plateau basis forward→back: GNodeId(8) in forward[BasisEdge(0)] but back[GNodeId(8)] = BasisEdge(0)
Plateau basis forward→back: GNodeId(9) in forward[BasisEdge(2)] but back[GNodeId(9)] = BasisEdge(2)
Plateau basis forward→back: GNodeId(7) in forward[BasisEdge(4)] but back[GNodeId(7)] = BasisEdge(4)
Plateau basis forward→back: GNodeId(10) in forward[BasisEdge(8)] but back[GNodeId(10)] = BasisEdge(8)
Plateau basis forward→back: GNodeId(11) in forward[BasisEdge(10)] but back[GNodeId(11)] = BasisEdge(10)
Plateau basis forward→back: GNodeId(12) in forward[BasisEdge(12)] but back[GNodeId(12)] = BasisEdge(12)
Plateau basis forward→back: GNodeId(13) in forward[BasisEdge(14)] bu

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 257 passed; 89 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
