*** packages/mudlark/src/invariants.rs:888:12: delete ! in check_plateau_basis_consistency

*** mutation diff:
--- packages/mudlark/src/invariants.rs
+++ delete ! in check_plateau_basis_consistency
@@ -880,17 +880,17 @@
                 }
             }
         }
     }
 
     // Back → forward consistency.
     for (&gid, &key) in pb.back_map() {
         let elements = pb.basis_elements(&key);
-        if !elements.contains(&gid) {
+        if  /* ~ changed by cargo-mutants ~ */elements.contains(&gid) {
             errors.push(format!(
                 "Plateau basis back→forward: back[{gid:?}] = {key:?} but {gid:?} not in forward[{key:?}]"
             ));
         }
     }
 
     // plateaus.keys() == plateau_basis.forward.keys()
     let btree_keys: Vec<_> = graph.plateaus.keys().copied().collect();

---- tests::decay::decay_noop_at_attenuation_one stdout ----

thread 'tests::decay::decay_noop_at_attenuation_one' (3168873) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (7 total):
Plateau basis back→forward: back[GNodeId(7)] = BasisEdge(4) but GNodeId(7) not in forward[BasisEdge(4)]
Plateau basis back→forward: back[GNodeId(10)] = BasisEdge(8) but GNodeId(10) not in forward[BasisEdge(8)]
Plateau basis back→forward: back[GNodeId(13)] = BasisEdge(14) but GNodeId(13) not in forward[BasisEdge(14)]
Plateau basis back→forward: back[GNodeId(11)] = BasisEdge(10) but GNodeId(11) not in forward[BasisEdge(10)]
Plateau basis back→forward: back[GNodeId(12)] = BasisEdge(12) but GNodeId(12) not in forward[BasisEdge(12)]
Plateau basis back→forward: back[GNodeId(9)] = BasisEdge(2) but GNodeId(9) not in forward[BasisEdge(2)]
Plateau basis back→forward: back[GNodeId(8)] = Basis

---- tests::decay::decay_energy_conservation_uniform stdout ----

thread 'tests::decay::decay_energy_conservation_uniform' (3168869) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (7 total):
Plateau basis back→forward: back[GNodeId(10)] = BasisEdge(8) but GNodeId(10) not in forward[BasisEdge(8)]
Plateau basis back→forward: back[GNodeId(7)] = BasisEdge(4) but GNodeId(7) not in forward[BasisEdge(4)]
Plateau basis back→forward: back[GNodeId(12)] = BasisEdge(12) but GNodeId(12) not in forward[BasisEdge(12)]
Plateau basis back→forward: back[GNodeId(13)] = BasisEdge(14) but GNodeId(13) not in forward[BasisEdge(14)]
Plateau basis back→forward: back[GNodeId(11)] = BasisEdge(10) but GNodeId(11) not in forward[BasisEdge(10)]
Plateau basis back→forward: back[GNodeId(8)] = BasisEdge(0) but GNodeId(8) not in forward[BasisEdge(0)]
Plateau basis back→forward: back[GNodeId(9)]

---- tests::decay::decay_f64_tree stdout ----

thread 'tests::decay::decay_f64_tree' (3168870) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (6 total):
Plateau basis back→forward: back[GNodeId(10)] = BasisEdge(2.0) but GNodeId(10) not in forward[BasisEdge(2.0)]
Plateau basis back→forward: back[GNodeId(6)] = BasisEdge(8.0) but GNodeId(6) not in forward[BasisEdge(8.0)]
Plateau basis back→forward: back[GNodeId(5)] = BasisEdge(4.0) but GNodeId(5) not in forward[BasisEdge(4.0)]
Plateau basis back→forward: back[GNodeId(11)] = BasisEdge(3.0) but GNodeId(11) not in forward[BasisEdge(3.0)]
Plateau basis back→forward: back[GNodeId(7)] = BasisEdge(12.0) but GNodeId(7) not in forward[BasisEdge(12.0)]
Plateau basis back→forward: back[GNodeId(8)] = BasisEdge(0.0) but GNodeId(8) not in forward[BasisEdge(0.0)]

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 257 passed; 89 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
