*** packages/mudlark/src/invariants.rs:898:19: replace != with == in check_plateau_basis_consistency

*** mutation diff:
--- packages/mudlark/src/invariants.rs
+++ replace != with == in check_plateau_basis_consistency
@@ -890,17 +890,17 @@
                 "Plateau basis back→forward: back[{gid:?}] = {key:?} but {gid:?} not in forward[{key:?}]"
             ));
         }
     }
 
     // plateaus.keys() == plateau_basis.forward.keys()
     let btree_keys: Vec<_> = graph.plateaus.keys().copied().collect();
     let basis_keys: Vec<_> = pb.iter().map(|(&k, _)| k).collect();
-    if btree_keys != basis_keys {
+    if btree_keys == /* ~ changed by cargo-mutants ~ */ basis_keys {
         errors.push(format!(
             "Plateau basis: plateaus.keys() ({} entries) != plateau_basis.forward.keys() ({} entries)",
             btree_keys.len(),
             basis_keys.len()
         ));
     }
 }

---- tests::decay::decay_f64_tree stdout ----

thread 'tests::decay::decay_f64_tree' (3173876) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
Plateau basis: plateaus.keys() (6 entries) != plateau_basis.forward.keys() (6 entries)

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (3173873) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
Plateau basis: plateaus.keys() (7 entries) != plateau_basis.forward.keys() (7 entries)

---- tests::decay::decay_energy_conservation_selective stdout ----

thread 'tests::decay::decay_energy_conservation_selective' (3173874) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
Plateau basis: plateaus.keys() (7 entries) != plateau_basis.forward.keys() (7 entries)

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 257 passed; 89 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
