*** packages/mudlark/src/invariants.rs:924:22: replace - with / in check_plateau_sum_consistency

*** mutation diff:
--- packages/mudlark/src/invariants.rs
+++ replace - with / in check_plateau_sum_consistency
@@ -916,17 +916,17 @@
     for (&key, plateau) in &graph.plateaus {
         let expected: f64 = pb
             .basis_elements(&key)
             .iter()
             .filter(|&&gid| graph.gnodes().is_occupied(gid.index()))
             .map(|&gid| graph.gnodes().get(gid.index()).sum.to_f64_approx())
             .sum();
         let actual = plateau.sum.to_f64_approx();
-        if (expected - actual).abs() > 1e-9 {
+        if (expected / /* ~ changed by cargo-mutants ~ */ actual).abs() > 1e-9 {
             errors.push(format!(
                 "Plateau sum: key {key:?}: expected sum={expected}, actual sum={actual}"
             ));
         }
     }
 }
 
 // ── Plateau depth consistency ───────────────────────────────────────

---- tests::decay::decay_f64_tree stdout ----

thread 'tests::decay::decay_f64_tree' (3194617) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (2 total):
Plateau sum: key BasisEdge(2.0): expected sum=40, actual sum=40
Plateau sum: key BasisEdge(8.0): expected sum=40, actual sum=40

---- tests::decay::decay_amplification_above_one stdout ----

thread 'tests::decay::decay_amplification_above_one' (3194613) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (3 total):
Plateau sum: key BasisEdge(2): expected sum=70, actual sum=70
Plateau sum: key BasisEdge(10): expected sum=35, actual sum=35
Plateau sum: key BasisEdge(14): expected sum=21, actual sum=21

---- tests::decay::decay_energy_conservation_uniform stdout ----

thread 'tests::decay::decay_energy_conservation_uniform' (3194616) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (3 total):
Plateau sum: key BasisEdge(2): expected sum=70, actual sum=70
Plateau sum: key BasisEdge(10): expected sum=35, actual sum=35
Plateau sum: key BasisEdge(14): expected sum=21, actual sum=21

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 257 passed; 89 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
