*** packages/mudlark/src/invariants.rs:966:31: replace != with == in check_plateau_depth_consistency

*** mutation diff:
--- packages/mudlark/src/invariants.rs
+++ replace != with == in check_plateau_depth_consistency
@@ -958,17 +958,17 @@
                              uniform_contour_depth_of returned None — internal basis \
                              element has non-uniform contour depth",
                         ));
                         continue;
                     };
                     d
                 }
             };
-            if expected_depth != plateau.depth {
+            if expected_depth == /* ~ changed by cargo-mutants ~ */ plateau.depth {
                 errors.push(format!(
                     "Plateau depth: key {key:?}, basis element {gid:?} ({:?}): \
                      element contributes depth {expected_depth}, plateau.depth={}",
                     g.state(),
                     plateau.depth,
                 ));
             }
         }

---- tests::decay::decay_f64_tree stdout ----

thread 'tests::decay::decay_f64_tree' (3203618) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (6 total):
Plateau depth: key BasisEdge(0.0), basis element GNodeId(8) (Terminal): element contributes depth 3, plateau.depth=3
Plateau depth: key BasisEdge(2.0), basis element GNodeId(10) (Internal): element contributes depth 5, plateau.depth=5
Plateau depth: key BasisEdge(3.0), basis element GNodeId(11) (Terminal): element contributes depth 4, plateau.depth=4
Plateau depth: key BasisEdge(4.0), basis element GNodeId(5) (Terminal): element contributes depth 2, plateau.depth=2
Plateau depth: key BasisEdge(8.0), basis element GNodeId(6) (Internal): element contributes depth 3, plateau.depth=3
Plateau depth: key BasisEdge(12.0), basis element GNodeId(7) (Terminal): element contributes depth 2, plateau.depth=2

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (3203615) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (7 total):
Plateau depth: key BasisEdge(0), basis element GNodeId(8) (Terminal): element contributes depth 3, plateau.depth=3
Plateau depth: key BasisEdge(2), basis element GNodeId(9) (Internal): element contributes depth 4, plateau.depth=4
Plateau depth: key BasisEdge(4), basis element GNodeId(7) (Terminal): element contributes depth 2, plateau.depth=2
Plateau depth: key BasisEdge(8), basis element GNodeId(10) (Terminal): element contributes depth 3, plateau.depth=3
Plateau depth: key BasisEdge(10), basis element GNodeId(11) (Internal): element contributes depth 4, plateau.depth=4
Plateau depth: key BasisEdge(12), basis element GNodeId(12) (Terminal): element contributes depth 3, plateau.depth=3
Pla

---- tests::decay::decay_amplification_above_one stdout ----

thread 'tests::decay::decay_amplification_above_one' (3203614) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (7 total):
Plateau depth: key BasisEdge(0), basis element GNodeId(8) (Terminal): element contributes depth 3, plateau.depth=3
Plateau depth: key BasisEdge(2), basis element GNodeId(9) (Internal): element contributes depth 4, plateau.depth=4
Plateau depth: key BasisEdge(4), basis element GNodeId(7) (Terminal): element contributes depth 2, plateau.depth=2
Plateau depth: key BasisEdge(8), basis element GNodeId(10) (Terminal): element contributes depth 3, plateau.depth=3
Plateau depth: key BasisEdge(10), basis element GNodeId(11) (Internal): element contributes depth 4, plateau.depth=4
Plateau depth: key BasisEdge(12), basis element GNodeId(12) (Terminal): element contributes depth 3, plateau.dep

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 257 passed; 89 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
