*** packages/mudlark/src/observe.rs:114:12: delete ! in GvGraph<C, V, N>::observe

*** mutation diff:
--- packages/mudlark/src/observe.rs
+++ delete ! in GvGraph<C, V, N>::observe
@@ -106,17 +106,17 @@
 
         // 6. Drain violation queue.
         let new_gnodes = rebalance::rebalance(
             &mut self.vnodes,
             &mut self.gnodes,
             &mut self.violations,
             self.live_depth_evict,
         );
-        if !new_gnodes.is_empty() {
+        if  /* ~ changed by cargo-mutants ~ */new_gnodes.is_empty() {
             self.handle_legacy_promotes(&new_gnodes);
             self.repair_p_i4();
         }
 
         #[cfg(feature = "dynamic-contour-tracking")]
         if cfg!(debug_assertions) || tracing::enabled!(tracing::Level::DEBUG) {
             self.debug_assert_plateau_mirror_consistency("POST-REBALANCE");
         }

---- tests::observe::observe_invariants_hold_after_eviction_cycle stdout ----
2026-03-16T21:30:14.849320Z ERROR torrust_mudlark::graph_plateau: PLATEAU DIVERGENCE DETECTED label="POST-REBALANCE" only_dynamic=[] only_static=[] differing=[BasisEdge(8)]
2026-03-16T21:30:14.849341Z ERROR torrust_mudlark::graph_plateau: DIFFERS key=BasisEdge(8) dyn_depth=0 dyn_start=0 dyn_end=16 dyn_sum=33 stat_depth=1 stat_start=8 stat_end=16 stat_sum=0 basis=[0]
2026-03-16T21:30:14.849347Z ERROR torrust_mudlark::graph_plateau:   basis element gid=0 state=Internal lo=0 hi=16 sum=33 uniform_depth=None
2026-03-16T21:30:14.849369Z ERROR torrust_mudlark::graph_plateau: G-TREE DUMP dump=═══ G-Tree dump (root=GNodeId(0), 5 nodes) ═══
  G(  0) I [   0.0,   16.0)  d=0  par=None  L=1 R=5  sum=    33.0 own=    15.0  basis=BasisEdge(8)
  G(  1) S [   0.0,    8.0)  d=1  par=0  L=_ R=4  sum=    18.0 own=     6.0  basis=B

---- tests::observe::observe_violations_empty_after_eviction stdout ----
2026-03-16T21:30:14.851360Z ERROR torrust_mudlark::graph_plateau: PLATEAU DIVERGENCE DETECTED label="POST-REBALANCE" only_dynamic=[BasisEdge(4)] only_static=[] differing=[BasisEdge(0)]
2026-03-16T21:30:14.851376Z ERROR torrust_mudlark::graph_plateau: DYNAMIC-ONLY plateau key=BasisEdge(4) depth=2 start=4 end=8 sum=0 basis=[4]
2026-03-16T21:30:14.851380Z ERROR torrust_mudlark::graph_plateau:   basis element gid=4 state=Terminal lo=4 hi=8 sum=0
2026-03-16T21:30:14.851383Z ERROR torrust_mudlark::graph_plateau: DIFFERS key=BasisEdge(0) dyn_depth=1 dyn_start=0 dyn_end=8 dyn_sum=12 stat_depth=2 stat_start=0 stat_end=8 stat_sum=12 basis=[1]
2026-03-16T21:30:14.851387Z ERROR torrust_mudlark::graph_plateau:   basis element gid=1 state=Internal lo=0 hi=8 sum=12 uniform_depth=Some(2)
2026-03-16T21:30:14.854710Z ERROR torrust_mu

---- tests::structural::semi_internal_surviving_child_unaffected stdout ----
2026-03-16T21:30:14.880982Z ERROR torrust_mudlark::graph_plateau: PLATEAU DIVERGENCE DETECTED label="POST-REBALANCE" only_dynamic=[] only_static=[] differing=[BasisEdge(16)]
2026-03-16T21:30:14.880998Z ERROR torrust_mudlark::graph_plateau: DIFFERS key=BasisEdge(16) dyn_depth=3 dyn_start=0 dyn_end=32 dyn_sum=114 stat_depth=4 stat_start=16 stat_end=32 stat_sum=0 basis=[5]
2026-03-16T21:30:14.881004Z ERROR torrust_mudlark::graph_plateau:   basis element gid=5 state=Internal lo=0 hi=32 sum=114 uniform_depth=None
2026-03-16T21:30:14.881032Z ERROR torrust_mudlark::graph_plateau: G-TREE DUMP dump=═══ G-Tree dump (root=GNodeId(0), 6 nodes) ═══
  G(  0) S [   0.0,  256.0)  d=0  par=None  L=1 R=_  sum=   132.0 own=     6.0  basis=BasisEdge(128)
  G(  1) S [   0.0,  128.0)  d=1  par=0  L=3 R=_  sum=   126.0 own=     6.0  b

failures:
    tests::observe::observe_invariants_hold_after_eviction_cycle
    tests::observe::observe_violations_empty_after_eviction
    tests::structural::semi_internal_surviving_child_unaffected

test result: FAILED. 343 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.11s

*** result: Failure(101)
