*** packages/mudlark/src/observe.rs:129:41: replace > with == in GvGraph<C, V, N>::observe

*** mutation diff:
--- packages/mudlark/src/observe.rs
+++ replace > with == in GvGraph<C, V, N>::observe
@@ -121,17 +121,17 @@
             self.debug_assert_plateau_mirror_consistency("POST-REBALANCE");
         }
 
         // 7. Dynamic depth control (§IDEA M-7.1, ADR-M-017).
         self.adjust_depth_gates();
 
         // 8. Budget-guarded eviction (ADR-M-015, ADR-M-018).
         if let Some(soft_limit) = self.soft_limit {
-            if self.node_count as usize > soft_limit {
+            if self.node_count as usize == /* ~ changed by cargo-mutants ~ */ soft_limit {
                 if self.config.bounded_eviction {
                     self.check_evictions_bounded(self.node_count as usize - soft_limit);
                 } else {
                     self.check_evictions();
                 }
             }
         }

---- tests::diagnostic::catalytic_split_creates_span stdout ----

thread 'tests::diagnostic::catalytic_split_creates_span' (2337810) panicked at packages/mudlark/src/tests/diagnostic.rs:310:5:
expected 'catalytic_split' span in: ["observe", "bootstrap_split", "plateau_after_bootstrap_split", "observe", "observe"]

---- tests::diagnostic::vtree_remove_leaf_creates_span stdout ----

thread 'tests::diagnostic::vtree_remove_leaf_creates_span' (2337840) panicked at packages/mudlark/src/tests/diagnostic.rs:413:5:

---- tests::diagnostic::evict_tip_creates_span stdout ----

thread 'tests::diagnostic::evict_tip_creates_span' (2337815) panicked at packages/mudlark/src/tests/diagnostic.rs:348:5:

failures:
    tests::diagnostic::catalytic_split_creates_span
    tests::diagnostic::evict_tip_creates_span
    tests::diagnostic::eviction_pipeline_creates_spans
    tests::diagnostic::vtree_remove_leaf_creates_span

test result: FAILED. 342 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.21s

*** result: Failure(101)
