*** packages/mudlark/src/observe.rs:131:75: replace - with / in GvGraph<C, V, N>::observe

*** mutation diff:
--- packages/mudlark/src/observe.rs
+++ replace - with / in GvGraph<C, V, N>::observe
@@ -123,17 +123,17 @@
 
         // 7. Dynamic depth control (§IDEA M-7.1, ADR-M-017).
         self.adjust_depth_gates();
 
         // 8. Budget-guarded eviction (ADR-M-015, ADR-M-018).
         if let Some(soft_limit) = self.soft_limit {
             if self.node_count as usize > soft_limit {
                 if self.config.bounded_eviction {
-                    self.check_evictions_bounded(self.node_count as usize - soft_limit);
+                    self.check_evictions_bounded(self.node_count as usize / /* ~ changed by cargo-mutants ~ */ soft_limit);
                 } else {
                     self.check_evictions();
                 }
             }
         }
 
         // 9. [ADR-M-031] Normalize plateau map — gated behind dirty
         //    flag so it's O(1) no-op for simple observations that

*** result: Success
