*** packages/mudlark/src/pewei.rs:196:9: replace Pewei<C, V>::layer_count -> usize with 1

*** mutation diff:
--- packages/mudlark/src/pewei.rs
+++ replace Pewei<C, V>::layer_count -> usize with 1
@@ -188,17 +188,17 @@
     /// # let mut g = GvGraph::<u64, u64, 8>::new(cfg);
     /// # g.observe(42, 10u64);
     /// let pewei = g.extract();
     /// assert!(pewei.layer_count() >= 1);
     /// ```
     #[inline]
     #[must_use]
     pub fn layer_count(&self) -> usize {
-        self.layers.len()
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Total number of nodes (transitions + terminals) across all layers.
     ///
     /// # Examples
     ///
     /// ```
     /// # use torrust_mudlark::{Config, GvGraph};

---- tests::pewei::empty_pewei_counts stdout ----

thread 'tests::pewei::empty_pewei_counts' (724657) panicked at packages/mudlark/src/tests/pewei.rs:90:5:
assertion `left == right` failed
  left: 1
 right: 0

---- tests::pewei::pewei_node_count_and_energy stdout ----

thread 'tests::pewei::pewei_node_count_and_energy' (724658) panicked at packages/mudlark/src/tests/pewei.rs:134:5:
assertion `left == right` failed
  left: 1
 right: 2

---- tests::structural::extract_multi_node_classification stdout ----

thread 'tests::structural::extract_multi_node_classification' (724776) panicked at packages/mudlark/src/tests/structural.rs:79:5:
multi-node tree should produce multiple layers

failures:
    tests::pewei::empty_pewei_counts
    tests::pewei::pewei_node_count_and_energy
    tests::structural::extract_multi_node_classification

test result: FAILED. 343 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
