*** packages/mudlark/src/pewei.rs:220:56: replace + with - in Pewei<C, V>::node_count

*** mutation diff:
--- packages/mudlark/src/pewei.rs
+++ replace + with - in Pewei<C, V>::node_count
@@ -212,17 +212,17 @@
     /// # };
     /// # let mut g = GvGraph::<u64, u64, 8>::new(cfg);
     /// # g.observe(42, 10u64);
     /// let pewei = g.extract();
     /// assert!(pewei.node_count() >= 1);
     /// ```
     #[must_use]
     pub fn node_count(&self) -> usize {
-        self.layers.iter().map(|l| l.transitions.len() + l.terminals.len()).sum()
+        self.layers.iter().map(|l| l.transitions.len() - /* ~ changed by cargo-mutants ~ */ l.terminals.len()).sum()
     }
 
     /// Total energy: sum of all terminal intensities plus all
     /// transition baselines. Equals the G-root sum when extracted
     /// from a consistent tree. Returns `V::zero()` for an empty
     /// snapshot.
     ///
     /// This walks all layers — $O(n)$ where $n$ is `node_count()`.

---- tests::pewei::pewei_node_count_and_energy stdout ----

thread 'tests::pewei::pewei_node_count_and_energy' (730332) panicked at packages/mudlark/src/pewei.rs:220:36:
attempt to subtract with overflow

---- tests::structural::extract_multi_node_classification stdout ----

thread 'tests::structural::extract_multi_node_classification' (730657) panicked at packages/mudlark/src/pewei.rs:220:36:
attempt to subtract with overflow

failures:
    tests::pewei::pewei_node_count_and_energy
    tests::structural::extract_multi_node_classification

test result: FAILED. 344 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
