*** packages/mudlark/src/pewei.rs:220:9: replace Pewei<C, V>::node_count -> usize with 0

*** mutation diff:
--- packages/mudlark/src/pewei.rs
+++ replace Pewei<C, V>::node_count -> usize with 0
@@ -212,17 +212,17 @@
     /// # };
     /// # let mut g = GvGraph::<u64, u64, 8>::new(cfg);
     /// # g.observe(42, 10u64);
     /// let pewei = g.extract();
     /// assert!(pewei.node_count() >= 1);
     /// ```
     #[must_use]
     pub fn node_count(&self) -> usize {
-        self.layers.iter().map(|l| l.transitions.len() + l.terminals.len()).sum()
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Total energy: sum of all terminal intensities plus all
     /// transition baselines. Equals the G-root sum when extracted
     /// from a consistent tree. Returns `V::zero()` for an empty
     /// snapshot.
     ///
     /// This walks all layers — $O(n)$ where $n$ is `node_count()`.

---- tests::pewei::pewei_node_count_and_energy stdout ----

thread 'tests::pewei::pewei_node_count_and_energy' (728710) panicked at packages/mudlark/src/tests/pewei.rs:135:5:
assertion `left == right` failed
  left: 0
 right: 3

---- tests::structural::extract_multi_node_classification stdout ----

thread 'tests::structural::extract_multi_node_classification' (728827) panicked at packages/mudlark/src/tests/structural.rs:77:5:
assertion `left == right` failed
  left: 0
 right: 7

failures:
    tests::pewei::pewei_node_count_and_energy
    tests::structural::extract_multi_node_classification

test result: FAILED. 344 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
