*** packages/mudlark/src/pewei.rs:250:9: replace Pewei<C, V>::total_energy -> V with Default::default()

*** mutation diff:
--- packages/mudlark/src/pewei.rs
+++ replace Pewei<C, V>::total_energy -> V with Default::default()
@@ -242,26 +242,17 @@
     /// # let mut g = GvGraph::<u64, u64, 8>::new(cfg);
     /// g.observe(42, 10u64);
     /// g.observe(200, 5u64);
     /// let pewei = g.extract();
     /// assert_eq!(pewei.total_energy(), 15);
     /// ```
     #[must_use]
     pub fn total_energy(&self) -> V {
-        let mut acc = V::zero();
-        for layer in &self.layers {
-            for t in &layer.transitions {
-                acc = V::add(acc, t.baseline);
-            }
-            for t in &layer.terminals {
-                acc = V::add(acc, t.intensity);
-            }
-        }
-        acc
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Reconstruct a signal estimate from the first `max_layer + 1`
     /// layers of this PEWEI.
     ///
     /// Returns a `Vec<Span<C, V>>` that partitions
     /// `[domain_start, domain_end)` with no gaps and no overlaps.
     /// Each span's intensity includes all ancestral baselines,

---- tests::pewei::pewei_node_count_and_energy stdout ----

thread 'tests::pewei::pewei_node_count_and_energy' (740675) panicked at packages/mudlark/src/tests/pewei.rs:138:5:
assertion `left == right` failed
  left: 0
 right: 50

failures:
    tests::pewei::pewei_node_count_and_energy

test result: FAILED. 345 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
