*** packages/mudlark/src/pewei.rs:331:57: replace - with / in Pewei<C, V>::reconstruct

*** mutation diff:
--- packages/mudlark/src/pewei.rs
+++ replace - with / in Pewei<C, V>::reconstruct
@@ -323,17 +323,17 @@
             return vec![Span {
                 start: self.domain_start,
                 end: self.domain_end,
                 intensity: V::zero(),
                 depth: 0,
             }];
         }
 
-        let max_layer = max_layer.min(self.layers.len() - 1);
+        let max_layer = max_layer.min(self.layers.len() / /* ~ changed by cargo-mutants ~ */ 1);
         let visible = &self.layers[..=max_layer];
         let lookup = RegionLookup::build(visible);
 
         // Pre-allocate: every terminal produces one span, every
         // transition produces at most one span (the invisible
         // sibling) plus passes through. The terminal count is a
         // tight lower bound; +1 accounts for the root if it appears
         // as a single truncated span.

---- tests::pewei::reconstruct_max_layer_clamped stdout ----

thread 'tests::pewei::reconstruct_max_layer_clamped' (746166) panicked at packages/mudlark/src/pewei.rs:332:35:
range end index 1 out of range for slice of length 1

failures:
    tests::pewei::reconstruct_max_layer_clamped

test result: FAILED. 345 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
