*** packages/mudlark/src/pewei.rs:340:104: replace + with - in Pewei<C, V>::reconstruct

*** mutation diff:
--- packages/mudlark/src/pewei.rs
+++ replace + with - in Pewei<C, V>::reconstruct
@@ -332,17 +332,17 @@
         let visible = &self.layers[..=max_layer];
         let lookup = RegionLookup::build(visible);
 
         // Pre-allocate: every terminal produces one span, every
         // transition produces at most one span (the invisible
         // sibling) plus passes through. The terminal count is a
         // tight lower bound; +1 accounts for the root if it appears
         // as a single truncated span.
-        let estimated = visible.iter().map(|l| l.terminals.len() + l.transitions.len()).sum::<usize>() + 1;
+        let estimated = visible.iter().map(|l| l.terminals.len() + l.transitions.len()).sum::<usize>() - /* ~ changed by cargo-mutants ~ */ 1;
         let mut output = Vec::with_capacity(estimated);
 
         descend(
             &lookup,
             visible,
             self.domain_start,
             self.domain_end,
             0,

error: doctest failed, to rerun pass `-p torrust-mudlark --doc`

---- packages/mudlark/src/pewei.rs - pewei (line 48) stdout ----
Test executable failed (exit status: 101).

stderr:

thread 'main' (752651) panicked at packages/mudlark/src/pewei.rs:340:25:
attempt to subtract with overflow

failures:
    packages/mudlark/src/pewei.rs - pewei (line 48)

test result: FAILED. 105 passed; 1 failed; 1 ignored; 0 measured; 0 filtered out; finished in 3.12s

*** result: Failure(101)
