*** packages/mudlark/src/pewei.rs:340:66: replace + with - in Pewei<C, V>::reconstruct

*** mutation diff:
--- packages/mudlark/src/pewei.rs
+++ replace + with - in Pewei<C, V>::reconstruct
@@ -332,17 +332,17 @@
         let visible = &self.layers[..=max_layer];
         let lookup = RegionLookup::build(visible);
 
         // Pre-allocate: every terminal produces one span, every
         // transition produces at most one span (the invisible
         // sibling) plus passes through. The terminal count is a
         // tight lower bound; +1 accounts for the root if it appears
         // as a single truncated span.
-        let estimated = visible.iter().map(|l| l.terminals.len() + l.transitions.len()).sum::<usize>() + 1;
+        let estimated = visible.iter().map(|l| l.terminals.len() - /* ~ changed by cargo-mutants ~ */ l.transitions.len()).sum::<usize>() + 1;
         let mut output = Vec::with_capacity(estimated);
 
         descend(
             &lookup,
             visible,
             self.domain_start,
             self.domain_end,
             0,

---- tests::pewei::reconstruct_both_children_visible stdout ----

thread 'tests::pewei::reconstruct_both_children_visible' (753898) panicked at packages/mudlark/src/pewei.rs:340:48:
attempt to subtract with overflow

---- tests::pewei::reconstruct_energy_conservation_at_each_layer stdout ----

thread 'tests::pewei::reconstruct_energy_conservation_at_each_layer' (753900) panicked at packages/mudlark/src/pewei.rs:340:48:
attempt to subtract with overflow

---- tests::pewei::reconstruct_f64_coordinates stdout ----

thread 'tests::pewei::reconstruct_f64_coordinates' (753901) panicked at packages/mudlark/src/pewei.rs:340:48:
attempt to subtract with overflow

failures:
    tests::pewei::reconstruct_both_children_visible
    tests::pewei::reconstruct_energy_conservation_at_each_layer
    tests::pewei::reconstruct_f64_coordinates
    tests::pewei::reconstruct_full_depth_matches_terminals
    tests::pewei::reconstruct_integer_rounding
    tests::pewei::reconstruct_no_gaps_no_overlaps
    tests::pewei::reconstruct_one_visible_one_invisible_remainder
    tests::pewei::reconstruct_output_sorted_by_start
    tests::pewei::reconstruct_right_visible_left_invisible
    tests::pewei::reconstruct_single_transition_truncated

test result: FAILED. 336 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
