*** packages/mudlark/src/pewei.rs:340:66: replace + with * in Pewei<C, V>::reconstruct

*** mutation diff:
--- packages/mudlark/src/pewei.rs
+++ replace + with * in Pewei<C, V>::reconstruct
@@ -332,17 +332,17 @@
         let visible = &self.layers[..=max_layer];
         let lookup = RegionLookup::build(visible);
 
         // Pre-allocate: every terminal produces one span, every
         // transition produces at most one span (the invisible
         // sibling) plus passes through. The terminal count is a
         // tight lower bound; +1 accounts for the root if it appears
         // as a single truncated span.
-        let estimated = visible.iter().map(|l| l.terminals.len() + l.transitions.len()).sum::<usize>() + 1;
+        let estimated = visible.iter().map(|l| l.terminals.len() * /* ~ changed by cargo-mutants ~ */ l.transitions.len()).sum::<usize>() + 1;
         let mut output = Vec::with_capacity(estimated);
 
         descend(
             &lookup,
             visible,
             self.domain_start,
             self.domain_end,
             0,

*** result: Success
