*** packages/mudlark/src/pewei.rs:529:39: replace + with - in descend

*** mutation diff:
--- packages/mudlark/src/pewei.rs
+++ replace + with - in descend
@@ -521,17 +521,17 @@
             let tr = &layers[layer as usize].transitions[idx as usize];
             let baseline = tr.baseline;
             let total = tr.total;
             let depth = tr.depth;
 
             let mid = C::midpoint(start, end);
             let total_bg = V::add(accumulated, baseline);
             let half_bg = total_bg.prorate(1, 2);
-            let child_depth = g_depth + 1;
+            let child_depth = g_depth - /* ~ changed by cargo-mutants ~ */ 1;
 
             let left_ref = lookup.get(start, child_depth);
             let right_ref = lookup.get(mid, child_depth);
 
             match (left_ref, right_ref) {
                 (Some(_), Some(_)) => {
                     // Both children visible — recurse into each half.
                     descend(lookup, layers, start, mid, child_depth, half_bg, output);

---- tests::pewei::reconstruct_both_children_visible stdout ----

thread 'tests::pewei::reconstruct_both_children_visible' (771758) panicked at packages/mudlark/src/pewei.rs:529:31:
attempt to subtract with overflow

---- tests::pewei::reconstruct_energy_conservation_at_each_layer stdout ----

thread 'tests::pewei::reconstruct_energy_conservation_at_each_layer' (771760) panicked at packages/mudlark/src/pewei.rs:529:31:
attempt to subtract with overflow

---- tests::pewei::reconstruct_f64_coordinates stdout ----

thread 'tests::pewei::reconstruct_f64_coordinates' (771761) panicked at packages/mudlark/src/pewei.rs:529:31:
attempt to subtract with overflow

failures:
    tests::pewei::reconstruct_both_children_visible
    tests::pewei::reconstruct_energy_conservation_at_each_layer
    tests::pewei::reconstruct_f64_coordinates
    tests::pewei::reconstruct_full_depth_matches_terminals
    tests::pewei::reconstruct_integer_rounding
    tests::pewei::reconstruct_no_gaps_no_overlaps
    tests::pewei::reconstruct_one_visible_one_invisible_remainder
    tests::pewei::reconstruct_output_sorted_by_start
    tests::pewei::reconstruct_right_visible_left_invisible
    tests::pewei::reconstruct_single_transition_truncated

test result: FAILED. 336 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
