*** packages/mudlark/src/pewei.rs:754:9: replace Transition<C, V>::snr -> Option<f64> with None

*** mutation diff:
--- packages/mudlark/src/pewei.rs
+++ replace Transition<C, V>::snr -> Option<f64> with None
@@ -746,21 +746,17 @@
     ///     match tr.snr() {
     ///         Some(ratio) => assert!(ratio >= 0.0),
     ///         None => { /* baseline is zero */ }
     ///     }
     /// }
     /// ```
     #[must_use]
     pub fn snr(&self) -> Option<f64> {
-        let b = self.baseline.weight();
-        if b == 0.0 {
-            return None;
-        }
-        Some(self.refinement.weight() / b)
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// Width of this node's interval: `end - start`.
     ///
     /// # Examples
     ///
     /// ```
     /// # use torrust_mudlark::{Config, GvGraph};

---- tests::pewei::snr_float_types stdout ----

thread 'tests::pewei::snr_float_types' (772173) panicked at packages/mudlark/src/tests/pewei.rs:49:23:
baseline is nonzero

---- tests::pewei::snr_nonzero_baseline stdout ----

thread 'tests::pewei::snr_nonzero_baseline' (772174) panicked at packages/mudlark/src/tests/pewei.rs:20:23:
baseline is nonzero

failures:
    tests::pewei::snr_float_types
    tests::pewei::snr_nonzero_baseline

test result: FAILED. 344 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
