*** packages/mudlark/src/pewei.rs:754:9: replace Transition<C, V>::snr -> Option<f64> with Some(-1.0)

*** mutation diff:
--- packages/mudlark/src/pewei.rs
+++ replace Transition<C, V>::snr -> Option<f64> with Some(-1.0)
@@ -746,21 +746,17 @@
     ///     match tr.snr() {
     ///         Some(ratio) => assert!(ratio >= 0.0),
     ///         None => { /* baseline is zero */ }
     ///     }
     /// }
     /// ```
     #[must_use]
     pub fn snr(&self) -> Option<f64> {
-        let b = self.baseline.weight();
-        if b == 0.0 {
-            return None;
-        }
-        Some(self.refinement.weight() / b)
+        Some(-1.0) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Width of this node's interval: `end - start`.
     ///
     /// # Examples
     ///
     /// ```
     /// # use torrust_mudlark::{Config, GvGraph};

---- tests::pewei::snr_float_types stdout ----

thread 'tests::pewei::snr_float_types' (783825) panicked at packages/mudlark/src/tests/pewei.rs:50:5:
assertion failed: (snr - 1.5).abs() < f64::EPSILON

---- tests::pewei::snr_nonzero_baseline stdout ----

thread 'tests::pewei::snr_nonzero_baseline' (783826) panicked at packages/mudlark/src/tests/pewei.rs:21:5:
assertion failed: (snr - 2.0).abs() < f64::EPSILON

---- tests::pewei::snr_zero_baseline_returns_none stdout ----

thread 'tests::pewei::snr_zero_baseline_returns_none' (783827) panicked at packages/mudlark/src/tests/pewei.rs:35:5:
assertion failed: t.snr().is_none()

failures:
    tests::pewei::snr_float_types
    tests::pewei::snr_nonzero_baseline
    tests::pewei::snr_zero_baseline_returns_none

test result: FAILED. 343 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
