*** packages/mudlark/src/pewei.rs:755:14: replace == with != in Transition<C, V>::snr

*** mutation diff:
--- packages/mudlark/src/pewei.rs
+++ replace == with != in Transition<C, V>::snr
@@ -747,17 +747,17 @@
     ///         Some(ratio) => assert!(ratio >= 0.0),
     ///         None => { /* baseline is zero */ }
     ///     }
     /// }
     /// ```
     #[must_use]
     pub fn snr(&self) -> Option<f64> {
         let b = self.baseline.weight();
-        if b == 0.0 {
+        if b != /* ~ changed by cargo-mutants ~ */ 0.0 {
             return None;
         }
         Some(self.refinement.weight() / b)
     }
 
     /// Width of this node's interval: `end - start`.
     ///
     /// # Examples

---- tests::pewei::snr_float_types stdout ----

thread 'tests::pewei::snr_float_types' (789005) panicked at packages/mudlark/src/tests/pewei.rs:49:23:
baseline is nonzero

---- tests::pewei::snr_zero_baseline_returns_none stdout ----

thread 'tests::pewei::snr_zero_baseline_returns_none' (789009) panicked at packages/mudlark/src/tests/pewei.rs:35:5:
assertion failed: t.snr().is_none()

---- tests::pewei::snr_nonzero_baseline stdout ----

thread 'tests::pewei::snr_nonzero_baseline' (789006) panicked at packages/mudlark/src/tests/pewei.rs:20:23:
baseline is nonzero

failures:
    tests::pewei::snr_float_types
    tests::pewei::snr_nonzero_baseline
    tests::pewei::snr_zero_baseline_returns_none

test result: FAILED. 343 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
