*** packages/mudlark/src/pewei.rs:758:39: replace / with % in Transition<C, V>::snr

*** mutation diff:
--- packages/mudlark/src/pewei.rs
+++ replace / with % in Transition<C, V>::snr
@@ -750,17 +750,17 @@
     /// }
     /// ```
     #[must_use]
     pub fn snr(&self) -> Option<f64> {
         let b = self.baseline.weight();
         if b == 0.0 {
             return None;
         }
-        Some(self.refinement.weight() / b)
+        Some(self.refinement.weight() % /* ~ changed by cargo-mutants ~ */ b)
     }
 
     /// Width of this node's interval: `end - start`.
     ///
     /// # Examples
     ///
     /// ```
     /// # use torrust_mudlark::{Config, GvGraph};

---- tests::pewei::snr_float_types stdout ----

thread 'tests::pewei::snr_float_types' (789562) panicked at packages/mudlark/src/tests/pewei.rs:50:5:
assertion failed: (snr - 1.5).abs() < f64::EPSILON

---- tests::pewei::snr_nonzero_baseline stdout ----

thread 'tests::pewei::snr_nonzero_baseline' (789563) panicked at packages/mudlark/src/tests/pewei.rs:21:5:
assertion failed: (snr - 2.0).abs() < f64::EPSILON

failures:
    tests::pewei::snr_float_types
    tests::pewei::snr_nonzero_baseline

test result: FAILED. 344 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
