*** packages/mudlark/src/plateau.rs:114:25: replace == with != in <impl PartialEq for BasisEdge<C>>::eq

*** mutation diff:
--- packages/mudlark/src/plateau.rs
+++ replace == with != in <impl PartialEq for BasisEdge<C>>::eq
@@ -106,17 +106,17 @@
 impl<C: Coordinate> PartialOrd for BasisEdge<C> {
     fn partial_cmp(&self, other: &Self) -> Option<Ordering> {
         Some(self.cmp(other))
     }
 }
 
 impl<C: Coordinate> PartialEq for BasisEdge<C> {
     fn eq(&self, other: &Self) -> bool {
-        self.cmp(other) == Ordering::Equal
+        self.cmp(other) != /* ~ changed by cargo-mutants ~ */ Ordering::Equal
     }
 }
 
 impl<C: Coordinate> Eq for BasisEdge<C> {}
 
 // ── Plateau ──────────────────────────────────────────────────────────
 
 /// One contiguous region of uniform resolution depth on the spatial

---- tests::decay::decay_amplification_above_one stdout ----

thread 'tests::decay::decay_amplification_above_one' (808282) panicked at packages/mudlark/src/graph_plateau.rs:193:13:
POST-SPLIT: dynamic-contour-tracking mirror diverged from static rebuild
left (dynamic): {
    BasisEdge(
        0,
    ): Plateau {
        basis_edge: BasisEdge(
            0,
        ),
        start: 0,
        end: 16,
        depth: 1,

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (808283) panicked at packages/mudlark/src/graph_plateau.rs:193:13:
POST-SPLIT: dynamic-contour-tracking mirror diverged from static rebuild
left (dynamic): {
    BasisEdge(
        0,
    ): Plateau {
        basis_edge: BasisEdge(
            0,
        ),
        start: 0,
        end: 16,
        depth: 1,

---- tests::decay::decay_energy_conservation_selective stdout ----

thread 'tests::decay::decay_energy_conservation_selective' (808284) panicked at packages/mudlark/src/graph_plateau.rs:193:13:
POST-SPLIT: dynamic-contour-tracking mirror diverged from static rebuild
left (dynamic): {
    BasisEdge(
        0,
    ): Plateau {
        basis_edge: BasisEdge(
            0,
        ),
        start: 0,
        end: 16,
        depth: 1,

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 209 passed; 137 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
