*** packages/mudlark/src/plateau.rs:251:9: replace Plateau<C, V>::width -> C with Default::default()

*** mutation diff:
--- packages/mudlark/src/plateau.rs
+++ replace Plateau<C, V>::width -> C with Default::default()
@@ -243,17 +243,17 @@
     /// # g.observe(42, 10u64);
     /// for plateau in g.plateaus().values() {
     ///     assert_eq!(plateau.width(), plateau.end - plateau.start);
     /// }
     /// ```
     #[inline]
     #[must_use]
     pub fn width(&self) -> C {
-        C::width(self.start, self.end)
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Convert to a [`Span`] using `sum` as the intensity.
     ///
     /// Useful when you need a uniform `Span` sequence — for example
     /// building a heat-map or feeding plateau data into code that
     /// operates on [`Span`]s rather than `Plateau`s.
     ///

---- tests::plateau::plateau_width_f64 stdout ----

thread 'tests::plateau::plateau_width_f64' (798745) panicked at packages/mudlark/src/tests/plateau.rs:162:5:
assertion failed: (p.width() - 16.0).abs() < f64::EPSILON

---- tests::plateau::plateau_width_u64 stdout ----

thread 'tests::plateau::plateau_width_u64' (798746) panicked at packages/mudlark/src/tests/plateau.rs:150:5:
assertion `left == right` failed
  left: 0
 right: 8

failures:
    tests::plateau::plateau_width_f64
    tests::plateau::plateau_width_u64

test result: FAILED. 344 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
