*** packages/mudlark/src/plateau.rs:384:9: replace PlateauBasis<C>::contains -> bool with false

*** mutation diff:
--- packages/mudlark/src/plateau.rs
+++ replace PlateauBasis<C>::contains -> bool with false
@@ -376,17 +376,17 @@
         static EMPTY: OnceLock<HashSet<GNodeId>> = OnceLock::new();
         self.forward.get(key).unwrap_or_else(|| EMPTY.get_or_init(HashSet::new))
     }
 
     /// Whether `gnode` is currently a basis element of any plateau.
     #[inline]
     #[allow(unused)] // Available for future use; not called yet.
     pub(crate) fn contains(&self, gnode: GNodeId) -> bool {
-        self.back.contains_key(&gnode)
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     /// Number of tracked plateaus (forward map entries).
     #[inline]
     pub(crate) fn plateau_count(&self) -> usize {
         self.forward.len()
     }

---- tests::plateau::plateau_basis_tests::plateau_basis_remove stdout ----

thread 'tests::plateau::plateau_basis_tests::plateau_basis_remove' (806824) panicked at packages/mudlark/src/tests/plateau.rs:280:9:
assertion failed: pb.contains(g1)

---- tests::plateau::plateau_basis_tests::plateau_basis_insert_lookup stdout ----

thread 'tests::plateau::plateau_basis_tests::plateau_basis_insert_lookup' (806820) panicked at packages/mudlark/src/tests/plateau.rs:258:9:
assertion failed: pb.contains(g0)

failures:
    tests::plateau::plateau_basis_tests::plateau_basis_insert_lookup
    tests::plateau::plateau_basis_tests::plateau_basis_remove

test result: FAILED. 344 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
