*** packages/mudlark/src/plateau.rs:390:9: replace PlateauBasis<C>::plateau_count -> usize with 0

*** mutation diff:
--- packages/mudlark/src/plateau.rs
+++ replace PlateauBasis<C>::plateau_count -> usize with 0
@@ -382,17 +382,17 @@
     #[allow(unused)] // Available for future use; not called yet.
     pub(crate) fn contains(&self, gnode: GNodeId) -> bool {
         self.back.contains_key(&gnode)
     }
 
     /// Number of tracked plateaus (forward map entries).
     #[inline]
     pub(crate) fn plateau_count(&self) -> usize {
-        self.forward.len()
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Number of tracked basis elements (back map entries).
     #[inline]
     pub(crate) fn basis_count(&self) -> usize {
         self.back.len()
     }

---- tests::plateau::plateau_basis_tests::plateau_basis_multiple_plateaus stdout ----

thread 'tests::plateau::plateau_basis_tests::plateau_basis_multiple_plateaus' (811797) panicked at packages/mudlark/src/tests/plateau.rs:309:9:
assertion `left == right` failed
  left: 0
 right: 2

---- tests::plateau::plateau_basis_tests::plateau_basis_insert_lookup stdout ----

thread 'tests::plateau::plateau_basis_tests::plateau_basis_insert_lookup' (811794) panicked at packages/mudlark/src/tests/plateau.rs:263:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    tests::plateau::plateau_basis_tests::plateau_basis_insert_lookup
    tests::plateau::plateau_basis_tests::plateau_basis_multiple_plateaus

test result: FAILED. 344 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
