*** packages/mudlark/src/plateau.rs:390:9: replace PlateauBasis<C>::plateau_count -> usize with 1

*** mutation diff:
--- packages/mudlark/src/plateau.rs
+++ replace PlateauBasis<C>::plateau_count -> usize with 1
@@ -382,17 +382,17 @@
     #[allow(unused)] // Available for future use; not called yet.
     pub(crate) fn contains(&self, gnode: GNodeId) -> bool {
         self.back.contains_key(&gnode)
     }
 
     /// Number of tracked plateaus (forward map entries).
     #[inline]
     pub(crate) fn plateau_count(&self) -> usize {
-        self.forward.len()
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Number of tracked basis elements (back map entries).
     #[inline]
     pub(crate) fn basis_count(&self) -> usize {
         self.back.len()
     }

---- tests::plateau::plateau_basis_tests::plateau_basis_multiple_plateaus stdout ----

thread 'tests::plateau::plateau_basis_tests::plateau_basis_multiple_plateaus' (813102) panicked at packages/mudlark/src/tests/plateau.rs:309:9:
assertion `left == right` failed
  left: 1
 right: 2

---- tests::plateau::plateau_basis_tests::plateau_basis_remove stdout ----

thread 'tests::plateau::plateau_basis_tests::plateau_basis_remove' (813103) panicked at packages/mudlark/src/tests/plateau.rs:287:9:
assertion `left == right` failed
  left: 1
 right: 0

---- tests::plateau::plateau_basis_tests::plateau_basis_empty stdout ----

thread 'tests::plateau::plateau_basis_tests::plateau_basis_empty' (813097) panicked at packages/mudlark/src/tests/plateau.rs:245:9:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    tests::plateau::plateau_basis_tests::plateau_basis_empty
    tests::plateau::plateau_basis_tests::plateau_basis_multiple_plateaus
    tests::plateau::plateau_basis_tests::plateau_basis_remove

test result: FAILED. 343 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
