*** packages/mudlark/src/plateau.rs:396:9: replace PlateauBasis<C>::basis_count -> usize with 0

*** mutation diff:
--- packages/mudlark/src/plateau.rs
+++ replace PlateauBasis<C>::basis_count -> usize with 0
@@ -388,17 +388,17 @@
     #[inline]
     pub(crate) fn plateau_count(&self) -> usize {
         self.forward.len()
     }
 
     /// Number of tracked basis elements (back map entries).
     #[inline]
     pub(crate) fn basis_count(&self) -> usize {
-        self.back.len()
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Iterator over all (key, basis-elements) pairs, in key order.
     ///
     /// Used by `assert_invariants` for the full O(n) sweep.
     #[allow(unused)] // Available for future use; not called yet.
     pub(crate) fn iter(&self) -> impl Iterator<Item = (&BasisEdge<C>, &HashSet<GNodeId>)> {
         self.forward.iter()

---- tests::plateau::plateau_basis_tests::plateau_basis_insert_lookup stdout ----

thread 'tests::plateau::plateau_basis_tests::plateau_basis_insert_lookup' (816684) panicked at packages/mudlark/src/tests/plateau.rs:264:9:
assertion `left == right` failed
  left: 0
 right: 2

---- tests::plateau::plateau_basis_tests::plateau_basis_multiple_plateaus stdout ----

thread 'tests::plateau::plateau_basis_tests::plateau_basis_multiple_plateaus' (816687) panicked at packages/mudlark/src/tests/plateau.rs:310:9:
assertion `left == right` failed
  left: 0
 right: 3

failures:
    tests::plateau::plateau_basis_tests::plateau_basis_insert_lookup
    tests::plateau::plateau_basis_tests::plateau_basis_multiple_plateaus

test result: FAILED. 344 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
