*** packages/mudlark/src/plateau.rs:396:9: replace PlateauBasis<C>::basis_count -> usize with 1

*** mutation diff:
--- packages/mudlark/src/plateau.rs
+++ replace PlateauBasis<C>::basis_count -> usize with 1
@@ -388,17 +388,17 @@
     #[inline]
     pub(crate) fn plateau_count(&self) -> usize {
         self.forward.len()
     }
 
     /// Number of tracked basis elements (back map entries).
     #[inline]
     pub(crate) fn basis_count(&self) -> usize {
-        self.back.len()
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Iterator over all (key, basis-elements) pairs, in key order.
     ///
     /// Used by `assert_invariants` for the full O(n) sweep.
     #[allow(unused)] // Available for future use; not called yet.
     pub(crate) fn iter(&self) -> impl Iterator<Item = (&BasisEdge<C>, &HashSet<GNodeId>)> {
         self.forward.iter()

---- tests::plateau::plateau_basis_tests::plateau_basis_remove stdout ----

thread 'tests::plateau::plateau_basis_tests::plateau_basis_remove' (820736) panicked at packages/mudlark/src/tests/plateau.rs:288:9:
assertion `left == right` failed
  left: 1
 right: 0

---- tests::plateau::plateau_basis_tests::plateau_basis_empty stdout ----

thread 'tests::plateau::plateau_basis_tests::plateau_basis_empty' (820730) panicked at packages/mudlark/src/tests/plateau.rs:246:9:
assertion `left == right` failed
  left: 1
 right: 0

---- tests::plateau::plateau_basis_tests::plateau_basis_multiple_plateaus stdout ----

thread 'tests::plateau::plateau_basis_tests::plateau_basis_multiple_plateaus' (820735) panicked at packages/mudlark/src/tests/plateau.rs:310:9:
assertion `left == right` failed
  left: 1
 right: 3

failures:
    tests::plateau::plateau_basis_tests::plateau_basis_empty
    tests::plateau::plateau_basis_tests::plateau_basis_insert_lookup
    tests::plateau::plateau_basis_tests::plateau_basis_multiple_plateaus
    tests::plateau::plateau_basis_tests::plateau_basis_remove

test result: FAILED. 342 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
