*** packages/mudlark/src/plateau.rs:404:9: replace PlateauBasis<C>::iter -> impl Iterator<Item =(&BasisEdge<C>, &HashSet<GNodeId>)> with ::std::iter::empty()

*** mutation diff:
--- packages/mudlark/src/plateau.rs
+++ replace PlateauBasis<C>::iter -> impl Iterator<Item =(&BasisEdge<C>, &HashSet<GNodeId>)> with ::std::iter::empty()
@@ -396,17 +396,17 @@
         self.back.len()
     }
 
     /// Iterator over all (key, basis-elements) pairs, in key order.
     ///
     /// Used by `assert_invariants` for the full O(n) sweep.
     #[allow(unused)] // Available for future use; not called yet.
     pub(crate) fn iter(&self) -> impl Iterator<Item = (&BasisEdge<C>, &HashSet<GNodeId>)> {
-        self.forward.iter()
+        ::std::iter::empty() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Reference to the back-pointer map.
     ///
     /// Used by `assert_invariants` for cross-checking.
     pub(crate) const fn back_map(&self) -> &HashMap<GNodeId, BasisEdge<C>> {
         &self.back
     }

---- tests::decay::decay_multiple_uniform_preserves_invariants stdout ----

thread 'tests::decay::decay_multiple_uniform_preserves_invariants' (826032) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
Plateau basis: plateaus.keys() (7 entries) != plateau_basis.forward.keys() (0 entries)

---- tests::decay::decay_panics_negative_attenuation stdout ----

thread 'tests::decay::decay_panics_negative_attenuation' (826038) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
Plateau basis: plateaus.keys() (7 entries) != plateau_basis.forward.keys() (0 entries)
note: panic did not contain expected string
      panic message: "Invariant violations (1 total):\nPlateau basis: plateaus.keys() (7 entries) != plateau_basis.forward.keys() (0 entries)"
 expected substring: "attenuation must be > 0"

---- tests::decay::decay_energy_conservation_selective stdout ----

thread 'tests::decay::decay_energy_conservation_selective' (826027) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
Plateau basis: plateaus.keys() (7 entries) != plateau_basis.forward.keys() (0 entries)

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 256 passed; 90 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
