*** packages/mudlark/src/rebalance.rs:1112:62: replace == with != in escalate_after_promote

*** mutation diff:
--- packages/mudlark/src/rebalance.rs
+++ replace == with != in escalate_after_promote
@@ -1104,17 +1104,17 @@
 /// - **Indirect:** a child of `h` is violated at the `p` level.
 ///   Resolving it would contract `p`, producing a merged node whose
 ///   standard-promote recreates the 3-node — an infinite cycle.
 ///
 /// **Action:** contract `p` (isolating `h`), optionally contract `g`,
 /// then skip-promote `h` up to `g`.
 fn escalate_after_promote<V: Accumulator>(vnodes: &mut Arena<VNode<V>>, p: VNodeId, violations: &mut Vec<VNodeId>) {
     let heaviest = match &vnodes.get(p.index()).kind {
-        VKind::Structural { children, .. } if children.len() == 3 => children.get(children.heaviest_child_index()).0,
+        VKind::Structural { children, .. } if children.len() != /* ~ changed by cargo-mutants ~ */ 3 => children.get(children.heaviest_child_index()).0,
         _ => return,
     };
 
     let h_direct = is_violated(vnodes, heaviest);
     let h_indirect = !h_direct && any_child_violated(vnodes, heaviest);
     if !h_direct && !h_indirect {
         return;
     }

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (2551799) panicked at packages/mudlark/src/rebalance.rs:1381:13:
rebalance: exceeded 10000 iterations (queue=0, node=v8, resolved=10000)

---- tests::decay::decay_energy_conservation_selective stdout ----

thread 'tests::decay::decay_energy_conservation_selective' (2551800) panicked at packages/mudlark/src/rebalance.rs:1381:13:
rebalance: exceeded 10000 iterations (queue=0, node=v8, resolved=10000)

---- tests::decay::decay_amplification_above_one stdout ----

thread 'tests::decay::decay_amplification_above_one' (2551798) panicked at packages/mudlark/src/rebalance.rs:1381:13:
rebalance: exceeded 10000 iterations (queue=0, node=v8, resolved=10000)

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 298 passed; 48 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.01s

*** result: Failure(101)
