*** packages/mudlark/src/rebalance.rs:1117:22: delete ! in escalate_after_promote

*** mutation diff:
--- packages/mudlark/src/rebalance.rs
+++ delete ! in escalate_after_promote
@@ -1109,17 +1109,17 @@
 /// then skip-promote `h` up to `g`.
 fn escalate_after_promote<V: Accumulator>(vnodes: &mut Arena<VNode<V>>, p: VNodeId, violations: &mut Vec<VNodeId>) {
     let heaviest = match &vnodes.get(p.index()).kind {
         VKind::Structural { children, .. } if children.len() == 3 => children.get(children.heaviest_child_index()).0,
         _ => return,
     };
 
     let h_direct = is_violated(vnodes, heaviest);
-    let h_indirect = !h_direct && any_child_violated(vnodes, heaviest);
+    let h_indirect =  /* ~ changed by cargo-mutants ~ */h_direct && any_child_violated(vnodes, heaviest);
     if !h_direct && !h_indirect {
         return;
     }
 
     let Some(g) = vnodes.get(p.index()).parent else {
         return;
     };
     let _span = tracing::debug_span!(

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (2560233) panicked at packages/mudlark/src/rebalance.rs:1381:13:
rebalance: exceeded 10000 iterations (queue=0, node=v8, resolved=10000)

---- tests::decay::decay_energy_conservation_uniform stdout ----

thread 'tests::decay::decay_energy_conservation_uniform' (2560235) panicked at packages/mudlark/src/rebalance.rs:1381:13:
rebalance: exceeded 10000 iterations (queue=0, node=v8, resolved=10000)

---- tests::decay::decay_multiple_uniform_preserves_invariants stdout ----

thread 'tests::decay::decay_multiple_uniform_preserves_invariants' (2560245) panicked at packages/mudlark/src/rebalance.rs:1381:13:
rebalance: exceeded 10000 iterations (queue=0, node=v8, resolved=10000)

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q
    tests::decay::decay_panics_q_above_one

test result: FAILED. 321 passed; 25 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
