*** packages/mudlark/src/rebalance.rs:1118:18: replace && with || in escalate_after_promote

*** mutation diff:
--- packages/mudlark/src/rebalance.rs
+++ replace && with || in escalate_after_promote
@@ -1110,17 +1110,17 @@
 fn escalate_after_promote<V: Accumulator>(vnodes: &mut Arena<VNode<V>>, p: VNodeId, violations: &mut Vec<VNodeId>) {
     let heaviest = match &vnodes.get(p.index()).kind {
         VKind::Structural { children, .. } if children.len() == 3 => children.get(children.heaviest_child_index()).0,
         _ => return,
     };
 
     let h_direct = is_violated(vnodes, heaviest);
     let h_indirect = !h_direct && any_child_violated(vnodes, heaviest);
-    if !h_direct && !h_indirect {
+    if !h_direct || /* ~ changed by cargo-mutants ~ */ !h_indirect {
         return;
     }
 
     let Some(g) = vnodes.get(p.index()).parent else {
         return;
     };
     let _span = tracing::debug_span!(
         "escalate",

---- tests::decay::decay_selective_q1_root_undecayed stdout ----

thread 'tests::decay::decay_selective_q1_root_undecayed' (2563279) panicked at packages/mudlark/src/rebalance.rs:1381:13:
rebalance: exceeded 10000 iterations (queue=0, node=v8, resolved=10000)

---- tests::decay::decay_uniform_global_scales_all_nodes stdout ----

thread 'tests::decay::decay_uniform_global_scales_all_nodes' (2563287) panicked at packages/mudlark/src/rebalance.rs:1381:13:
rebalance: exceeded 10000 iterations (queue=0, node=v8, resolved=10000)

---- tests::decay::decay_energy_conservation_selective stdout ----

thread 'tests::decay::decay_energy_conservation_selective' (2563263) panicked at packages/mudlark/src/rebalance.rs:1381:13:
rebalance: exceeded 10000 iterations (queue=0, node=v8, resolved=10000)

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 298 passed; 48 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.93s

*** result: Failure(101)
