*** packages/mudlark/src/rebalance.rs:1118:8: delete ! in escalate_after_promote

*** mutation diff:
--- packages/mudlark/src/rebalance.rs
+++ delete ! in escalate_after_promote
@@ -1110,17 +1110,17 @@
 fn escalate_after_promote<V: Accumulator>(vnodes: &mut Arena<VNode<V>>, p: VNodeId, violations: &mut Vec<VNodeId>) {
     let heaviest = match &vnodes.get(p.index()).kind {
         VKind::Structural { children, .. } if children.len() == 3 => children.get(children.heaviest_child_index()).0,
         _ => return,
     };
 
     let h_direct = is_violated(vnodes, heaviest);
     let h_indirect = !h_direct && any_child_violated(vnodes, heaviest);
-    if !h_direct && !h_indirect {
+    if  /* ~ changed by cargo-mutants ~ */h_direct && !h_indirect {
         return;
     }
 
     let Some(g) = vnodes.get(p.index()).parent else {
         return;
     };
     let _span = tracing::debug_span!(
         "escalate",

---- tests::decay::decay_selective_subtree_preserves_invariants stdout ----
2026-03-16T21:36:12.234089Z ERROR torrust_mudlark::rebalance: rebalance safety-net exceeded — dumping queue tail iterations=10001 max_iterations=10000 resolved=10000 queue=20002 current=8
2026-03-16T21:36:12.234118Z ERROR torrust_mudlark::rebalance: DEAD idx=19982 node=15
2026-03-16T21:36:12.234121Z ERROR torrust_mudlark::rebalance: idx=19983 entry=v5(E,20) ← v7(S2,20) [v5(20), v6(0)] ← v8(S2,30) [v1(10), v7(20)]  uncle_max=10
2026-03-16T21:36:12.234125Z ERROR torrust_mudlark::rebalance: idx=19984 entry=v8(S2,30) ← v3(S3,53) [v2(15), v11(8), v8(30)] ← v4(S2,73) [v0(20), v3(53)]  uncle_max=20
2026-03-16T21:36:12.234127Z ERROR torrust_mudlark::rebalance: idx=19985 entry=v7(S2,20) ← v8(S2,30) [v1(10), v7(20)] ← v3(S3,53) [v2(15), v11(8), v8(30)]  uncle_max=15
2026-03-16T21:36:12.234129Z ERROR torrust_mudlark::rebala

---- tests::decay::decay_selective_subtree_leaves_other_half_unchanged stdout ----
2026-03-16T21:36:12.234391Z ERROR torrust_mudlark::rebalance: rebalance safety-net exceeded — dumping queue tail iterations=10001 max_iterations=10000 resolved=10000 queue=20002 current=8
2026-03-16T21:36:12.234401Z ERROR torrust_mudlark::rebalance: DEAD idx=19982 node=15
2026-03-16T21:36:12.234403Z ERROR torrust_mudlark::rebalance: idx=19983 entry=v5(E,20) ← v7(S2,20) [v5(20), v6(0)] ← v8(S2,30) [v1(10), v7(20)]  uncle_max=10
2026-03-16T21:36:12.234406Z ERROR torrust_mudlark::rebalance: idx=19984 entry=v8(S2,30) ← v3(S3,53) [v2(15), v11(8), v8(30)] ← v4(S2,73) [v0(20), v3(53)]  uncle_max=20
2026-03-16T21:36:12.234409Z ERROR torrust_mudlark::rebalance: idx=19985 entry=v7(S2,20) ← v8(S2,30) [v1(10), v7(20)] ← v3(S3,53) [v2(15), v11(8), v8(30)]  uncle_max=15
2026-03-16T21:36:12.234411Z ERROR torrust_mudlark:

---- tests::decay::decay_uniform_subtree_scales_only_target stdout ----
2026-03-16T21:36:12.235548Z ERROR torrust_mudlark::rebalance: rebalance safety-net exceeded — dumping queue tail iterations=10001 max_iterations=10000 resolved=10000 queue=20002 current=8
2026-03-16T21:36:12.235559Z ERROR torrust_mudlark::rebalance: DEAD idx=19982 node=15
2026-03-16T21:36:12.235562Z ERROR torrust_mudlark::rebalance: idx=19983 entry=v5(E,20) ← v7(S2,20) [v5(20), v6(0)] ← v8(S2,30) [v1(10), v7(20)]  uncle_max=10
2026-03-16T21:36:12.235566Z ERROR torrust_mudlark::rebalance: idx=19984 entry=v8(S2,30) ← v3(S3,53) [v2(15), v11(8), v8(30)] ← v4(S2,73) [v0(20), v3(53)]  uncle_max=20
2026-03-16T21:36:12.235568Z ERROR torrust_mudlark::rebalance: idx=19985 entry=v7(S2,20) ← v8(S2,30) [v1(10), v7(20)] ← v3(S3,53) [v2(15), v11(8), v8(30)]  uncle_max=15
2026-03-16T21:36:12.235571Z ERROR torrust_mudlark::rebalance:

failures:
    tests::decay::decay_f64_tree
    tests::decay::decay_selective_subtree_leaves_other_half_unchanged
    tests::decay::decay_selective_subtree_preserves_invariants
    tests::decay::decay_uniform_subtree_preserves_invariants
    tests::decay::decay_uniform_subtree_scales_only_target
    tests::decay_f64_depth::minimal_f64_depth_saturation
    tests::decay_f64_depth::trace_f64_depth_inconsistency_step_by_step
    tests::diagnostic::evict_tip_creates_span
    tests::diagnostic::eviction_pipeline_creates_spans
    tests::diagnostic::vtree_remove_leaf_creates_span
    tests::structural::semi_internal_surviving_child_unaffected

test result: FAILED. 335 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.66s

*** result: Failure(101)
