*** packages/mudlark/src/rebalance.rs:1144:8: delete ! in escalate_after_promote

*** mutation diff:
--- packages/mudlark/src/rebalance.rs
+++ delete ! in escalate_after_promote
@@ -1136,17 +1136,17 @@
     push_contraction_child_violations(vnodes, p, heaviest, violations);
 
     // Check if contraction resolved the issue.
     let needs_skip = if h_direct {
         is_violated(vnodes, heaviest)
     } else {
         is_violated(vnodes, merged)
     };
-    if !needs_skip {
+    if  /* ~ changed by cargo-mutants ~ */needs_skip {
         tracing::debug!("resolved by contraction");
         return;
     }
 
     // Ensure g is a 2-node before skip-promoting.
     let g_merged = if structural_child_count(vnodes, g) == 3 {
         let g_merged = contract(vnodes, g);
         push_side_effect_violations(vnodes, g, violations);

---- tests::decay::decay_amplification_above_one stdout ----

thread 'tests::decay::decay_amplification_above_one' (2570959) panicked at packages/mudlark/src/rebalance.rs:1381:13:
rebalance: exceeded 10000 iterations (queue=10000, node=v8, resolved=10000)

---- tests::decay::decay_multiple_uniform_preserves_invariants stdout ----

thread 'tests::decay::decay_multiple_uniform_preserves_invariants' (2570966) panicked at packages/mudlark/src/rebalance.rs:1381:13:
rebalance: exceeded 10000 iterations (queue=10000, node=v8, resolved=10000)

---- tests::decay::decay_energy_conservation_selective stdout ----

thread 'tests::decay::decay_energy_conservation_selective' (2570962) panicked at packages/mudlark/src/rebalance.rs:1381:13:
rebalance: exceeded 10000 iterations (queue=10000, node=v8, resolved=10000)

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 296 passed; 50 failed; 0 ignored; 0 measured; 0 filtered out; finished in 4.03s

*** result: Failure(101)
