*** packages/mudlark/src/rebalance.rs:1150:57: replace == with != in escalate_after_promote

*** mutation diff:
--- packages/mudlark/src/rebalance.rs
+++ replace == with != in escalate_after_promote
@@ -1142,17 +1142,17 @@
         is_violated(vnodes, merged)
     };
     if !needs_skip {
         tracing::debug!("resolved by contraction");
         return;
     }
 
     // Ensure g is a 2-node before skip-promoting.
-    let g_merged = if structural_child_count(vnodes, g) == 3 {
+    let g_merged = if structural_child_count(vnodes, g) != /* ~ changed by cargo-mutants ~ */ 3 {
         let g_merged = contract(vnodes, g);
         push_side_effect_violations(vnodes, g, violations);
         push_side_effect_violations(vnodes, g_merged, violations);
         push_promoted_violations(vnodes, g, violations);
         let resolved = !is_violated(vnodes, heaviest) && (h_direct || !is_violated(vnodes, merged));
         if resolved {
             tracing::debug!("resolved by g-contraction");
             return;

---- tests::decay::decay_amplification_above_one stdout ----

thread 'tests::decay::decay_amplification_above_one' (2575486) panicked at packages/mudlark/src/rebalance.rs:247:9:
contract: p must be a 3-node

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (2575487) panicked at packages/mudlark/src/rebalance.rs:247:9:
contract: p must be a 3-node

---- tests::decay::decay_energy_conservation_selective stdout ----

thread 'tests::decay::decay_energy_conservation_selective' (2575488) panicked at packages/mudlark/src/rebalance.rs:247:9:
contract: p must be a 3-node

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 298 passed; 48 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
