*** packages/mudlark/src/rebalance.rs:1213:42: replace == with != in resolve

*** mutation diff:
--- packages/mudlark/src/rebalance.rs
+++ replace == with != in resolve
@@ -1205,17 +1205,17 @@
     tracing::debug!(ctx = %Ctx(vnodes, c), "begin");
 
     let Some(p) = vnodes.get(c.index()).parent else {
         tracing::trace!("no parent — nothing to resolve");
         return None;
     };
 
     // ── Phase 1: ensure p is a 2-node ───────────────────────────
-    if structural_child_count(vnodes, p) == 3 {
+    if structural_child_count(vnodes, p) != /* ~ changed by cargo-mutants ~ */ 3 {
         tracing::debug!(p = %Nd(vnodes, p), "phase 1: contracting 3-node parent");
         let merged = contract(vnodes, p);
         push_side_effect_violations(vnodes, p, violations);
         push_side_effect_violations(vnodes, merged, violations);
         push_contraction_child_violations(vnodes, p, c, violations);
         if !is_violated(vnodes, c) {
             tracing::debug!("phase 1: resolved by contraction");
             return None;

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (2603521) panicked at packages/mudlark/src/arena.rs:93:9:
Arena::get: slot 3 is not occupied

---- tests::decay::decay_amplification_above_one stdout ----

thread 'tests::decay::decay_amplification_above_one' (2603520) panicked at packages/mudlark/src/arena.rs:93:9:
Arena::get: slot 3 is not occupied

---- tests::decay::decay_energy_conservation_uniform stdout ----

thread 'tests::decay::decay_energy_conservation_uniform' (2603523) panicked at packages/mudlark/src/arena.rs:93:9:
Arena::get: slot 3 is not occupied

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 267 passed; 79 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
