*** packages/mudlark/src/rebalance.rs:1219:12: delete ! in resolve

*** mutation diff:
--- packages/mudlark/src/rebalance.rs
+++ delete ! in resolve
@@ -1211,17 +1211,17 @@
 
     // ── Phase 1: ensure p is a 2-node ───────────────────────────
     if structural_child_count(vnodes, p) == 3 {
         tracing::debug!(p = %Nd(vnodes, p), "phase 1: contracting 3-node parent");
         let merged = contract(vnodes, p);
         push_side_effect_violations(vnodes, p, violations);
         push_side_effect_violations(vnodes, merged, violations);
         push_contraction_child_violations(vnodes, p, c, violations);
-        if !is_violated(vnodes, c) {
+        if  /* ~ changed by cargo-mutants ~ */is_violated(vnodes, c) {
             tracing::debug!("phase 1: resolved by contraction");
             return None;
         }
     }
 
     let is_c_structural_2 = matches!(
         &vnodes.get(c.index()).kind,
         VKind::Structural { children, .. } if children.len() == 2

---- tests::decay::decay_multiple_selective_preserves_invariants stdout ----

thread 'tests::decay::decay_multiple_selective_preserves_invariants' (2607558) panicked at packages/mudlark/src/rebalance.rs:1445:9:
rebalance finished with residual violations: [VNodeId(9)]

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (2607554) panicked at packages/mudlark/src/rebalance.rs:1445:9:
rebalance finished with residual violations: [VNodeId(9)]

---- tests::decay::decay_energy_conservation_selective stdout ----

thread 'tests::decay::decay_energy_conservation_selective' (2607555) panicked at packages/mudlark/src/rebalance.rs:1445:9:
rebalance finished with residual violations: [VNodeId(9)]

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q
    tests::decay::decay_panics_q_above_one

test result: FAILED. 280 passed; 66 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
