*** packages/mudlark/src/rebalance.rs:1247:61: replace == with != in resolve

*** mutation diff:
--- packages/mudlark/src/rebalance.rs
+++ replace == with != in resolve
@@ -1239,17 +1239,17 @@
     } else {
         tracing::debug!("phase 2: skip promote path");
         let Some(g) = vnodes.get(p.index()).parent else {
             tracing::trace!("no grandparent — cannot skip-promote");
             return None;
         };
 
         // Ensure g is a 2-node.
-        let g_merged = if structural_child_count(vnodes, g) == 3 {
+        let g_merged = if structural_child_count(vnodes, g) != /* ~ changed by cargo-mutants ~ */ 3 {
             let merged = contract(vnodes, g);
             push_side_effect_violations(vnodes, g, violations);
             push_side_effect_violations(vnodes, merged, violations);
             push_promoted_violations(vnodes, g, violations);
             if !is_violated(vnodes, c) {
                 tracing::debug!("phase 2: resolved by g-contraction");
                 return None;
             }

---- tests::decay::decay_energy_conservation_selective stdout ----

thread 'tests::decay::decay_energy_conservation_selective' (2609361) panicked at packages/mudlark/src/rebalance.rs:247:9:
contract: p must be a 3-node

---- tests::decay::decay_amplification_above_one stdout ----

thread 'tests::decay::decay_amplification_above_one' (2609359) panicked at packages/mudlark/src/rebalance.rs:247:9:
contract: p must be a 3-node

---- tests::decay::decay_multiple_selective_preserves_invariants stdout ----

thread 'tests::decay::decay_multiple_selective_preserves_invariants' (2609365) panicked at packages/mudlark/src/rebalance.rs:247:9:
contract: p must be a 3-node

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 274 passed; 72 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
