*** packages/mudlark/src/rebalance.rs:1252:16: delete ! in resolve

*** mutation diff:
--- packages/mudlark/src/rebalance.rs
+++ delete ! in resolve
@@ -1244,17 +1244,17 @@
         };
 
         // Ensure g is a 2-node.
         let g_merged = if structural_child_count(vnodes, g) == 3 {
             let merged = contract(vnodes, g);
             push_side_effect_violations(vnodes, g, violations);
             push_side_effect_violations(vnodes, merged, violations);
             push_promoted_violations(vnodes, g, violations);
-            if !is_violated(vnodes, c) {
+            if  /* ~ changed by cargo-mutants ~ */is_violated(vnodes, c) {
                 tracing::debug!("phase 2: resolved by g-contraction");
                 return None;
             }
             Some(merged)
         } else {
             None
         };

*** result: Success
