*** packages/mudlark/src/rebalance.rs:1270:24: replace && with || in resolve

*** mutation diff:
--- packages/mudlark/src/rebalance.rs
+++ replace && with || in resolve
@@ -1262,17 +1262,17 @@
         if let Some(g_id) = vnodes.get(p.index()).parent {
             // §IDEA M-11.7: Check for semi-internal dispatch + depth gate.
             let is_semi = matches!(
                 &vnodes.get(c.index()).kind,
                 VKind::Entry { gnode, .. }
                     if gnodes.get(gnode.index()).is_semi_internal()
             );
 
-            if is_semi && v_depth(vnodes, c) <= depth_evict {
+            if is_semi || /* ~ changed by cargo-mutants ~ */ v_depth(vnodes, c) <= depth_evict {
                 tracing::debug!("phase 2: legacy promote (semi-internal entry)");
                 let new_g = legacy_promote(vnodes, gnodes, c);
                 result = Some(new_g);
                 // Legacy promote replaces c (high intensity) with ne
                 // (zero intensity) inside p. This collapses the uncle
                 // shield for s's children: they used to have uncle = c,
                 // now uncle = ne = 0. Scan p's grandchildren to catch
                 // these newly created violations that

---- tests::decay::decay_amplification_above_one stdout ----

thread 'tests::decay::decay_amplification_above_one' (2616169) panicked at packages/mudlark/src/rebalance.rs:553:5:
legacy_promote: backing G-node must be semi-internal

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (2616170) panicked at packages/mudlark/src/rebalance.rs:553:5:
legacy_promote: backing G-node must be semi-internal

---- tests::decay::decay_multiple_uniform_preserves_invariants stdout ----

thread 'tests::decay::decay_multiple_uniform_preserves_invariants' (2616176) panicked at packages/mudlark/src/rebalance.rs:553:5:
legacy_promote: backing G-node must be semi-internal

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 273 passed; 73 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.15s

*** result: Failure(101)
