*** packages/mudlark/src/rebalance.rs:1305:38: replace && with || in resolve

*** mutation diff:
--- packages/mudlark/src/rebalance.rs
+++ replace && with || in resolve
@@ -1297,17 +1297,17 @@
             tracing::warn!(
                 node = %Ctx(vnodes, c),
                 "skip-promote path: no grandparent after g-contraction — resolve incomplete",
             );
         }
     }
 
     // Post-resolve check: if c is still alive and violated, warn.
-    if vnodes.is_occupied(c.index()) && is_violated(vnodes, c) {
+    if vnodes.is_occupied(c.index()) || /* ~ changed by cargo-mutants ~ */ is_violated(vnodes, c) {
         tracing::warn!(
             node = %Ctx(vnodes, c),
             "resolve() returning with node STILL violated",
         );
     }
 
     result
 }

---- tests::decay::decay_multiple_selective_preserves_invariants stdout ----

thread 'tests::decay::decay_multiple_selective_preserves_invariants' (2625757) panicked at packages/mudlark/src/arena.rs:93:9:
Arena::get: slot 18 is not occupied

---- tests::decay_f64_depth::minimal_f64_depth_saturation stdout ----

thread 'tests::decay_f64_depth::minimal_f64_depth_saturation' (2625784) panicked at packages/mudlark/src/arena.rs:93:9:
Arena::get: slot 16 is not occupied

---- tests::diagnostic::audit_violations_returns_empty_after_observe stdout ----

thread 'tests::diagnostic::audit_violations_returns_empty_after_observe' (2625788) panicked at packages/mudlark/src/arena.rs:93:9:
Arena::get: slot 8 is not occupied

failures:
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_selective_q1_root_undecayed
    tests::decay_f64_depth::minimal_f64_depth_saturation
    tests::diagnostic::audit_plateau_consistency_passes_on_healthy_graph
    tests::diagnostic::audit_violations_returns_empty_after_observe
    tests::diagnostic::evict_tip_creates_span
    tests::diagnostic::eviction_pipeline_creates_spans
    tests::diagnostic::normalize_plateaus_creates_span
    tests::diagnostic::observe_emits_debug_events
    tests::diagnostic::observe_runs_post_observe_audit_without_tracing
    tests::diagnostic::plateau_mirror_consistency_runs_without_tracing
    tests::diagnostic::plateau_sum_check_runs_without_tracing

test result: FAILED. 323 passed; 23 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.14s

*** result: Failure(101)
