*** packages/mudlark/src/rebalance.rs:1358:20: replace += with -= in rebalance

*** mutation diff:
--- packages/mudlark/src/rebalance.rs
+++ replace += with -= in rebalance
@@ -1350,17 +1350,17 @@
     let _span = tracing::debug_span!("rebalance", queue = violations.len()).entered();
 
     // Pre-rebalance audit: detect violations not in the queue.
     if tracing::enabled!(tracing::Level::DEBUG) {
         crate::diagnostic::audit_violations(vnodes, violations, "PRE-REBALANCE");
     }
 
     while let Some(c) = violations.pop() {
-        iterations += 1;
+        iterations -= /* ~ changed by cargo-mutants ~ */ 1;
         if iterations > max_iterations {
             tracing::error!(
                 iterations,
                 max_iterations,
                 resolved,
                 queue = violations.len(),
                 current = c.index(),
                 "rebalance safety-net exceeded — dumping queue tail",

---- tests::decay::decay_amplification_above_one stdout ----

thread 'tests::decay::decay_amplification_above_one' (2631710) panicked at packages/mudlark/src/rebalance.rs:1358:9:
attempt to subtract with overflow

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (2631711) panicked at packages/mudlark/src/rebalance.rs:1358:9:
attempt to subtract with overflow

---- tests::decay::decay_energy_conservation_selective stdout ----

thread 'tests::decay::decay_energy_conservation_selective' (2631712) panicked at packages/mudlark/src/rebalance.rs:1358:9:
attempt to subtract with overflow

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 263 passed; 83 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
