*** packages/mudlark/src/rebalance.rs:1359:23: replace > with < in rebalance

*** mutation diff:
--- packages/mudlark/src/rebalance.rs
+++ replace > with < in rebalance
@@ -1351,17 +1351,17 @@
 
     // Pre-rebalance audit: detect violations not in the queue.
     if tracing::enabled!(tracing::Level::DEBUG) {
         crate::diagnostic::audit_violations(vnodes, violations, "PRE-REBALANCE");
     }
 
     while let Some(c) = violations.pop() {
         iterations += 1;
-        if iterations > max_iterations {
+        if iterations < /* ~ changed by cargo-mutants ~ */ max_iterations {
             tracing::error!(
                 iterations,
                 max_iterations,
                 resolved,
                 queue = violations.len(),
                 current = c.index(),
                 "rebalance safety-net exceeded — dumping queue tail",
             );

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (2649695) panicked at packages/mudlark/src/rebalance.rs:1381:13:
rebalance: exceeded 10000 iterations (queue=0, node=v8, resolved=0)

---- tests::decay::decay_amplification_above_one stdout ----

thread 'tests::decay::decay_amplification_above_one' (2649694) panicked at packages/mudlark/src/rebalance.rs:1381:13:
rebalance: exceeded 10000 iterations (queue=0, node=v8, resolved=0)

---- tests::decay::decay_noop_at_attenuation_one stdout ----

thread 'tests::decay::decay_noop_at_attenuation_one' (2649701) panicked at packages/mudlark/src/rebalance.rs:1381:13:
rebalance: exceeded 10000 iterations (queue=0, node=v8, resolved=0)

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 263 passed; 83 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
