*** packages/mudlark/src/rebalance.rs:1398:12: delete ! in rebalance

*** mutation diff:
--- packages/mudlark/src/rebalance.rs
+++ delete ! in rebalance
@@ -1390,17 +1390,17 @@
                     "breaking out of rebalance loop — \
                      possible bug in violation resolution",
                 );
                 break;
             }
         }
 
         // Guard: node may have been destroyed by a prior resolution.
-        if !vnodes.is_occupied(c.index()) {
+        if  /* ~ changed by cargo-mutants ~ */vnodes.is_occupied(c.index()) {
             tracing::trace!(node = c.index(), "skip destroyed");
             continue;
         }
         // Guard: violation may have been resolved as a side effect.
         if !is_violated(vnodes, c) {
             tracing::trace!(node = c.index(), "skip already resolved");
             continue;
         }

---- tests::decay::decay_panics_zero_attenuation stdout ----

thread 'tests::decay::decay_panics_zero_attenuation' (2656586) panicked at packages/mudlark/src/rebalance.rs:1445:9:
rebalance finished with residual violations: [VNodeId(9)]
note: panic did not contain expected string
      panic message: "rebalance finished with residual violations: [VNodeId(9)]"
 expected substring: "attenuation must be > 0"

---- tests::decay::decay_f64_tree stdout ----

thread 'tests::decay::decay_f64_tree' (2656577) panicked at packages/mudlark/src/rebalance.rs:1445:9:
rebalance finished with residual violations: [VNodeId(9)]

---- tests::decay::decay_uniform_global_all_own_scaled stdout ----
2026-03-16T21:38:18.568864Z ERROR torrust_mudlark::diagnostic: violation NOT in queue checkpoint="RESIDUAL" node=v8(S2,13) ← v3(S3,23) [v1(10), v8(13), v11(0)] ← v4(S2,33) [v0(10), v3(23)]  uncle_max=10

thread 'tests::decay::decay_uniform_global_all_own_scaled' (2656597) panicked at packages/mudlark/src/rebalance.rs:1445:9:
rebalance finished with residual violations: [VNodeId(9)]

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 264 passed; 82 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
