*** packages/mudlark/src/rebalance.rs:1403:12: delete ! in rebalance

*** mutation diff:
--- packages/mudlark/src/rebalance.rs
+++ delete ! in rebalance
@@ -1395,17 +1395,17 @@
         }
 
         // Guard: node may have been destroyed by a prior resolution.
         if !vnodes.is_occupied(c.index()) {
             tracing::trace!(node = c.index(), "skip destroyed");
             continue;
         }
         // Guard: violation may have been resolved as a side effect.
-        if !is_violated(vnodes, c) {
+        if  /* ~ changed by cargo-mutants ~ */is_violated(vnodes, c) {
             tracing::trace!(node = c.index(), "skip already resolved");
             continue;
         }
 
         resolved += 1;
         tracing::debug!(
             iter = iterations,
             resolved,

---- tests::decay::decay_energy_conservation_uniform stdout ----

thread 'tests::decay::decay_energy_conservation_uniform' (2659645) panicked at packages/mudlark/src/rebalance.rs:1445:9:
rebalance finished with residual violations: [VNodeId(9)]

---- tests::decay::decay_panics_nan_attenuation stdout ----

thread 'tests::decay::decay_panics_nan_attenuation' (2659650) panicked at packages/mudlark/src/rebalance.rs:1445:9:
rebalance finished with residual violations: [VNodeId(9)]
note: panic did not contain expected string
      panic message: "rebalance finished with residual violations: [VNodeId(9)]"
 expected substring: "attenuation must be > 0"

---- tests::decay::decay_f64_tree stdout ----

thread 'tests::decay::decay_f64_tree' (2659646) panicked at packages/mudlark/src/rebalance.rs:1445:9:
rebalance finished with residual violations: [VNodeId(9)]

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 265 passed; 81 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
