*** packages/mudlark/src/rebalance.rs:1408:18: replace += with -= in rebalance

*** mutation diff:
--- packages/mudlark/src/rebalance.rs
+++ replace += with -= in rebalance
@@ -1400,17 +1400,17 @@
             continue;
         }
         // Guard: violation may have been resolved as a side effect.
         if !is_violated(vnodes, c) {
             tracing::trace!(node = c.index(), "skip already resolved");
             continue;
         }
 
-        resolved += 1;
+        resolved -= /* ~ changed by cargo-mutants ~ */ 1;
         tracing::debug!(
             iter = iterations,
             resolved,
             queue = violations.len(),
             node = %Ctx(vnodes, c),
             "resolving violation",
         );
         if let Some(gid) = resolve(vnodes, gnodes, c, violations, depth_evict) {

---- tests::decay::decay_energy_conservation_selective stdout ----

thread 'tests::decay::decay_energy_conservation_selective' (2662435) panicked at packages/mudlark/src/rebalance.rs:1408:9:
attempt to subtract with overflow

---- tests::decay::decay_f64_tree stdout ----

thread 'tests::decay::decay_f64_tree' (2662437) panicked at packages/mudlark/src/rebalance.rs:1408:9:
attempt to subtract with overflow

---- tests::decay::decay_energy_conservation_uniform stdout ----

thread 'tests::decay::decay_energy_conservation_uniform' (2662436) panicked at packages/mudlark/src/rebalance.rs:1408:9:
attempt to subtract with overflow

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 265 passed; 81 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
