*** packages/mudlark/src/rebalance.rs:1421:42: replace && with || in rebalance

*** mutation diff:
--- packages/mudlark/src/rebalance.rs
+++ replace && with || in rebalance
@@ -1413,17 +1413,17 @@
             node = %Ctx(vnodes, c),
             "resolving violation",
         );
         if let Some(gid) = resolve(vnodes, gnodes, c, violations, depth_evict) {
             new_gnodes.push(gid);
         }
 
         // Post-resolve diagnostic: log if the node is still violated.
-        if vnodes.is_occupied(c.index()) && is_violated(vnodes, c) {
+        if vnodes.is_occupied(c.index()) || /* ~ changed by cargo-mutants ~ */ is_violated(vnodes, c) {
             tracing::warn!(
                 iter = iterations,
                 node = %Ctx(vnodes, c),
                 "node STILL violated after resolve",
             );
         }
 
         // Post-resolve full scan: detect violations created by resolve

---- tests::decay::decay_multiple_selective_preserves_invariants stdout ----

thread 'tests::decay::decay_multiple_selective_preserves_invariants' (2669449) panicked at packages/mudlark/src/arena.rs:93:9:
Arena::get: slot 18 is not occupied

---- tests::decay::decay_selective_q1_root_undecayed stdout ----

thread 'tests::decay::decay_selective_q1_root_undecayed' (2669464) panicked at packages/mudlark/src/arena.rs:93:9:
Arena::get: slot 22 is not occupied

---- tests::diagnostic::evict_tip_creates_span stdout ----

thread 'tests::diagnostic::evict_tip_creates_span' (2669484) panicked at packages/mudlark/src/arena.rs:93:9:
Arena::get: slot 10 is not occupied

failures:
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_selective_q1_root_undecayed
    tests::decay_f64_depth::minimal_f64_depth_saturation
    tests::diagnostic::audit_plateau_consistency_passes_on_healthy_graph
    tests::diagnostic::audit_violations_returns_empty_after_observe
    tests::diagnostic::evict_tip_creates_span
    tests::diagnostic::eviction_pipeline_creates_spans
    tests::diagnostic::normalize_plateaus_creates_span
    tests::diagnostic::observe_emits_debug_events
    tests::diagnostic::observe_runs_post_observe_audit_without_tracing
    tests::diagnostic::plateau_mirror_consistency_runs_without_tracing
    tests::diagnostic::plateau_sum_check_runs_without_tracing

test result: FAILED. 323 passed; 23 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
