*** packages/mudlark/src/rebalance.rs:199:19: replace != with == in max_uncle_intensity

*** mutation diff:
--- packages/mudlark/src/rebalance.rs
+++ replace != with == in max_uncle_intensity
@@ -191,17 +191,17 @@
     let parent = vnodes.get(c.index()).parent?;
     let grandparent = vnodes.get(parent.index()).parent?;
 
     let g = vnodes.get(grandparent.index());
     if let VKind::Structural { children, .. } = &g.kind {
         let mut max_int = None;
         for i in 0..children.len() {
             let (id, intensity) = children.get(i);
-            if id != parent {
+            if id == /* ~ changed by cargo-mutants ~ */ parent {
                 max_int = Some(max_int.map_or(intensity, |cur| if intensity > cur { intensity } else { cur }));
             }
         }
         max_int
     } else {
         None
     }
 }

---- tests::rebalance::escalation_direct_breaks_promote_cycle stdout ----

thread 'tests::rebalance::escalation_direct_breaks_promote_cycle' (2389292) panicked at packages/mudlark/src/tests/rebalance.rs:670:5:
c(30) > uncle_g(8)

---- tests::rebalance::contraction_child_violations_skips_target stdout ----

thread 'tests::rebalance::contraction_child_violations_skips_target' (2389291) panicked at packages/mudlark/src/tests/rebalance.rs:605:5:
assertion `left == right` failed: b should be pushed, a skipped
  left: []
 right: [VNodeId(2)]

---- tests::rebalance::escalation_indirect_child_of_heaviest_violated stdout ----

thread 'tests::rebalance::escalation_indirect_child_of_heaviest_violated' (2389293) panicked at packages/mudlark/src/tests/rebalance.rs:768:5:
c(21) > uncle_g(20)

failures:
    tests::rebalance::contraction_child_violations_skips_target
    tests::rebalance::escalation_direct_breaks_promote_cycle
    tests::rebalance::escalation_indirect_child_of_heaviest_violated
    tests::rebalance::escalation_with_structural_heaviest_child
    tests::rebalance::source_10_full_rebalance_resolves_all
    tests::rebalance::source_10_g_contraction_promotion_grandchildren_necessary
    tests::rebalance::source_3_contraction_grandchildren_necessary
    tests::rebalance::source_4_catches_all_violated_children
    tests::rebalance::source_4_promotion_children_necessary
    tests::rebalance::source_7_collapse_children_necessary
    tests::rebalance::source_8_three_to_two_transition_necessary
    tests::rebalance::source_9_collapse_cousins_necessary

test result: FAILED. 324 passed; 22 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
