*** packages/mudlark/src/rebalance.rs:200:77: replace > with == in max_uncle_intensity

*** mutation diff:
--- packages/mudlark/src/rebalance.rs
+++ replace > with == in max_uncle_intensity
@@ -192,17 +192,17 @@
     let grandparent = vnodes.get(parent.index()).parent?;
 
     let g = vnodes.get(grandparent.index());
     if let VKind::Structural { children, .. } = &g.kind {
         let mut max_int = None;
         for i in 0..children.len() {
             let (id, intensity) = children.get(i);
             if id != parent {
-                max_int = Some(max_int.map_or(intensity, |cur| if intensity > cur { intensity } else { cur }));
+                max_int = Some(max_int.map_or(intensity, |cur| if intensity == /* ~ changed by cargo-mutants ~ */ cur { intensity } else { cur }));
             }
         }
         max_int
     } else {
         None
     }
 }

---- tests::rebalance::source_8_three_to_two_transition_necessary stdout ----

thread 'tests::rebalance::source_8_three_to_two_transition_necessary' (2393871) panicked at packages/mudlark/src/tests/rebalance.rs:857:5:
a1(20) ≤ high_uncle(30) before removal

---- tests::vtree::remove_from_3node_creates_violation_for_grandchild stdout ----

thread 'tests::vtree::remove_from_3node_creates_violation_for_grandchild' (2393971) panicked at packages/mudlark/src/tests/vtree.rs:512:5:
c1 should NOT be violated before removal

failures:
    tests::rebalance::source_8_three_to_two_transition_necessary
    tests::vtree::remove_from_3node_creates_violation_for_grandchild

test result: FAILED. 344 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.10s

*** result: Failure(101)
