*** packages/mudlark/src/rebalance.rs:200:77: replace > with < in max_uncle_intensity

*** mutation diff:
--- packages/mudlark/src/rebalance.rs
+++ replace > with < in max_uncle_intensity
@@ -192,17 +192,17 @@
     let grandparent = vnodes.get(parent.index()).parent?;
 
     let g = vnodes.get(grandparent.index());
     if let VKind::Structural { children, .. } = &g.kind {
         let mut max_int = None;
         for i in 0..children.len() {
             let (id, intensity) = children.get(i);
             if id != parent {
-                max_int = Some(max_int.map_or(intensity, |cur| if intensity > cur { intensity } else { cur }));
+                max_int = Some(max_int.map_or(intensity, |cur| if intensity < /* ~ changed by cargo-mutants ~ */ cur { intensity } else { cur }));
             }
         }
         max_int
     } else {
         None
     }
 }

---- tests::decay::decay_f64_tree stdout ----

thread 'tests::decay::decay_f64_tree' (2395924) panicked at packages/mudlark/src/rebalance.rs:1445:9:
rebalance finished with residual violations: [VNodeId(19)]

---- tests::decay::decay_multiple_uniform_preserves_invariants stdout ----

thread 'tests::decay::decay_multiple_uniform_preserves_invariants' (2395926) panicked at packages/mudlark/src/rebalance.rs:1445:9:
rebalance finished with residual violations: [VNodeId(3)]

---- tests::decay::decay_energy_conservation_uniform stdout ----

thread 'tests::decay::decay_energy_conservation_uniform' (2395923) panicked at packages/mudlark/src/rebalance.rs:1445:9:
rebalance finished with residual violations: [VNodeId(3)]

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 294 passed; 52 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
