*** packages/mudlark/src/rebalance.rs:216:66: replace > with < in is_violated

*** mutation diff:
--- packages/mudlark/src/rebalance.rs
+++ replace > with < in is_violated
@@ -208,17 +208,17 @@
 
 /// Whether node `c` violates the max-uncle constraint (V-I3).
 ///
 /// A node is violated when `c.int > max { u.int : u ∈ uncles(c) }`.
 /// Returns false if `c` has no grandparent (no uncle relationship).
 #[must_use]
 pub fn is_violated<V: Accumulator>(vnodes: &Arena<VNode<V>>, c: VNodeId) -> bool {
     let c_int = vnodes.get(c.index()).intensity;
-    max_uncle_intensity(vnodes, c).is_some_and(|max_uncle| c_int > max_uncle)
+    max_uncle_intensity(vnodes, c).is_some_and(|max_uncle| c_int < /* ~ changed by cargo-mutants ~ */ max_uncle)
 }
 
 // ── Contraction (§IDEA M-11.3) ──────────────────────────────────────
 
 /// Contract a 3-node parent `p` into a 2-node by isolating the
 /// heaviest child and merging the other two under a new structural
 /// node.
 ///

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (2407314) panicked at packages/mudlark/src/rebalance.rs:1445:9:
rebalance finished with residual violations: [VNodeId(2), VNodeId(3)]

---- tests::decay::decay_amplification_above_one stdout ----

thread 'tests::decay::decay_amplification_above_one' (2407313) panicked at packages/mudlark/src/rebalance.rs:1445:9:
rebalance finished with residual violations: [VNodeId(2), VNodeId(3)]

---- tests::decay::decay_energy_conservation_selective stdout ----

thread 'tests::decay::decay_energy_conservation_selective' (2407315) panicked at packages/mudlark/src/rebalance.rs:1445:9:
rebalance finished with residual violations: [VNodeId(2), VNodeId(3)]

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 218 passed; 128 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.40s

*** result: Failure(101)
