*** packages/mudlark/src/rebalance.rs:216:66: replace > with >= in is_violated

*** mutation diff:
--- packages/mudlark/src/rebalance.rs
+++ replace > with >= in is_violated
@@ -208,17 +208,17 @@
 
 /// Whether node `c` violates the max-uncle constraint (V-I3).
 ///
 /// A node is violated when `c.int > max { u.int : u ∈ uncles(c) }`.
 /// Returns false if `c` has no grandparent (no uncle relationship).
 #[must_use]
 pub fn is_violated<V: Accumulator>(vnodes: &Arena<VNode<V>>, c: VNodeId) -> bool {
     let c_int = vnodes.get(c.index()).intensity;
-    max_uncle_intensity(vnodes, c).is_some_and(|max_uncle| c_int > max_uncle)
+    max_uncle_intensity(vnodes, c).is_some_and(|max_uncle| c_int >= /* ~ changed by cargo-mutants ~ */ max_uncle)
 }
 
 // ── Contraction (§IDEA M-11.3) ──────────────────────────────────────
 
 /// Contract a 3-node parent `p` into a 2-node by isolating the
 /// heaviest child and merging the other two under a new structural
 /// node.
 ///

---- tests::decay::decay_f64_tree stdout ----

thread 'tests::decay::decay_f64_tree' (2409930) panicked at packages/mudlark/src/rebalance.rs:1381:13:
rebalance: exceeded 10000 iterations (queue=40004, node=v2, resolved=10000)

---- tests::decay::decay_selective_subtree_preserves_invariants stdout ----

thread 'tests::decay::decay_selective_subtree_preserves_invariants' (2409946) panicked at packages/mudlark/src/rebalance.rs:1381:13:
rebalance: exceeded 10000 iterations (queue=40000, node=v16, resolved=10000)

---- tests::decay::decay_multiple_uniform_preserves_invariants stdout ----

thread 'tests::decay::decay_multiple_uniform_preserves_invariants' (2409932) panicked at packages/mudlark/src/rebalance.rs:1381:13:
rebalance: exceeded 10000 iterations (queue=77996, node=v24, resolved=10000)

failures:
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_selective_q1_root_undecayed
    tests::decay::decay_selective_subtree_leaves_other_half_unchanged
    tests::decay::decay_selective_subtree_preserves_invariants
    tests::decay::decay_uniform_subtree_preserves_invariants
    tests::decay::decay_uniform_subtree_scales_only_target
    tests::decay_f64_depth::minimal_f64_depth_saturation
    tests::decay_f64_depth::trace_f64_depth_inconsistency_step_by_step
    tests::diagnostic::audit_plateau_consistency_passes_on_healthy_graph
    tests::diagnostic::audit_violations_returns_empty_after_observe

test result: FAILED. 308 passed; 38 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.26s

*** result: Failure(101)
