*** packages/mudlark/src/rebalance.rs:257:14: replace != with == in contract

*** mutation diff:
--- packages/mudlark/src/rebalance.rs
+++ replace != with == in contract
@@ -249,17 +249,17 @@
         let data: [(VNodeId, V); 3] = [children.get(0), children.get(1), children.get(2)];
         (h, data)
     };
 
     // Identify isolate vs merge pair.
     let isolate = children_data[heaviest_idx];
     let mut merge = Vec::with_capacity(2);
     for (i, &child) in children_data.iter().enumerate() {
-        if i != heaviest_idx {
+        if i == /* ~ changed by cargo-mutants ~ */ heaviest_idx {
             merge.push(child);
         }
     }
     let (a_id, a_int) = merge[0];
     let (b_id, b_int) = merge[1];
 
     // Compute has_evictable for the merged node.
     let a_terminal = node_has_evictable(vnodes, a_id);

---- tests::decay::decay_amplification_above_one stdout ----

thread 'tests::decay::decay_amplification_above_one' (2413291) panicked at packages/mudlark/src/rebalance.rs:262:30:
index out of bounds: the len is 1 but the index is 1

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (2413292) panicked at packages/mudlark/src/rebalance.rs:262:30:
index out of bounds: the len is 1 but the index is 1

---- tests::decay::decay_energy_conservation_selective stdout ----

thread 'tests::decay::decay_energy_conservation_selective' (2413293) panicked at packages/mudlark/src/rebalance.rs:262:30:
index out of bounds: the len is 1 but the index is 1

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 267 passed; 79 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
