*** packages/mudlark/src/rebalance.rs:270:30: replace == with != in contract

*** mutation diff:
--- packages/mudlark/src/rebalance.rs
+++ replace == with != in contract
@@ -262,17 +262,17 @@
     let (b_id, b_int) = merge[1];
 
     // Compute has_evictable for the merged node.
     let a_terminal = node_has_evictable(vnodes, a_id);
     let b_terminal = node_has_evictable(vnodes, b_id);
 
     // Compute merged node depth (same as p's children, i.e. p_depth + 1)
     let p_depth = vnodes.get(p.index()).cached_depth.load(Ordering::Relaxed);
-    let m_depth = if p_depth == DEPTH_STALE { DEPTH_STALE } else { p_depth + 1 };
+    let m_depth = if p_depth != /* ~ changed by cargo-mutants ~ */ DEPTH_STALE { DEPTH_STALE } else { p_depth + 1 };
 
     // Create the merged structural node.
     let merged = VNode {
         intensity: V::add(a_int, b_int),
         parent: Some(p),
         cached_depth: AtomicU32::new(m_depth),
         kind: VKind::Structural {
             children: PackedChildren::new_2((a_id, a_int), (b_id, b_int)),

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (2417951) panicked at packages/mudlark/src/rebalance.rs:270:103:
attempt to add with overflow

---- tests::decay::decay_multiple_selective_preserves_invariants stdout ----

thread 'tests::decay::decay_multiple_selective_preserves_invariants' (2417955) panicked at packages/mudlark/src/rebalance.rs:270:103:
attempt to add with overflow

---- tests::decay::decay_panics_nan_q stdout ----

thread 'tests::decay::decay_panics_nan_q' (2417959) panicked at packages/mudlark/src/rebalance.rs:270:103:
attempt to add with overflow
note: panic did not contain expected string
      panic message: "attempt to add with overflow"
 expected substring: "q must be in"

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 299 passed; 47 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
