*** packages/mudlark/src/rebalance.rs:270:76: replace + with * in contract

*** mutation diff:
--- packages/mudlark/src/rebalance.rs
+++ replace + with * in contract
@@ -262,17 +262,17 @@
     let (b_id, b_int) = merge[1];
 
     // Compute has_evictable for the merged node.
     let a_terminal = node_has_evictable(vnodes, a_id);
     let b_terminal = node_has_evictable(vnodes, b_id);
 
     // Compute merged node depth (same as p's children, i.e. p_depth + 1)
     let p_depth = vnodes.get(p.index()).cached_depth.load(Ordering::Relaxed);
-    let m_depth = if p_depth == DEPTH_STALE { DEPTH_STALE } else { p_depth + 1 };
+    let m_depth = if p_depth == DEPTH_STALE { DEPTH_STALE } else { p_depth * /* ~ changed by cargo-mutants ~ */ 1 };
 
     // Create the merged structural node.
     let merged = VNode {
         intensity: V::add(a_int, b_int),
         parent: Some(p),
         cached_depth: AtomicU32::new(m_depth),
         kind: VKind::Structural {
             children: PackedChildren::new_2((a_id, a_int), (b_id, b_int)),

---- tests::decay::decay_amplification_above_one stdout ----

thread 'tests::decay::decay_amplification_above_one' (2424728) panicked at packages/mudlark/src/vtree.rs:213:9:
assertion `left == right` failed: cached depth mismatch for VNode VNodeId(22)
  left: 2
 right: 3

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (2424729) panicked at packages/mudlark/src/vtree.rs:213:9:
assertion `left == right` failed: cached depth mismatch for VNode VNodeId(22)
  left: 2
 right: 3

---- tests::decay::decay_f64_tree stdout ----

thread 'tests::decay::decay_f64_tree' (2424732) panicked at packages/mudlark/src/vtree.rs:213:9:
assertion `left == right` failed: cached depth mismatch for VNode VNodeId(9)
  left: 1
 right: 2

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 294 passed; 52 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
