*** packages/mudlark/src/rebalance.rs:279:39: replace || with && in contract

*** mutation diff:
--- packages/mudlark/src/rebalance.rs
+++ replace || with && in contract
@@ -271,17 +271,17 @@
 
     // Create the merged structural node.
     let merged = VNode {
         intensity: V::add(a_int, b_int),
         parent: Some(p),
         cached_depth: AtomicU32::new(m_depth),
         kind: VKind::Structural {
             children: PackedChildren::new_2((a_id, a_int), (b_id, b_int)),
-            has_evictable: a_terminal || b_terminal,
+            has_evictable: a_terminal && /* ~ changed by cargo-mutants ~ */ b_terminal,
         },
     };
     let m_id = VNodeId::from_index(vnodes.alloc(merged));
 
     // Re-parent a and b.
     vnodes.get_mut(a_id.index()).parent = Some(m_id);
     vnodes.get_mut(b_id.index()).parent = Some(m_id);

---- tests::decay::decay_multiple_uniform_preserves_invariants stdout ----

thread 'tests::decay::decay_multiple_uniform_preserves_invariants' (2425951) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (4 total):
V-I7 violated at V-node 4: has_evictable=false, expected=true
V-I7 violated at V-node 20: has_evictable=false, expected=true
V-I7 violated at V-node 22: has_evictable=false, expected=true
V-I7 violated at V-node 32: has_evictable=false, expected=true

---- tests::decay::decay_energy_conservation_selective stdout ----

thread 'tests::decay::decay_energy_conservation_selective' (2425947) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (4 total):
V-I7 violated at V-node 4: has_evictable=false, expected=true
V-I7 violated at V-node 20: has_evictable=false, expected=true
V-I7 violated at V-node 22: has_evictable=false, expected=true
V-I7 violated at V-node 32: has_evictable=false, expected=true

---- tests::decay::decay_panics_nan_attenuation stdout ----

thread 'tests::decay::decay_panics_nan_attenuation' (2425953) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (4 total):
V-I7 violated at V-node 4: has_evictable=false, expected=true
V-I7 violated at V-node 20: has_evictable=false, expected=true
V-I7 violated at V-node 22: has_evictable=false, expected=true
V-I7 violated at V-node 32: has_evictable=false, expected=true
note: panic did not contain expected string
 expected substring: "attenuation must be > 0"

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 304 passed; 42 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
