*** packages/mudlark/src/rebalance.rs:295:33: replace || with && in contract

*** mutation diff:
--- packages/mudlark/src/rebalance.rs
+++ replace || with && in contract
@@ -287,17 +287,17 @@
 
     // Invalidate depth cache for a and b subtrees (they moved down one level)
     invalidate_depth_subtree(vnodes, a_id);
     invalidate_depth_subtree(vnodes, b_id);
 
     // Rewrite p as a 2-node: [isolate, merged].
     let merged_int = V::add(a_int, b_int);
     let iso_terminal = node_has_evictable(vnodes, isolate.0);
-    let m_terminal = a_terminal || b_terminal;
+    let m_terminal = a_terminal && /* ~ changed by cargo-mutants ~ */ b_terminal;
 
     let p_node = vnodes.get_mut(p.index());
     if let VKind::Structural { children, has_evictable } = &mut p_node.kind {
         *children = PackedChildren::new_2(isolate, (m_id, merged_int));
         *has_evictable = iso_terminal || m_terminal;
     }
 
     // Propagate terminal flags upward from p.

*** result: Success
