*** packages/mudlark/src/rebalance.rs:358:27: replace != with == in standard_promote

*** mutation diff:
--- packages/mudlark/src/rebalance.rs
+++ replace != with == in standard_promote
@@ -350,17 +350,17 @@
     // Find the sibling of c in p.
     let sibling_id = {
         let p_node = vnodes.get(p.index());
         match &p_node.kind {
             VKind::Structural { children, .. } => {
                 let mut sib = None;
                 for i in 0..children.len() {
                     let (id, _) = children.get(i);
-                    if id != c {
+                    if id == /* ~ changed by cargo-mutants ~ */ c {
                         sib = Some(children.get(i));
                         break;
                     }
                 }
                 sib.expect("standard_promote: sibling not found")
             }
             VKind::Entry { .. } => panic!("standard_promote: parent must be structural"),
         }

---- tests::decay::decay_noop_at_attenuation_one stdout ----

thread 'tests::decay::decay_noop_at_attenuation_one' (2443067) panicked at packages/mudlark/src/arena.rs:93:9:
Arena::get: slot 8 is not occupied

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (2443057) panicked at packages/mudlark/src/arena.rs:93:9:
Arena::get: slot 8 is not occupied

---- tests::decay::decay_panics_q_above_one stdout ----

thread 'tests::decay::decay_panics_q_above_one' (2443073) panicked at packages/mudlark/src/arena.rs:93:9:
Arena::get: slot 8 is not occupied
note: panic did not contain expected string
      panic message: "Arena::get: slot 8 is not occupied"
 expected substring: "q must be in"

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 293 passed; 53 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
