*** packages/mudlark/src/rebalance.rs:430:27: replace != with == in skip_promote

*** mutation diff:
--- packages/mudlark/src/rebalance.rs
+++ replace != with == in skip_promote
@@ -422,17 +422,17 @@
     // Find the sibling of c under p.
     let (s_id, s_int) = {
         let p_node = vnodes.get(p.index());
         match &p_node.kind {
             VKind::Structural { children, .. } => {
                 let mut sib = None;
                 for i in 0..children.len() {
                     let (id, int) = children.get(i);
-                    if id != c {
+                    if id == /* ~ changed by cargo-mutants ~ */ c {
                         sib = Some((id, int));
                         break;
                     }
                 }
                 sib.expect("skip_promote: sibling not found")
             }
             VKind::Entry { .. } => panic!("skip_promote: parent must be structural"),
         }

---- tests::decay::decay_noop_at_attenuation_one stdout ----

thread 'tests::decay::decay_noop_at_attenuation_one' (2458088) panicked at packages/mudlark/src/arena.rs:93:9:
Arena::get: slot 3 is not occupied

---- tests::decay::decay_amplification_above_one stdout ----

thread 'tests::decay::decay_amplification_above_one' (2458081) panicked at packages/mudlark/src/arena.rs:93:9:
Arena::get: slot 3 is not occupied

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (2458082) panicked at packages/mudlark/src/arena.rs:93:9:
Arena::get: slot 3 is not occupied

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 266 passed; 80 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
