*** packages/mudlark/src/rebalance.rs:452:27: replace != with == in skip_promote

*** mutation diff:
--- packages/mudlark/src/rebalance.rs
+++ replace != with == in skip_promote
@@ -444,17 +444,17 @@
     // First find the uncle (sibling of p in g).
     let (u_id, u_int) = {
         let g_node = vnodes.get(g.index());
         match &g_node.kind {
             VKind::Structural { children, .. } => {
                 let mut uncle = None;
                 for i in 0..children.len() {
                     let (id, int) = children.get(i);
-                    if id != p {
+                    if id == /* ~ changed by cargo-mutants ~ */ p {
                         uncle = Some((id, int));
                         break;
                     }
                 }
                 uncle.expect("skip_promote: uncle not found")
             }
             VKind::Entry { .. } => panic!("skip_promote: grandparent must be structural"),
         }

---- tests::decay::decay_multiple_uniform_preserves_invariants stdout ----

thread 'tests::decay::decay_multiple_uniform_preserves_invariants' (2460631) panicked at packages/mudlark/src/arena.rs:93:9:
Arena::get: slot 3 is not occupied

---- tests::decay::decay_amplification_above_one stdout ----

thread 'tests::decay::decay_amplification_above_one' (2460625) panicked at packages/mudlark/src/arena.rs:93:9:
Arena::get: slot 3 is not occupied

---- tests::decay::decay_f64_tree stdout ----

thread 'tests::decay::decay_f64_tree' (2460629) panicked at packages/mudlark/src/arena.rs:93:9:
Arena::get: slot 3 is not occupied

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 267 passed; 79 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
