*** packages/mudlark/src/rebalance.rs:509:23: replace != with == in sibling_of

*** mutation diff:
--- packages/mudlark/src/rebalance.rs
+++ replace != with == in sibling_of
@@ -501,17 +501,17 @@
 ///
 /// Panics if `parent` is not structural, or if `child` is not found.
 fn sibling_of<V: Accumulator>(vnodes: &Arena<VNode<V>>, parent: VNodeId, child: VNodeId) -> (VNodeId, V) {
     let p_node = vnodes.get(parent.index());
     match &p_node.kind {
         VKind::Structural { children, .. } => {
             for i in 0..children.len() {
                 let (id, int) = children.get(i);
-                if id != child {
+                if id == /* ~ changed by cargo-mutants ~ */ child {
                     return (id, int);
                 }
             }
             panic!("sibling_of: child not found in parent");
         }
         VKind::Entry { .. } => panic!("sibling_of: parent must be structural"),
     }
 }

---- tests::observe::observe_violations_empty_after_eviction stdout ----

thread 'tests::observe::observe_violations_empty_after_eviction' (2475584) panicked at packages/mudlark/src/arena.rs:93:9:
Arena::get: slot 3 is not occupied

---- tests::observe::observe_invariants_hold_after_eviction_cycle stdout ----

thread 'tests::observe::observe_invariants_hold_after_eviction_cycle' (2475574) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (3 total):
V-I1 cached intensity mismatch at V-node 4, child 3: cached=21, actual=6
V-I1 violated at V-node 4: intensity=33, sum of children=42
V-parent link: V-node 8 has parent 4, but parent does not list it as a child

---- tests::structural::semi_internal_surviving_child_unaffected stdout ----

thread 'tests::structural::semi_internal_surviving_child_unaffected' (2475731) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (2 total):
V-I1 cached intensity mismatch at V-node 4, child 11: cached=78, actual=18
V-parent link: V-node 9 has parent 4, but parent does not list it as a child

failures:
    tests::observe::observe_invariants_hold_after_eviction_cycle
    tests::observe::observe_violations_empty_after_eviction
    tests::structural::semi_internal_surviving_child_unaffected

test result: FAILED. 343 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
