*** packages/mudlark/src/rebalance.rs:632:34: replace == with != in legacy_promote

*** mutation diff:
--- packages/mudlark/src/rebalance.rs
+++ replace == with != in legacy_promote
@@ -624,17 +624,17 @@
     let g_node = vnodes.get_mut(g.index());
     if let VKind::Structural { children, has_evictable } = &mut g_node.kind {
         *children = PackedChildren::new_3((c, c_int), (p, p_int), (u_id, u_int));
         *has_evictable = c_evictable || p_evictable || u_evictable;
     }
 
     vnodes.get_mut(c.index()).parent = Some(g);
     // c moved up one level: update its depth
-    let new_c_depth = if c_depth == DEPTH_STALE { DEPTH_STALE } else { c_depth - 1 };
+    let new_c_depth = if c_depth != /* ~ changed by cargo-mutants ~ */ DEPTH_STALE { DEPTH_STALE } else { c_depth - 1 };
     vnodes.get(c.index()).cached_depth.store(new_c_depth, Ordering::Relaxed);
 
     // ── Freeze c: gnode now has 2 G-children ────────────────────
     if let VKind::Entry {
         is_exposed,
         is_evictable,
         ..
     } = &mut vnodes.get_mut(c.index()).kind

*** result: Success
