*** packages/mudlark/src/rebalance.rs:684:8: delete ! in push_side_effect_violations_with_config

*** mutation diff:
--- packages/mudlark/src/rebalance.rs
+++ delete ! in push_side_effect_violations_with_config
@@ -676,17 +676,17 @@
 /// Used for testing to prove this source catches violations others miss.
 #[inline]
 pub fn push_side_effect_violations_with_config<V: Accumulator>(
     vnodes: &Arena<VNode<V>>,
     node: VNodeId,
     violations: &mut Vec<VNodeId>,
     config: ViolationSources,
 ) {
-    if !config.source_3_contraction_grandchildren {
+    if  /* ~ changed by cargo-mutants ~ */config.source_3_contraction_grandchildren {
         return;
     }
     push_grandchild_violations(vnodes, node, violations);
 }
 
 /// Push source-10 violations: grandchildren of the merged node after
 /// g-contraction + promotion (§IDEA M-11.12).
 ///

---- tests::decay::decay_amplification_above_one stdout ----

thread 'tests::decay::decay_amplification_above_one' (2504328) panicked at packages/mudlark/src/rebalance.rs:1445:9:
rebalance finished with residual violations: [VNodeId(10)]

---- tests::decay::decay_energy_conservation_uniform stdout ----

thread 'tests::decay::decay_energy_conservation_uniform' (2504331) panicked at packages/mudlark/src/rebalance.rs:1445:9:
rebalance finished with residual violations: [VNodeId(10)]

---- tests::decay::decay_multiple_uniform_preserves_invariants stdout ----

thread 'tests::decay::decay_multiple_uniform_preserves_invariants' (2504334) panicked at packages/mudlark/src/rebalance.rs:1445:9:
rebalance finished with residual violations: [VNodeId(10)]

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 301 passed; 45 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
