*** packages/mudlark/src/rebalance.rs:707:8: delete ! in push_source_10_violations_with_config

*** mutation diff:
--- packages/mudlark/src/rebalance.rs
+++ delete ! in push_source_10_violations_with_config
@@ -699,17 +699,17 @@
 /// Configurable variant of [`push_source_10_violations`].
 #[inline]
 pub fn push_source_10_violations_with_config<V: Accumulator>(
     vnodes: &Arena<VNode<V>>,
     node: VNodeId,
     violations: &mut Vec<VNodeId>,
     config: ViolationSources,
 ) {
-    if !config.source_10_g_contraction_promotion {
+    if  /* ~ changed by cargo-mutants ~ */config.source_10_g_contraction_promotion {
         return;
     }
     push_grandchild_violations(vnodes, node, violations);
 }
 
 /// Shared grandchild-scan logic used by sources 3 and 10.
 fn push_grandchild_violations<V: Accumulator>(vnodes: &Arena<VNode<V>>, node: VNodeId, violations: &mut Vec<VNodeId>) {
     let child_ids: Vec<VNodeId> = match &vnodes.get(node.index()).kind {

---- tests::diagnostic::decay_creates_span stdout ----

thread 'tests::diagnostic::decay_creates_span' (2506945) panicked at packages/mudlark/src/tests/diagnostic.rs:362:5:
expected a 'decay*' span in: ["observe", "bootstrap_split", "plateau_after_bootstrap_split", "normalize_plateaus", "observe", "catalytic_split", "plateau_after_catalytic_split", "normalize_plateaus", "normalize_plateaus"]

---- tests::rebalance::source_10_g_contraction_promotion_grandchildren_necessary stdout ----

thread 'tests::rebalance::source_10_g_contraction_promotion_grandchildren_necessary' (2507161) panicked at packages/mudlark/src/tests/rebalance.rs:998:5:
source 10 disabled: x1 should NOT be caught

failures:
    tests::diagnostic::decay_creates_span
    tests::rebalance::source_10_g_contraction_promotion_grandchildren_necessary

test result: FAILED. 344 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
