*** packages/mudlark/src/rebalance.rs:819:8: delete ! in push_leaf_removal_violations_with_config

*** mutation diff:
--- packages/mudlark/src/rebalance.rs
+++ delete ! in push_leaf_removal_violations_with_config
@@ -811,17 +811,17 @@
 /// Used for testing to prove this source catches violations others miss.
 #[inline]
 pub fn push_leaf_removal_violations_with_config<V: Accumulator>(
     vnodes: &Arena<VNode<V>>,
     start: VNodeId,
     violations: &mut Vec<VNodeId>,
     config: ViolationSources,
 ) {
-    if !config.source_6_leaf_removal_ancestors {
+    if  /* ~ changed by cargo-mutants ~ */config.source_6_leaf_removal_ancestors {
         return;
     }
     let mut ancestor = start;
     while let Some(parent) = vnodes.get(ancestor.index()).parent {
         // Iterate siblings of `ancestor` under `parent`.
         let sibling_ids: Vec<VNodeId> = match &vnodes.get(parent.index()).kind {
             VKind::Structural { children, .. } => children.iter().map(|(id, _)| id).filter(|&id| id != ancestor).collect(),
             VKind::Entry { .. } => break,

---- budget_50_tight_small_buffer stdout ----
2026-03-16T21:34:57.680889Z ERROR torrust_mudlark::diagnostic: MISSED VIOLATION DIAGNOSIS node=54 intensity=34.0 parent=59 parent_intensity=69.0 grandparent=49 grandparent_intensity=131.0 uncle_desc=["v73(29)", "v28(33)"] max_uncle=33.0 is_violation=true
2026-03-16T21:34:57.680908Z ERROR torrust_mudlark::diagnostic: eviction context (child_count: 2=collapse, 3=3→2) evicted_parent=Some(33) child_count=3 collapse_sibling=None
2026-03-16T21:34:57.680939Z ERROR vtree_path_to_violated{node=54}: torrust_mudlark::diagnostic: ancestry depth=0 node=54 kind="E" intensity=34.0
2026-03-16T21:34:57.680945Z ERROR vtree_path_to_violated{node=54}: torrust_mudlark::diagnostic: ancestry depth=1 node=59 kind="S2" intensity=69.0
2026-03-16T21:34:57.680947Z ERROR vtree_path_to_violated{node=54}: torrust_mudlark::diagnostic: ancestry depth=2 node=49 kind="S3" inte

---- budget_200_sustained_load stdout ----
2026-03-16T21:34:57.682687Z ERROR torrust_mudlark::diagnostic: MISSED VIOLATION DIAGNOSIS node=251 intensity=10.0 parent=267 parent_intensity=11.0 grandparent=268 grandparent_intensity=18.0 uncle_desc=["v230(7)"] max_uncle=7.0 is_violation=true
2026-03-16T21:34:57.682703Z ERROR torrust_mudlark::diagnostic: eviction context (child_count: 2=collapse, 3=3→2) evicted_parent=Some(252) child_count=2 collapse_sibling=Some(222)
2026-03-16T21:34:57.682706Z ERROR torrust_mudlark::diagnostic: node is NOT a descendant of collapse_sibling node=251 collapse_sibling=222
2026-03-16T21:34:57.682713Z ERROR vtree_path_to_violated{node=251}: torrust_mudlark::diagnostic: ancestry depth=0 node=251 kind="E" intensity=10.0
2026-03-16T21:34:57.682716Z ERROR vtree_path_to_violated{node=251}: torrust_mudlark::diagnostic: ancestry depth=1 node=267 kind="S2" intensity=11.0

failures:
    budget_200_sustained_load
    budget_50_tight_small_buffer

test result: FAILED. 22 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
