*** packages/mudlark/src/rebalance.rs:826:101: replace != with == in push_leaf_removal_violations_with_config

*** mutation diff:
--- packages/mudlark/src/rebalance.rs
+++ replace != with == in push_leaf_removal_violations_with_config
@@ -818,17 +818,17 @@
 ) {
     if !config.source_6_leaf_removal_ancestors {
         return;
     }
     let mut ancestor = start;
     while let Some(parent) = vnodes.get(ancestor.index()).parent {
         // Iterate siblings of `ancestor` under `parent`.
         let sibling_ids: Vec<VNodeId> = match &vnodes.get(parent.index()).kind {
-            VKind::Structural { children, .. } => children.iter().map(|(id, _)| id).filter(|&id| id != ancestor).collect(),
+            VKind::Structural { children, .. } => children.iter().map(|(id, _)| id).filter(|&id| id == /* ~ changed by cargo-mutants ~ */ ancestor).collect(),
             VKind::Entry { .. } => break,
         };
 
         // Check each sibling's children for violations.
         for sib_id in sibling_ids {
             if let VKind::Structural { children, .. } = &vnodes.get(sib_id.index()).kind {
                 for i in 0..children.len() {
                     let (child_id, _) = children.get(i);

---- budget_50_tight_small_buffer stdout ----
2026-03-16T21:34:56.603310Z ERROR torrust_mudlark::diagnostic: MISSED VIOLATION DIAGNOSIS node=54 intensity=34.0 parent=59 parent_intensity=69.0 grandparent=49 grandparent_intensity=131.0 uncle_desc=["v73(29)", "v28(33)"] max_uncle=33.0 is_violation=true
2026-03-16T21:34:56.603326Z ERROR torrust_mudlark::diagnostic: eviction context (child_count: 2=collapse, 3=3→2) evicted_parent=Some(33) child_count=3 collapse_sibling=None
2026-03-16T21:34:56.603341Z ERROR vtree_path_to_violated{node=54}: torrust_mudlark::diagnostic: ancestry depth=0 node=54 kind="E" intensity=34.0
2026-03-16T21:34:56.603350Z ERROR vtree_path_to_violated{node=54}: torrust_mudlark::diagnostic: ancestry depth=1 node=59 kind="S2" intensity=69.0
2026-03-16T21:34:56.603353Z ERROR vtree_path_to_violated{node=54}: torrust_mudlark::diagnostic: ancestry depth=2 node=49 kind="S3" inte

---- budget_200_sustained_load stdout ----
2026-03-16T21:34:56.604252Z ERROR torrust_mudlark::diagnostic: MISSED VIOLATION DIAGNOSIS node=251 intensity=10.0 parent=267 parent_intensity=11.0 grandparent=268 grandparent_intensity=18.0 uncle_desc=["v230(7)"] max_uncle=7.0 is_violation=true
2026-03-16T21:34:56.604260Z ERROR torrust_mudlark::diagnostic: eviction context (child_count: 2=collapse, 3=3→2) evicted_parent=Some(252) child_count=2 collapse_sibling=Some(222)
2026-03-16T21:34:56.604262Z ERROR torrust_mudlark::diagnostic: node is NOT a descendant of collapse_sibling node=251 collapse_sibling=222
2026-03-16T21:34:56.604268Z ERROR vtree_path_to_violated{node=251}: torrust_mudlark::diagnostic: ancestry depth=0 node=251 kind="E" intensity=10.0
2026-03-16T21:34:56.604271Z ERROR vtree_path_to_violated{node=251}: torrust_mudlark::diagnostic: ancestry depth=1 node=267 kind="S2" intensity=11.0

failures:
    budget_200_sustained_load
    budget_50_tight_small_buffer

test result: FAILED. 22 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
