*** packages/mudlark/src/rebalance.rs:878:8: delete ! in push_collapse_violations_with_config

*** mutation diff:
--- packages/mudlark/src/rebalance.rs
+++ delete ! in push_collapse_violations_with_config
@@ -870,17 +870,17 @@
 /// Used for testing to prove this source catches violations others miss.
 #[inline]
 pub fn push_collapse_violations_with_config<V: Accumulator>(
     vnodes: &Arena<VNode<V>>,
     sole: VNodeId,
     violations: &mut Vec<VNodeId>,
     config: ViolationSources,
 ) {
-    if !config.source_7_collapse_children {
+    if  /* ~ changed by cargo-mutants ~ */config.source_7_collapse_children {
         return;
     }
     tracing::debug!(sole = sole.index(), "push_collapse_violations: checking node");
     push_children_violations(vnodes, sole, "collapse (source 7)", violations);
 }
 
 /// Check the remaining siblings' children after a 3→2 transition.
 ///

---- tests::rebalance::source_7_collapse_children_necessary stdout ----

thread 'tests::rebalance::source_7_collapse_children_necessary' (2527559) panicked at packages/mudlark/src/tests/rebalance.rs:818:5:
source 7 disabled: c1 should NOT be caught

failures:
    tests::rebalance::source_7_collapse_children_necessary

test result: FAILED. 345 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
