*** packages/mudlark/src/rebalance.rs:924:97: replace != with == in push_remaining_sibling_violations_with_config

*** mutation diff:
--- packages/mudlark/src/rebalance.rs
+++ replace != with == in push_remaining_sibling_violations_with_config
@@ -916,17 +916,17 @@
     violations: &mut Vec<VNodeId>,
     config: ViolationSources,
 ) {
     if !config.source_8_three_to_two_siblings {
         return;
     }
     // Get the remaining children of p (excluding removed).
     let remaining: Vec<VNodeId> = match &vnodes.get(p.index()).kind {
-        VKind::Structural { children, .. } => children.iter().map(|(id, _)| id).filter(|&id| id != removed).collect(),
+        VKind::Structural { children, .. } => children.iter().map(|(id, _)| id).filter(|&id| id == /* ~ changed by cargo-mutants ~ */ removed).collect(),
         VKind::Entry { .. } => return,
     };
 
     // Check each remaining sibling's children for violations.
     for sibling in remaining {
         push_children_violations(vnodes, sibling, "3→2 transition (source 8)", violations);
     }
 }

---- tests::rebalance::source_8_three_to_two_transition_necessary stdout ----

thread 'tests::rebalance::source_8_three_to_two_transition_necessary' (2532487) panicked at packages/mudlark/src/tests/rebalance.rs:883:5:
source 8 enabled: a1 SHOULD be caught

failures:
    tests::rebalance::source_8_three_to_two_transition_necessary

test result: FAILED. 345 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
