*** packages/mudlark/src/rebalance.rs:986:8: delete ! in push_cousin_violations_with_config

*** mutation diff:
--- packages/mudlark/src/rebalance.rs
+++ delete ! in push_cousin_violations_with_config
@@ -978,17 +978,17 @@
 #[inline]
 pub fn push_cousin_violations_with_config<V: Accumulator>(
     vnodes: &Arena<VNode<V>>,
     sole: VNodeId,
     grandparent: VNodeId,
     violations: &mut Vec<VNodeId>,
     config: ViolationSources,
 ) {
-    if !config.source_9_collapse_cousins {
+    if  /* ~ changed by cargo-mutants ~ */config.source_9_collapse_cousins {
         return;
     }
     // Get the OTHER children of grandparent (excluding sole, which was just promoted)
     let cousins: Vec<VNodeId> = match &vnodes.get(grandparent.index()).kind {
         VKind::Structural { children, .. } => children.iter().map(|(id, _)| id).filter(|&id| id != sole).collect(),
         VKind::Entry { .. } => return,
     };

---- tests::rebalance::source_9_collapse_cousins_necessary stdout ----

thread 'tests::rebalance::source_9_collapse_cousins_necessary' (2534451) panicked at packages/mudlark/src/tests/rebalance.rs:922:5:
source 9 disabled: c1 should NOT be caught

failures:
    tests::rebalance::source_9_collapse_cousins_necessary

test result: FAILED. 345 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
