*** packages/mudlark/src/split.rs:158:22: replace += with *= in bootstrap_split

*** mutation diff:
--- packages/mudlark/src/split.rs
+++ replace += with *= in bootstrap_split
@@ -150,17 +150,17 @@
     } = &mut graph.vnodes.get_mut(entry_id.index()).kind
     {
         *is_exposed = false;
         *is_evictable = false;
     }
 
     // Update graph state.
     graph.v_root = Some(root_s_id);
-    graph.node_count += 2;
+    graph.node_count *= /* ~ changed by cargo-mutants ~ */ 2;
     // +2 new terminals, −1 parent no longer terminal = net +1.
     graph.terminal_count += 1;
 
     // Plateau maintenance (no-op without `plateau` feature).
     graph.plateau_after_bootstrap_split(g_id, left_id);
 
     #[cfg(feature = "dynamic-contour-tracking")]
     if tracing::enabled!(tracing::Level::DEBUG) {

---- tests::decay::decay_f64_tree stdout ----

thread 'tests::decay::decay_f64_tree' (2704862) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
Node count: graph.node_count()=14, arena count=15

---- tests::decay::decay_amplification_above_one stdout ----

thread 'tests::decay::decay_amplification_above_one' (2704858) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
Node count: graph.node_count()=18, arena count=19

---- tests::decay::decay_energy_conservation_uniform stdout ----

thread 'tests::decay::decay_energy_conservation_uniform' (2704861) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
Node count: graph.node_count()=18, arena count=19

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 263 passed; 83 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
