*** packages/mudlark/src/split.rs:210:76: replace + with - in catalytic_split

*** mutation diff:
--- packages/mudlark/src/split.rs
+++ replace + with - in catalytic_split
@@ -202,17 +202,17 @@
     graph.gnodes.get_mut(g_id.index()).right = Some(right_id);
 
     // V-Tree: create entries for children.
     let le_id = alloc_v_entry(&mut graph.vnodes, &mut graph.gnodes, left_id);
     let re_id = alloc_v_entry(&mut graph.vnodes, &mut graph.gnodes, right_id);
 
     // Get parent's depth to compute s_depth
     let p_depth = graph.vnodes.get(p_id.index()).cached_depth.load(Ordering::Relaxed);
-    let s_depth = if p_depth == DEPTH_STALE { DEPTH_STALE } else { p_depth + 1 };
+    let s_depth = if p_depth == DEPTH_STALE { DEPTH_STALE } else { p_depth - /* ~ changed by cargo-mutants ~ */ 1 };
     let child_depth = if s_depth == DEPTH_STALE { DEPTH_STALE } else { s_depth + 1 };
 
     // V-Tree: structural wrapping the entries.
     let s = VNode {
         intensity: V::zero(),
         parent: Some(p_id),
         cached_depth: AtomicU32::new(s_depth),
         kind: VKind::Structural {

---- tests::decay::decay_energy_conservation_uniform stdout ----

thread 'tests::decay::decay_energy_conservation_uniform' (2720168) panicked at packages/mudlark/src/vtree.rs:213:9:
assertion `left == right` failed: cached depth mismatch for VNode VNodeId(14)
  left: 2
 right: 4

---- tests::decay::decay_amplification_above_one stdout ----

thread 'tests::decay::decay_amplification_above_one' (2720165) panicked at packages/mudlark/src/vtree.rs:213:9:
assertion `left == right` failed: cached depth mismatch for VNode VNodeId(14)
  left: 2
 right: 4

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (2720166) panicked at packages/mudlark/src/vtree.rs:213:9:
assertion `left == right` failed: cached depth mismatch for VNode VNodeId(14)
  left: 2
 right: 4

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 298 passed; 48 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
