*** packages/mudlark/src/split.rs:259:22: replace += with *= in catalytic_split

*** mutation diff:
--- packages/mudlark/src/split.rs
+++ replace += with *= in catalytic_split
@@ -251,17 +251,17 @@
         *is_exposed = false;
         *is_evictable = false;
     }
 
     // Propagate evictable flags upward from p.
     propagate_evictable_flags(&mut graph.vnodes, p_id);
 
     // Update node count.
-    graph.node_count += 2;
+    graph.node_count *= /* ~ changed by cargo-mutants ~ */ 2;
     // +2 new terminals, −1 parent no longer terminal = net +1.
     graph.terminal_count += 1;
 
     // Plateau maintenance (no-op without `plateau` feature).
     graph.plateau_after_catalytic_split(g_id, left_id);
 
     #[cfg(feature = "dynamic-contour-tracking")]
     if tracing::enabled!(tracing::Level::DEBUG) {

---- tests::decay::decay_energy_conservation_uniform stdout ----

thread 'tests::decay::decay_energy_conservation_uniform' (2741260) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
Node count: graph.node_count()=768, arena count=19

---- tests::decay::decay_f64_tree stdout ----

thread 'tests::decay::decay_f64_tree' (2741261) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
Node count: graph.node_count()=192, arena count=15

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (2741258) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
Node count: graph.node_count()=768, arena count=19

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 283 passed; 63 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
