*** packages/mudlark/src/split.rs:41:25: replace || with && in attempt_split

*** mutation diff:
--- packages/mudlark/src/split.rs
+++ replace || with && in attempt_split
@@ -33,17 +33,17 @@
 /// # Panics
 ///
 /// Panics if the entry's V-parent link is inconsistent (the parent
 /// was confirmed to exist but is `None` after the bootstrap check).
 pub fn attempt_split<C: Coordinate, V: Accumulator + Inspectable, const N: u32>(graph: &mut GvGraph<C, V, N>, g_id: GNodeId) {
     let g = graph.gnodes.get(g_id.index());
 
     // Guard: must be terminal (no G-children).
-    if g.left.is_some() || g.right.is_some() {
+    if g.left.is_some() && /* ~ changed by cargo-mutants ~ */ g.right.is_some() {
         return;
     }
 
     // Guard: interval must be divisible.
     let mid = C::midpoint(g.lo, g.hi);
     if mid.partial_cmp(&g.lo) != Some(std::cmp::Ordering::Greater) {
         return;
     }

---- tests::structural::semi_internal_surviving_child_unaffected stdout ----
2026-03-16T21:38:52.543562Z ERROR torrust_mudlark::graph_plateau: PLATEAU DIVERGENCE DETECTED label="POST-SPLIT" only_dynamic=[BasisEdge(8)] only_static=[] differing=[BasisEdge(0)]
2026-03-16T21:38:52.543579Z ERROR torrust_mudlark::graph_plateau: DYNAMIC-ONLY plateau key=BasisEdge(8) depth=5 start=8 end=16 sum=48 basis=[7]
2026-03-16T21:38:52.543584Z ERROR torrust_mudlark::graph_plateau:   basis element gid=7 state=Terminal lo=8 hi=16 sum=48
2026-03-16T21:38:52.543587Z ERROR torrust_mudlark::graph_plateau: DIFFERS key=BasisEdge(0) dyn_depth=4 dyn_start=0 dyn_end=32 dyn_sum=180 stat_depth=4 stat_start=0 stat_end=32 stat_sum=126 basis=[2, 5]
2026-03-16T21:38:52.543591Z ERROR torrust_mudlark::graph_plateau:   basis element gid=2 state=SemiInternal lo=0 hi=16 sum=54 uniform_depth=None
2026-03-16T21:38:52.543594Z ERR

failures:
    tests::structural::semi_internal_surviving_child_unaffected

test result: FAILED. 345 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.14s

*** result: Failure(101)
