*** packages/mudlark/src/split.rs:47:31: replace != with == in attempt_split

*** mutation diff:
--- packages/mudlark/src/split.rs
+++ replace != with == in attempt_split
@@ -39,17 +39,17 @@
 
     // Guard: must be terminal (no G-children).
     if g.left.is_some() || g.right.is_some() {
         return;
     }
 
     // Guard: interval must be divisible.
     let mid = C::midpoint(g.lo, g.hi);
-    if mid.partial_cmp(&g.lo) != Some(std::cmp::Ordering::Greater) {
+    if mid.partial_cmp(&g.lo) == /* ~ changed by cargo-mutants ~ */ Some(std::cmp::Ordering::Greater) {
         return;
     }
 
     // Guard: sum must exceed split threshold θ.
     if g.sum.partial_cmp(&graph.config.split_threshold) != Some(std::cmp::Ordering::Greater) {
         return;
     }

---- tests::decay::decay_selective_subtree_preserves_invariants stdout ----

thread 'tests::decay::decay_selective_subtree_preserves_invariants' (2687157) panicked at packages/mudlark/src/tests/decay.rs:410:62:
called `Option::unwrap()` on a `None` value

---- tests::decay::decay_selective_subtree_leaves_other_half_unchanged stdout ----

thread 'tests::decay::decay_selective_subtree_leaves_other_half_unchanged' (2687156) panicked at packages/mudlark/src/tests/decay.rs:418:62:
called `Option::unwrap()` on a `None` value

---- tests::decay::decay_uniform_subtree_preserves_invariants stdout ----

thread 'tests::decay::decay_uniform_subtree_preserves_invariants' (2687167) panicked at packages/mudlark/src/tests/decay.rs:141:62:
called `Option::unwrap()` on a `None` value

failures:
    tests::decay::decay_selective_subtree_leaves_other_half_unchanged
    tests::decay::decay_selective_subtree_preserves_invariants
    tests::decay::decay_uniform_subtree_preserves_invariants
    tests::decay::decay_uniform_subtree_scales_only_target
    tests::diagnostic::catalytic_split_creates_span
    tests::diagnostic::evict_tip_creates_span
    tests::diagnostic::eviction_pipeline_creates_spans
    tests::diagnostic::gn_display_after_split
    tests::diagnostic::normalize_plateaus_creates_span
    tests::diagnostic::split_creates_bootstrap_split_span
    tests::diagnostic::vtree_remove_leaf_creates_span
    tests::evict::evict_after_observations_conserves_energy

test result: FAILED. 294 passed; 52 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
