*** packages/mudlark/src/split.rs:70:27: replace == with != in attempt_split

*** mutation diff:
--- packages/mudlark/src/split.rs
+++ replace == with != in attempt_split
@@ -62,17 +62,17 @@
     if graph.vnodes.get(entry_id.index()).parent.is_none() {
         bootstrap_split(graph, g_id);
         return;
     }
 
     // Preprocessing: if V-parent is 3-node, contract first.
     let p_id = graph.vnodes.get(entry_id.index()).parent.unwrap();
     if let VKind::Structural { children, .. } = &graph.vnodes.get(p_id.index()).kind {
-        if children.len() == 3 {
+        if children.len() != /* ~ changed by cargo-mutants ~ */ 3 {
             let _span = tracing::debug_span!(
                 "split_preprocess",
                 p = %Nd(&graph.vnodes, p_id),
             )
             .entered();
             let merged = contract(&mut graph.vnodes, p_id);
             push_side_effect_violations(&graph.vnodes, p_id, &mut graph.violations);
             push_side_effect_violations(&graph.vnodes, merged, &mut graph.violations);

---- tests::decay::decay_energy_conservation_uniform stdout ----

thread 'tests::decay::decay_energy_conservation_uniform' (2686372) panicked at packages/mudlark/src/rebalance.rs:247:9:
contract: p must be a 3-node

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (2686370) panicked at packages/mudlark/src/rebalance.rs:247:9:
contract: p must be a 3-node

---- tests::decay::decay_amplification_above_one stdout ----

thread 'tests::decay::decay_amplification_above_one' (2686367) panicked at packages/mudlark/src/rebalance.rs:247:9:
contract: p must be a 3-node

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 269 passed; 77 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
