*** packages/mudlark/src/split.rs:86:41: replace > with == in attempt_split

*** mutation diff:
--- packages/mudlark/src/split.rs
+++ replace > with == in attempt_split
@@ -78,17 +78,17 @@
             push_side_effect_violations(&graph.vnodes, merged, &mut graph.violations);
             push_promoted_violations(&graph.vnodes, p_id, &mut graph.violations);
         }
     }
 
     // Depth gate (checked against post-contraction position).
     // Re-read entry_id — the G-node's entry link is unchanged by contraction.
     let entry_id = graph.gnodes.get(g_id.index()).entry.unwrap();
-    if v_depth(&graph.vnodes, entry_id) > graph.live_depth_create {
+    if v_depth(&graph.vnodes, entry_id) == /* ~ changed by cargo-mutants ~ */ graph.live_depth_create {
         return;
     }
 
     catalytic_split(graph, g_id);
 }
 
 /// Bootstrap split: first split when V-root is a lone entry.
 ///

---- tests::split::depth_gate_rejects_deep_split stdout ----

thread 'tests::split::depth_gate_rejects_deep_split' (2708518) panicked at packages/mudlark/src/tests/split.rs:299:5:
assertion `left == right` failed
  left: 5
 right: 3

---- tests::split::preprocessing_contraction_before_catalytic_split stdout ----

thread 'tests::split::preprocessing_contraction_before_catalytic_split' (2708522) panicked at packages/mudlark/src/tests/split.rs:345:5:
assertion `left == right` failed
  left: 5
 right: 7

failures:
    tests::split::depth_gate_rejects_deep_split
    tests::split::preprocessing_contraction_before_catalytic_split

test result: FAILED. 344 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
