*** packages/mudlark/src/split.rs:86:41: replace > with < in attempt_split

*** mutation diff:
--- packages/mudlark/src/split.rs
+++ replace > with < in attempt_split
@@ -78,17 +78,17 @@
             push_side_effect_violations(&graph.vnodes, merged, &mut graph.violations);
             push_promoted_violations(&graph.vnodes, p_id, &mut graph.violations);
         }
     }
 
     // Depth gate (checked against post-contraction position).
     // Re-read entry_id — the G-node's entry link is unchanged by contraction.
     let entry_id = graph.gnodes.get(g_id.index()).entry.unwrap();
-    if v_depth(&graph.vnodes, entry_id) > graph.live_depth_create {
+    if v_depth(&graph.vnodes, entry_id) < /* ~ changed by cargo-mutants ~ */ graph.live_depth_create {
         return;
     }
 
     catalytic_split(graph, g_id);
 }
 
 /// Bootstrap split: first split when V-root is a lone entry.
 ///

---- tests::diagnostic::evict_tip_creates_span stdout ----

thread 'tests::diagnostic::evict_tip_creates_span' (2693056) panicked at packages/mudlark/src/tests/diagnostic.rs:348:5:

---- tests::diagnostic::eviction_pipeline_creates_spans stdout ----

thread 'tests::diagnostic::eviction_pipeline_creates_spans' (2693057) panicked at packages/mudlark/src/tests/diagnostic.rs:387:5:

---- tests::graph::check_evictions_unbounded_evicts_all stdout ----

thread 'tests::graph::check_evictions_unbounded_evicts_all' (2693097) panicked at packages/mudlark/src/tests/graph.rs:257:5:
should evict at least one candidate

failures:
    tests::diagnostic::catalytic_split_creates_span
    tests::diagnostic::evict_tip_creates_span
    tests::diagnostic::eviction_pipeline_creates_spans
    tests::diagnostic::vtree_remove_leaf_creates_span
    tests::graph::check_evictions_unbounded_evicts_all
    tests::graph::get_semi_internal_left_child_trims_right
    tests::graph::get_semi_internal_right_child_trims_left
    tests::observe::cascading_splits
    tests::split::catalytic_split_after_bootstrap
    tests::split::catalytic_split_creates_boundary
    tests::split::catalytic_split_is_violation_free
    tests::split::depth_gate_rejects_deep_split

test result: FAILED. 324 passed; 22 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
