*** packages/mudlark/src/testing/config.rs:101:9: delete field depth_evict from struct Config expression in cascade_config

*** mutation diff:
--- packages/mudlark/src/testing/config.rs
+++ delete field depth_evict from struct Config expression in cascade_config
@@ -93,17 +93,17 @@
 }
 
 /// Medium threshold for cascade testing: θ=3.
 #[must_use]
 pub const fn cascade_config() -> Config<u64> {
     Config {
         split_threshold: 3,
         depth_create: 4,
-        depth_evict: 8,
+         /* ~ changed by cargo-mutants ~ */
         ..BASE_U64
     }
 }
 
 /// Deep config for escalation testing: θ=2, `D_create`=5, `D_evict`=10.
 #[must_use]
 pub const fn deep_config() -> Config<u64> {
     Config {

*** result: Success
