*** packages/mudlark/src/testing/config.rs:111:9: delete field depth_create from struct Config expression in deep_config

*** mutation diff:
--- packages/mudlark/src/testing/config.rs
+++ delete field depth_create from struct Config expression in deep_config
@@ -103,17 +103,17 @@
     }
 }
 
 /// Deep config for escalation testing: θ=2, `D_create`=5, `D_evict`=10.
 #[must_use]
 pub const fn deep_config() -> Config<u64> {
     Config {
         split_threshold: 2,
-        depth_create: 5,
+         /* ~ changed by cargo-mutants ~ */
         depth_evict: 10,
         ..BASE_U64
     }
 }
 
 /// Aggressive config: θ=1 forces immediate splitting, creating many
 /// internal nodes and frequent violations.  Ideal for testing source
 /// 10 topology (overlapping violation neighborhoods).

*** result: Success
