*** packages/mudlark/src/testing/config.rs:125:9: delete field depth_evict from struct Config expression in aggressive_config

*** mutation diff:
--- packages/mudlark/src/testing/config.rs
+++ delete field depth_evict from struct Config expression in aggressive_config
@@ -117,17 +117,17 @@
 /// Aggressive config: θ=1 forces immediate splitting, creating many
 /// internal nodes and frequent violations.  Ideal for testing source
 /// 10 topology (overlapping violation neighborhoods).
 #[must_use]
 pub const fn aggressive_config() -> Config<u64> {
     Config {
         split_threshold: 1,
         depth_create: 5,
-        depth_evict: 10,
+         /* ~ changed by cargo-mutants ~ */
         ..BASE_U64
     }
 }
 
 /// Wide shallow config: θ=10, shallow `D_create`/`D_evict`.
 /// Creates wide, shallow trees — tests lateral violation propagation
 /// rather than deep escalation.
 #[must_use]

*** result: Success
