*** packages/mudlark/src/testing/config.rs:136:9: delete field split_threshold from struct Config expression in wide_shallow_config

*** mutation diff:
--- packages/mudlark/src/testing/config.rs
+++ delete field split_threshold from struct Config expression in wide_shallow_config
@@ -128,17 +128,17 @@
 }
 
 /// Wide shallow config: θ=10, shallow `D_create`/`D_evict`.
 /// Creates wide, shallow trees — tests lateral violation propagation
 /// rather than deep escalation.
 #[must_use]
 pub const fn wide_shallow_config() -> Config<u64> {
     Config {
-        split_threshold: 10,
+         /* ~ changed by cargo-mutants ~ */
         depth_create: 2,
         depth_evict: 4,
         ..BASE_U64
     }
 }
 
 /// Worked example config from §IDEA M-16: θ=5, `D_create`=3,
 /// `D_evict`=6, N=3 (domain [0,8)).

*** result: Success
