*** packages/mudlark/src/testing/config.rs:138:9: delete field depth_evict from struct Config expression in wide_shallow_config

*** mutation diff:
--- packages/mudlark/src/testing/config.rs
+++ delete field depth_evict from struct Config expression in wide_shallow_config
@@ -130,17 +130,17 @@
 /// Wide shallow config: θ=10, shallow `D_create`/`D_evict`.
 /// Creates wide, shallow trees — tests lateral violation propagation
 /// rather than deep escalation.
 #[must_use]
 pub const fn wide_shallow_config() -> Config<u64> {
     Config {
         split_threshold: 10,
         depth_create: 2,
-        depth_evict: 4,
+         /* ~ changed by cargo-mutants ~ */
         ..BASE_U64
     }
 }
 
 /// Worked example config from §IDEA M-16: θ=5, `D_create`=3,
 /// `D_evict`=6, N=3 (domain [0,8)).
 #[must_use]
 pub const fn worked_example_config() -> Config<u64> {

*** result: Success
