*** packages/mudlark/src/testing/config.rs:187:9: delete field depth_create from struct Config expression in f64_deep_config

*** mutation diff:
--- packages/mudlark/src/testing/config.rs
+++ delete field depth_create from struct Config expression in f64_deep_config
@@ -179,13 +179,13 @@
     BASE_F64
 }
 
 /// Deep f64 config for depth-saturation testing: θ=5.0,
 /// `D_create`=8, `D_evict`=16.
 #[must_use]
 pub const fn f64_deep_config() -> Config<f64> {
     Config {
-        depth_create: 8,
+         /* ~ changed by cargo-mutants ~ */
         depth_evict: 16,
         ..BASE_F64
     }
 }

*** result: Success
