*** packages/mudlark/src/testing/config.rs:188:9: delete field depth_evict from struct Config expression in f64_deep_config

*** mutation diff:
--- packages/mudlark/src/testing/config.rs
+++ delete field depth_evict from struct Config expression in f64_deep_config
@@ -180,12 +180,12 @@
 }
 
 /// Deep f64 config for depth-saturation testing: θ=5.0,
 /// `D_create`=8, `D_evict`=16.
 #[must_use]
 pub const fn f64_deep_config() -> Config<f64> {
     Config {
         depth_create: 8,
-        depth_evict: 16,
+         /* ~ changed by cargo-mutants ~ */
         ..BASE_F64
     }
 }

---- tests::decay_f64_depth::minimal_f64_depth_saturation stdout ----

thread 'tests::decay_f64_depth::minimal_f64_depth_saturation' (4120439) panicked at packages/mudlark/src/graph.rs:241:9:
Config: D_create (8) must be < D_evict (8) (idea.md D-I3)

failures:
    tests::decay_f64_depth::minimal_f64_depth_saturation

test result: FAILED. 345 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
