*** packages/mudlark/src/testing/config.rs:67:9: delete field budget from struct Config expression in tight_budget_config

*** mutation diff:
--- packages/mudlark/src/testing/config.rs
+++ delete field budget from struct Config expression in tight_budget_config
@@ -59,17 +59,17 @@
     }
 }
 
 /// Tight budget: minimum allowed budget for buffer=3 (headroom=81,
 /// budget=82, `soft_limit`=1).
 #[must_use]
 pub const fn tight_budget_config() -> Config<u64> {
     Config {
-        budget: Some(82),
+         /* ~ changed by cargo-mutants ~ */
         bounded_eviction: false,
         ..BASE_U64
     }
 }
 
 /// Small buffer config: buffer=1 (`D_evict`=4), headroom=9.
 #[must_use]
 pub const fn small_buffer_config(budget: usize) -> Config<u64> {

*** result: Success
