*** packages/mudlark/src/testing/config.rs:79:9: delete field bounded_eviction from struct Config expression in small_buffer_config

*** mutation diff:
--- packages/mudlark/src/testing/config.rs
+++ delete field bounded_eviction from struct Config expression in small_buffer_config
@@ -71,17 +71,17 @@
 }
 
 /// Small buffer config: buffer=1 (`D_evict`=4), headroom=9.
 #[must_use]
 pub const fn small_buffer_config(budget: usize) -> Config<u64> {
     Config {
         depth_evict: 4,
         budget: Some(budget),
-        bounded_eviction: false,
+         /* ~ changed by cargo-mutants ~ */
         ..BASE_U64
     }
 }
 
 /// Low threshold for frequent splits: θ=2, deeper depths.
 #[must_use]
 pub const fn low_threshold_config() -> Config<u64> {
     Config {

*** result: Success
