*** packages/mudlark/src/testing/config.rs:88:9: delete field split_threshold from struct Config expression in low_threshold_config

*** mutation diff:
--- packages/mudlark/src/testing/config.rs
+++ delete field split_threshold from struct Config expression in low_threshold_config
@@ -80,17 +80,17 @@
         ..BASE_U64
     }
 }
 
 /// Low threshold for frequent splits: θ=2, deeper depths.
 #[must_use]
 pub const fn low_threshold_config() -> Config<u64> {
     Config {
-        split_threshold: 2,
+         /* ~ changed by cargo-mutants ~ */
         depth_create: 4,
         depth_evict: 8,
         ..BASE_U64
     }
 }
 
 /// Medium threshold for cascade testing: θ=3.
 #[must_use]

*** result: Success
