*** packages/mudlark/src/testing/plan.rs:104:46: replace % with / in Plan<C, V>::sweep

*** mutation diff:
--- packages/mudlark/src/testing/plan.rs
+++ replace % with / in Plan<C, V>::sweep
@@ -96,17 +96,17 @@
         self
     }
 
     /// Monotone sweep: coordinates `0, 1, 2, …` (mod `domain`), with
     /// varying intensity `(i % 7) + 1`.
     #[must_use]
     pub fn sweep(mut self, domain: u64, n: usize) -> Self {
         for i in 0..n {
-            let coord = C::from_u64(i as u64 % domain);
+            let coord = C::from_u64(i as u64 / /* ~ changed by cargo-mutants ~ */ domain);
             #[allow(clippy::cast_precision_loss)]
             let delta = V::from_f64((i as u64 % 7 + 1) as f64);
             self.observations.push((coord, delta));
         }
         self
     }
 
     /// Alternating extremes: `lo`, `hi`, `lo`, `hi`, …

---- hard_budget_minimum_budget_small_buffer stdout ----

thread 'hard_budget_minimum_budget_small_buffer' (4155353) panicked at packages/mudlark/src/testing/runner.rs:117:9:
hard budget violated at observation 446 (coord=1, delta=6): node_count=11, budget=10

failures:
    hard_budget_minimum_budget_small_buffer

test result: FAILED. 23 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
