*** packages/mudlark/src/testing/plan.rs:106:51: replace + with - in Plan<C, V>::sweep

*** mutation diff:
--- packages/mudlark/src/testing/plan.rs
+++ replace + with - in Plan<C, V>::sweep
@@ -98,17 +98,17 @@
 
     /// Monotone sweep: coordinates `0, 1, 2, …` (mod `domain`), with
     /// varying intensity `(i % 7) + 1`.
     #[must_use]
     pub fn sweep(mut self, domain: u64, n: usize) -> Self {
         for i in 0..n {
             let coord = C::from_u64(i as u64 % domain);
             #[allow(clippy::cast_precision_loss)]
-            let delta = V::from_f64((i as u64 % 7 + 1) as f64);
+            let delta = V::from_f64((i as u64 % 7 - /* ~ changed by cargo-mutants ~ */ 1) as f64);
             self.observations.push((coord, delta));
         }
         self
     }
 
     /// Alternating extremes: `lo`, `hi`, `lo`, `hi`, …
     #[must_use]
     pub fn zigzag(mut self, lo: C, hi: C, delta: V, n: usize) -> Self {

---- bench_mirrors::observe::mirror_observe_deep stdout ----

thread 'bench_mirrors::observe::mirror_observe_deep' (4157435) panicked at packages/mudlark/src/testing/plan.rs:106:37:
attempt to subtract with overflow

failures:
    bench_mirrors::observe::mirror_observe_deep

test result: FAILED. 42 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.22s

*** result: Failure(101)
