*** packages/mudlark/src/testing/plan.rs:152:33: replace + with * in Plan<C, V>::skewed

*** mutation diff:
--- packages/mudlark/src/testing/plan.rs
+++ replace + with * in Plan<C, V>::skewed
@@ -144,17 +144,17 @@
     #[must_use]
     pub fn skewed(mut self, domain: u64, n: usize) -> Self {
         let quarter = domain / 4;
         for i in 0..n {
             let raw = i as u64 % domain;
             let coord = C::from_u64(raw);
             let delta = if raw < quarter {
                 #[allow(clippy::cast_precision_loss)]
-                V::from_f64((10 + (i as u64 % 7)) as f64)
+                V::from_f64((10 * /* ~ changed by cargo-mutants ~ */ (i as u64 % 7)) as f64)
             } else {
                 #[allow(clippy::cast_precision_loss)]
                 V::from_f64((1 + (i as u64 % 3)) as f64)
             };
             self.observations.push((coord, delta));
         }
         self
     }

*** result: Success
