*** packages/mudlark/src/testing/plan.rs:155:32: replace + with - in Plan<C, V>::skewed

*** mutation diff:
--- packages/mudlark/src/testing/plan.rs
+++ replace + with - in Plan<C, V>::skewed
@@ -147,17 +147,17 @@
         for i in 0..n {
             let raw = i as u64 % domain;
             let coord = C::from_u64(raw);
             let delta = if raw < quarter {
                 #[allow(clippy::cast_precision_loss)]
                 V::from_f64((10 + (i as u64 % 7)) as f64)
             } else {
                 #[allow(clippy::cast_precision_loss)]
-                V::from_f64((1 + (i as u64 % 3)) as f64)
+                V::from_f64((1 - /* ~ changed by cargo-mutants ~ */ (i as u64 % 3)) as f64)
             };
             self.observations.push((coord, delta));
         }
         self
     }
 
     /// Burst: `n_spread` uniform observations across `domain`,
     /// followed by `n_hot` concentrated observations at `hotspot`.

---- bench_mirrors::lifecycle::mirror_lifecycle_decay_skewed stdout ----

thread 'bench_mirrors::lifecycle::mirror_lifecycle_decay_skewed' (81640) panicked at packages/mudlark/src/testing/plan.rs:155:29:
attempt to subtract with overflow

---- bench_mirrors::extract::mirror_extract_full_skewed stdout ----

thread 'bench_mirrors::extract::mirror_extract_full_skewed' (81633) panicked at packages/mudlark/src/testing/plan.rs:155:29:
attempt to subtract with overflow

---- bench_mirrors::lifecycle::mirror_lifecycle_eviction_skewed stdout ----

thread 'bench_mirrors::lifecycle::mirror_lifecycle_eviction_skewed' (81644) panicked at packages/mudlark/src/testing/plan.rs:155:29:
attempt to subtract with overflow

failures:
    bench_mirrors::extract::mirror_extract_full_skewed
    bench_mirrors::lifecycle::mirror_lifecycle_decay_skewed
    bench_mirrors::lifecycle::mirror_lifecycle_eviction_skewed
    bench_mirrors::observe::mirror_observe_skewed
    bench_mirrors::query::mirror_query_sample_skewed

test result: FAILED. 38 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.78s

*** result: Failure(101)
