*** packages/mudlark/src/testing/plan.rs:155:32: replace + with * in Plan<C, V>::skewed

*** mutation diff:
--- packages/mudlark/src/testing/plan.rs
+++ replace + with * in Plan<C, V>::skewed
@@ -147,17 +147,17 @@
         for i in 0..n {
             let raw = i as u64 % domain;
             let coord = C::from_u64(raw);
             let delta = if raw < quarter {
                 #[allow(clippy::cast_precision_loss)]
                 V::from_f64((10 + (i as u64 % 7)) as f64)
             } else {
                 #[allow(clippy::cast_precision_loss)]
-                V::from_f64((1 + (i as u64 % 3)) as f64)
+                V::from_f64((1 * /* ~ changed by cargo-mutants ~ */ (i as u64 % 3)) as f64)
             };
             self.observations.push((coord, delta));
         }
         self
     }
 
     /// Burst: `n_spread` uniform observations across `domain`,
     /// followed by `n_hot` concentrated observations at `hotspot`.

*** result: Success
