*** packages/mudlark/src/testing/plan.rs:168:46: replace % with + in Plan<C, V>::burst

*** mutation diff:
--- packages/mudlark/src/testing/plan.rs
+++ replace % with + in Plan<C, V>::burst
@@ -160,17 +160,17 @@
     }
 
     /// Burst: `n_spread` uniform observations across `domain`,
     /// followed by `n_hot` concentrated observations at `hotspot`.
     /// Exercises growth → pressure → eviction → relaxation.
     #[must_use]
     pub fn burst(mut self, domain: u64, spread_delta: V, n_spread: usize, hotspot: C, hot_delta: V, n_hot: usize) -> Self {
         for i in 0..n_spread {
-            let coord = C::from_u64(i as u64 % domain);
+            let coord = C::from_u64(i as u64 + /* ~ changed by cargo-mutants ~ */ domain);
             self.observations.push((coord, spread_delta));
         }
         self.observations.extend(std::iter::repeat((hotspot, hot_delta)).take(n_hot));
         self
     }
 
     /// Uniform random spray: `n` observations at pseudo-random
     /// coordinates within `[0, domain)`, all with the same `delta`.

*** result: Success
