*** packages/mudlark/src/testing/plan.rs:199:39: replace == with != in Plan<C, V>::oscillating_hotspot

*** mutation diff:
--- packages/mudlark/src/testing/plan.rs
+++ replace == with != in Plan<C, V>::oscillating_hotspot
@@ -191,17 +191,17 @@
     }
 
     /// Oscillating hotspot: every `burst` observations the target
     /// switches between `a` and `b`.  Forces repeated deep refinement
     /// followed by abandonment and eviction.
     #[must_use]
     pub fn oscillating_hotspot(mut self, a: C, b: C, delta: V, burst: usize, cycles: usize) -> Self {
         for cycle in 0..cycles {
-            let target = if cycle % 2 == 0 { a } else { b };
+            let target = if cycle % 2 != /* ~ changed by cargo-mutants ~ */ 0 { a } else { b };
             self.observations.extend(std::iter::repeat((target, delta)).take(burst));
         }
         self
     }
 
     // ── Targeted patterns ─────────────────────────────
     //
     // These patterns create overlapping violation paths — two or more

---- tests::plan_builders::oscillating_hotspot_alternates_targets stdout ----

thread 'tests::plan_builders::oscillating_hotspot_alternates_targets' (131208) panicked at packages/mudlark/src/tests/plan_builders.rs:44:5:
assertion `left == right` failed
  left: 255
 right: 0

failures:
    tests::plan_builders::oscillating_hotspot_alternates_targets

test result: FAILED. 345 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
