*** packages/mudlark/src/testing/plan.rs:224:43: replace + with - in Plan<C, V>::interleaved_hotspots

*** mutation diff:
--- packages/mudlark/src/testing/plan.rs
+++ replace + with - in Plan<C, V>::interleaved_hotspots
@@ -216,17 +216,17 @@
     ///
     /// Unlike [`oscillating_hotspot`](Self::oscillating_hotspot) (2
     /// far-apart points), this targets `count` spatially close points
     /// whose V-Tree subtrees share ancestors, creating overlapping
     /// violation neighborhoods.
     #[must_use]
     pub fn interleaved_hotspots(mut self, start: u64, count: u64, spacing: u64, delta: V, burst: usize, cycles: usize) -> Self {
         for cycle in 0..cycles {
-            let coord = C::from_u64(start + (cycle as u64 % count) * spacing);
+            let coord = C::from_u64(start - /* ~ changed by cargo-mutants ~ */ (cycle as u64 % count) * spacing);
             self.observations.extend(std::iter::repeat((coord, delta)).take(burst));
         }
         self
     }
 
     /// Cousin rivalry: alternate observations between two adjacent
     /// subtree regions `[a_start, a_start+width)` and
     /// `[b_start, b_start+width)` with escalating intensity.

---- all_targeted_patterns_combined_n4 stdout ----

thread 'all_targeted_patterns_combined_n4' (144851) panicked at packages/mudlark/src/testing/plan.rs:224:37:
attempt to subtract with overflow

---- energy_conserved_everything_combined stdout ----

thread 'energy_conserved_everything_combined' (144869) panicked at packages/mudlark/src/testing/plan.rs:224:37:
attempt to subtract with overflow

---- energy_conserved_interleaved_hotspots stdout ----

thread 'energy_conserved_interleaved_hotspots' (144871) panicked at packages/mudlark/src/testing/plan.rs:224:37:
attempt to subtract with overflow

failures:
    all_targeted_patterns_combined_n4
    energy_conserved_everything_combined
    energy_conserved_interleaved_hotspots
    everything_combined_n8_aggressive
    interleaved_hotspots_n4_cascade
    interleaved_hotspots_n8_aggressive
    interleaved_hotspots_tight_spacing

test result: FAILED. 55 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
