*** packages/mudlark/src/testing/plan.rs:246:38: replace * with + in Plan<C, V>::cousin_rivalry

*** mutation diff:
--- packages/mudlark/src/testing/plan.rs
+++ replace * with + in Plan<C, V>::cousin_rivalry
@@ -238,17 +238,17 @@
     #[must_use]
     pub fn cousin_rivalry(mut self, a_start: u64, b_start: u64, width: u64, base: V, step: V, n: usize) -> Self {
         for i in 0..n {
             let offset = i as u64 % width;
             #[allow(clippy::cast_precision_loss)]
             let (region_start, intensity_mult) = if i % 2 == 0 {
                 (a_start, i as f64)
             } else {
-                (b_start, (i as f64) * 0.7)
+                (b_start, (i as f64) + /* ~ changed by cargo-mutants ~ */ 0.7)
             };
             let coord = C::from_u64(region_start + offset);
             #[allow(clippy::cast_precision_loss)]
             let delta = V::from_f64(intensity_mult.mul_add(step.to_f64_approx(), base.to_f64_approx()));
             self.observations.push((coord, delta));
         }
         self
     }

*** result: Success
