*** packages/mudlark/src/testing/plan.rs:248:50: replace + with * in Plan<C, V>::cousin_rivalry

*** mutation diff:
--- packages/mudlark/src/testing/plan.rs
+++ replace + with * in Plan<C, V>::cousin_rivalry
@@ -240,17 +240,17 @@
         for i in 0..n {
             let offset = i as u64 % width;
             #[allow(clippy::cast_precision_loss)]
             let (region_start, intensity_mult) = if i % 2 == 0 {
                 (a_start, i as f64)
             } else {
                 (b_start, (i as f64) * 0.7)
             };
-            let coord = C::from_u64(region_start + offset);
+            let coord = C::from_u64(region_start * /* ~ changed by cargo-mutants ~ */ offset);
             #[allow(clippy::cast_precision_loss)]
             let delta = V::from_f64(intensity_mult.mul_add(step.to_f64_approx(), base.to_f64_approx()));
             self.observations.push((coord, delta));
         }
         self
     }
 
     /// Adversarial cousins: targeted observations at two coordinates

*** result: Success
