*** packages/mudlark/src/testing/plan.rs:318:25: replace + with - in Plan<C, V>::neighborhood_burst

*** mutation diff:
--- packages/mudlark/src/testing/plan.rs
+++ replace + with - in Plan<C, V>::neighborhood_burst
@@ -310,17 +310,17 @@
     /// intensity proportional to proximity to `center`.
     ///
     /// Creates a dense cluster of violations in a small spatial
     /// region, forcing multiple concurrent violations with shared
     /// ancestors.
     #[must_use]
     pub fn neighborhood_burst(mut self, center: u64, radius: u64, base: V, n: usize) -> Self {
         let lo = center.saturating_sub(radius);
-        let hi = center + radius;
+        let hi = center - /* ~ changed by cargo-mutants ~ */ radius;
         let width = hi - lo + 1;
         for i in 0..n {
             let offset = i as u64 % width;
             let coord = C::from_u64(lo + offset);
             let dist = (lo + offset).abs_diff(center);
             #[allow(clippy::cast_precision_loss)]
             let delta = V::from_f64(base.to_f64_approx() * (1.0 + (radius as f64 - dist as f64)));
             self.observations.push((coord, delta));

---- neighborhood_burst_edge stdout ----

thread 'neighborhood_burst_edge' (253124) panicked at packages/mudlark/src/testing/plan.rs:318:18:
attempt to subtract with overflow

failures:
    neighborhood_burst_edge

test result: FAILED. 61 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
