*** packages/mudlark/src/testing/plan.rs:322:40: replace + with - in Plan<C, V>::neighborhood_burst

*** mutation diff:
--- packages/mudlark/src/testing/plan.rs
+++ replace + with - in Plan<C, V>::neighborhood_burst
@@ -314,17 +314,17 @@
     /// ancestors.
     #[must_use]
     pub fn neighborhood_burst(mut self, center: u64, radius: u64, base: V, n: usize) -> Self {
         let lo = center.saturating_sub(radius);
         let hi = center + radius;
         let width = hi - lo + 1;
         for i in 0..n {
             let offset = i as u64 % width;
-            let coord = C::from_u64(lo + offset);
+            let coord = C::from_u64(lo - /* ~ changed by cargo-mutants ~ */ offset);
             let dist = (lo + offset).abs_diff(center);
             #[allow(clippy::cast_precision_loss)]
             let delta = V::from_f64(base.to_f64_approx() * (1.0 + (radius as f64 - dist as f64)));
             self.observations.push((coord, delta));
         }
         self
     }

---- all_targeted_patterns_combined_n4 stdout ----

thread 'all_targeted_patterns_combined_n4' (289424) panicked at packages/mudlark/src/testing/plan.rs:322:37:
attempt to subtract with overflow

---- neighborhood_burst_edge stdout ----

thread 'neighborhood_burst_edge' (289483) panicked at packages/mudlark/src/testing/plan.rs:322:37:
attempt to subtract with overflow

---- multi_topology_stress_n4 stdout ----

thread 'multi_topology_stress_n4' (289481) panicked at packages/mudlark/src/testing/plan.rs:322:37:
attempt to subtract with overflow

failures:
    all_targeted_patterns_combined_n4
    multi_topology_stress_n4
    neighborhood_burst_edge
    neighborhood_burst_n4_center

test result: FAILED. 58 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.14s

*** result: Failure(101)
