*** packages/mudlark/src/testing/plan.rs:323:28: replace + with * in Plan<C, V>::neighborhood_burst

*** mutation diff:
--- packages/mudlark/src/testing/plan.rs
+++ replace + with * in Plan<C, V>::neighborhood_burst
@@ -315,17 +315,17 @@
     #[must_use]
     pub fn neighborhood_burst(mut self, center: u64, radius: u64, base: V, n: usize) -> Self {
         let lo = center.saturating_sub(radius);
         let hi = center + radius;
         let width = hi - lo + 1;
         for i in 0..n {
             let offset = i as u64 % width;
             let coord = C::from_u64(lo + offset);
-            let dist = (lo + offset).abs_diff(center);
+            let dist = (lo * /* ~ changed by cargo-mutants ~ */ offset).abs_diff(center);
             #[allow(clippy::cast_precision_loss)]
             let delta = V::from_f64(base.to_f64_approx() * (1.0 + (radius as f64 - dist as f64)));
             self.observations.push((coord, delta));
         }
         self
     }
 
     // ── Deep / structural patterns ──────────────────────────────

*** result: Success
