*** packages/mudlark/src/testing/plan.rs:325:65: replace + with - in Plan<C, V>::neighborhood_burst

*** mutation diff:
--- packages/mudlark/src/testing/plan.rs
+++ replace + with - in Plan<C, V>::neighborhood_burst
@@ -317,17 +317,17 @@
         let lo = center.saturating_sub(radius);
         let hi = center + radius;
         let width = hi - lo + 1;
         for i in 0..n {
             let offset = i as u64 % width;
             let coord = C::from_u64(lo + offset);
             let dist = (lo + offset).abs_diff(center);
             #[allow(clippy::cast_precision_loss)]
-            let delta = V::from_f64(base.to_f64_approx() * (1.0 + (radius as f64 - dist as f64)));
+            let delta = V::from_f64(base.to_f64_approx() * (1.0 - /* ~ changed by cargo-mutants ~ */ (radius as f64 - dist as f64)));
             self.observations.push((coord, delta));
         }
         self
     }
 
     // ── Deep / structural patterns ──────────────────────────────
     //
     // Exercise V-Tree depth, multi-level splitting, and restructuring

*** result: Success
