*** packages/mudlark/src/testing/plan.rs:325:82: replace - with / in Plan<C, V>::neighborhood_burst

*** mutation diff:
--- packages/mudlark/src/testing/plan.rs
+++ replace - with / in Plan<C, V>::neighborhood_burst
@@ -317,17 +317,17 @@
         let lo = center.saturating_sub(radius);
         let hi = center + radius;
         let width = hi - lo + 1;
         for i in 0..n {
             let offset = i as u64 % width;
             let coord = C::from_u64(lo + offset);
             let dist = (lo + offset).abs_diff(center);
             #[allow(clippy::cast_precision_loss)]
-            let delta = V::from_f64(base.to_f64_approx() * (1.0 + (radius as f64 - dist as f64)));
+            let delta = V::from_f64(base.to_f64_approx() * (1.0 + (radius as f64 / /* ~ changed by cargo-mutants ~ */ dist as f64)));
             self.observations.push((coord, delta));
         }
         self
     }
 
     // ── Deep / structural patterns ──────────────────────────────
     //
     // Exercise V-Tree depth, multi-level splitting, and restructuring

---- all_targeted_patterns_combined_n4 stdout ----

thread 'all_targeted_patterns_combined_n4' (342887) panicked at packages/mudlark/src/traits/accumulator.rs:245:1:
attempt to add with overflow

---- neighborhood_burst_n4_center stdout ----

thread 'neighborhood_burst_n4_center' (342954) panicked at packages/mudlark/src/traits/accumulator.rs:245:1:
attempt to add with overflow

---- multi_topology_stress_n8 stdout ----

thread 'multi_topology_stress_n8' (342952) panicked at packages/mudlark/src/traits/accumulator.rs:245:1:
attempt to add with overflow

failures:
    all_targeted_patterns_combined_n4
    everything_combined_n8_aggressive
    multi_topology_stress_n4
    multi_topology_stress_n8
    neighborhood_burst_edge
    neighborhood_burst_n4_center
    neighborhood_burst_n8_wide

test result: FAILED. 55 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
