*** packages/mudlark/src/testing/plan.rs:348:30: replace << with >> in Plan<C, V>::fractal_spray

*** mutation diff:
--- packages/mudlark/src/testing/plan.rs
+++ replace << with >> in Plan<C, V>::fractal_spray
@@ -340,17 +340,17 @@
     /// Level 1: `domain/4`, `3·domain/4`.
     /// Level k: `(2j+1) · domain / 2^(k+1)` for `j = 0..2^k`.
     ///
     /// Builds a balanced V-Tree top-down, creating splits at every
     /// level.
     #[must_use]
     pub fn fractal_spray(mut self, domain: u64, delta: V, depth: u32) -> Self {
         for d in 0..depth {
-            let denom = 1u64 << (d + 1);
+            let denom = 1u64 >> /* ~ changed by cargo-mutants ~ */ (d + 1);
             let count = 1u64 << d;
             for k in 0..count {
                 let coord = (2 * k + 1) * domain / denom;
                 if coord < domain {
                     self.observations.push((C::from_u64(coord), delta));
                 }
             }
         }

---- all_structural_patterns_combined_n4 stdout ----

thread 'all_structural_patterns_combined_n4' (346616) panicked at packages/mudlark/src/testing/plan.rs:351:29:
attempt to divide by zero

---- energy_conserved_everything_combined stdout ----

thread 'energy_conserved_everything_combined' (346635) panicked at packages/mudlark/src/testing/plan.rs:351:29:
attempt to divide by zero

---- fractal_spray_all_configs_n4 stdout ----

thread 'fractal_spray_all_configs_n4' (346640) panicked at packages/mudlark/src/testing/plan.rs:351:29:
attempt to divide by zero

failures:
    all_structural_patterns_combined_n4
    energy_conserved_everything_combined
    energy_conserved_fractal_spray
    everything_combined_n8_aggressive
    fractal_spray_all_configs_n4
    fractal_spray_n4_full
    fractal_spray_n8_deep
    multi_topology_stress_n4
    multi_topology_stress_n8

test result: FAILED. 53 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
