*** packages/mudlark/src/testing/plan.rs:348:36: replace + with * in Plan<C, V>::fractal_spray

*** mutation diff:
--- packages/mudlark/src/testing/plan.rs
+++ replace + with * in Plan<C, V>::fractal_spray
@@ -340,17 +340,17 @@
     /// Level 1: `domain/4`, `3·domain/4`.
     /// Level k: `(2j+1) · domain / 2^(k+1)` for `j = 0..2^k`.
     ///
     /// Builds a balanced V-Tree top-down, creating splits at every
     /// level.
     #[must_use]
     pub fn fractal_spray(mut self, domain: u64, delta: V, depth: u32) -> Self {
         for d in 0..depth {
-            let denom = 1u64 << (d + 1);
+            let denom = 1u64 << (d * /* ~ changed by cargo-mutants ~ */ 1);
             let count = 1u64 << d;
             for k in 0..count {
                 let coord = (2 * k + 1) * domain / denom;
                 if coord < domain {
                     self.observations.push((C::from_u64(coord), delta));
                 }
             }
         }

*** result: Success
