*** packages/mudlark/src/testing/plan.rs:349:30: replace << with >> in Plan<C, V>::fractal_spray

*** mutation diff:
--- packages/mudlark/src/testing/plan.rs
+++ replace << with >> in Plan<C, V>::fractal_spray
@@ -341,17 +341,17 @@
     /// Level k: `(2j+1) · domain / 2^(k+1)` for `j = 0..2^k`.
     ///
     /// Builds a balanced V-Tree top-down, creating splits at every
     /// level.
     #[must_use]
     pub fn fractal_spray(mut self, domain: u64, delta: V, depth: u32) -> Self {
         for d in 0..depth {
             let denom = 1u64 << (d + 1);
-            let count = 1u64 << d;
+            let count = 1u64 >> /* ~ changed by cargo-mutants ~ */ d;
             for k in 0..count {
                 let coord = (2 * k + 1) * domain / denom;
                 if coord < domain {
                     self.observations.push((C::from_u64(coord), delta));
                 }
             }
         }
         self

*** result: Success
