*** packages/mudlark/src/testing/plan.rs:352:26: replace < with > in Plan<C, V>::fractal_spray

*** mutation diff:
--- packages/mudlark/src/testing/plan.rs
+++ replace < with > in Plan<C, V>::fractal_spray
@@ -344,17 +344,17 @@
     /// level.
     #[must_use]
     pub fn fractal_spray(mut self, domain: u64, delta: V, depth: u32) -> Self {
         for d in 0..depth {
             let denom = 1u64 << (d + 1);
             let count = 1u64 << d;
             for k in 0..count {
                 let coord = (2 * k + 1) * domain / denom;
-                if coord < domain {
+                if coord > /* ~ changed by cargo-mutants ~ */ domain {
                     self.observations.push((C::from_u64(coord), delta));
                 }
             }
         }
         self
     }
 
     /// Nested bursts: multi-scale fractal bursts at progressively

*** result: Success
