*** packages/mudlark/src/testing/plan.rs:370:30: replace << with >> in Plan<C, V>::nested_bursts

*** mutation diff:
--- packages/mudlark/src/testing/plan.rs
+++ replace << with >> in Plan<C, V>::nested_bursts
@@ -362,17 +362,17 @@
     ///
     /// Same dyadic midpoint sequence as
     /// [`fractal_spray`](Self::fractal_spray), but each point gets
     /// `burst_per_level` repeated observations, creating sustained
     /// violations at every V-Tree depth simultaneously.
     #[must_use]
     pub fn nested_bursts(mut self, domain: u64, delta: V, levels: u32, burst_per_level: usize) -> Self {
         for level in 0..levels {
-            let denom = 1u64 << (level + 1);
+            let denom = 1u64 >> /* ~ changed by cargo-mutants ~ */ (level + 1);
             let count = 1u64 << level;
             for j in 0..count {
                 let coord = (2 * j + 1) * domain / denom;
                 if coord < domain {
                     self.observations
                         .extend(std::iter::repeat((C::from_u64(coord), delta)).take(burst_per_level));
                 }
             }

---- bench_mirrors::pathological::mirror_pathological_fractal_fill stdout ----

thread 'bench_mirrors::pathological::mirror_pathological_fractal_fill' (424373) panicked at packages/mudlark/src/testing/plan.rs:373:29:
attempt to divide by zero

failures:
    bench_mirrors::pathological::mirror_pathological_fractal_fill

test result: FAILED. 42 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.59s

*** result: Failure(101)
