*** packages/mudlark/src/testing/plan.rs:373:36: replace + with * in Plan<C, V>::nested_bursts

*** mutation diff:
--- packages/mudlark/src/testing/plan.rs
+++ replace + with * in Plan<C, V>::nested_bursts
@@ -365,17 +365,17 @@
     /// `burst_per_level` repeated observations, creating sustained
     /// violations at every V-Tree depth simultaneously.
     #[must_use]
     pub fn nested_bursts(mut self, domain: u64, delta: V, levels: u32, burst_per_level: usize) -> Self {
         for level in 0..levels {
             let denom = 1u64 << (level + 1);
             let count = 1u64 << level;
             for j in 0..count {
-                let coord = (2 * j + 1) * domain / denom;
+                let coord = (2 * j * /* ~ changed by cargo-mutants ~ */ 1) * domain / denom;
                 if coord < domain {
                     self.observations
                         .extend(std::iter::repeat((C::from_u64(coord), delta)).take(burst_per_level));
                 }
             }
         }
         self
     }

*** result: Success
