*** packages/mudlark/src/testing/plan.rs:374:26: replace < with <= in Plan<C, V>::nested_bursts

*** mutation diff:
--- packages/mudlark/src/testing/plan.rs
+++ replace < with <= in Plan<C, V>::nested_bursts
@@ -366,17 +366,17 @@
     /// violations at every V-Tree depth simultaneously.
     #[must_use]
     pub fn nested_bursts(mut self, domain: u64, delta: V, levels: u32, burst_per_level: usize) -> Self {
         for level in 0..levels {
             let denom = 1u64 << (level + 1);
             let count = 1u64 << level;
             for j in 0..count {
                 let coord = (2 * j + 1) * domain / denom;
-                if coord < domain {
+                if coord <= /* ~ changed by cargo-mutants ~ */ domain {
                     self.observations
                         .extend(std::iter::repeat((C::from_u64(coord), delta)).take(burst_per_level));
                 }
             }
         }
         self
     }

*** result: Success
