*** packages/mudlark/src/testing/plan.rs:458:22: replace / with % in Plan<C, V>::diamond

*** mutation diff:
--- packages/mudlark/src/testing/plan.rs
+++ replace / with % in Plan<C, V>::diamond
@@ -450,17 +450,17 @@
     ///
     /// Phase 1 (converge): alternating `0, domain−1, 1, domain−2, …`
     /// Phase 2 (diverge): center outward in both directions.
     ///
     /// Exercises tree restructuring in both contraction and expansion
     /// directions.
     #[must_use]
     pub fn diamond(mut self, domain: u64, delta: V, n: usize) -> Self {
-        let half = n / 2;
+        let half = n % /* ~ changed by cargo-mutants ~ */ 2;
         // Converge: outside → center
         for i in 0..half {
             let offset = i as u64 % (domain / 2);
             if i % 2 == 0 {
                 self.observations.push((C::from_u64(offset), delta));
             } else {
                 self.observations.push((C::from_u64(domain - 1 - offset), delta));
             }

*** result: Success
