*** packages/mudlark/src/testing/plan.rs:458:22: replace / with * in Plan<C, V>::diamond

*** mutation diff:
--- packages/mudlark/src/testing/plan.rs
+++ replace / with * in Plan<C, V>::diamond
@@ -450,17 +450,17 @@
     ///
     /// Phase 1 (converge): alternating `0, domain−1, 1, domain−2, …`
     /// Phase 2 (diverge): center outward in both directions.
     ///
     /// Exercises tree restructuring in both contraction and expansion
     /// directions.
     #[must_use]
     pub fn diamond(mut self, domain: u64, delta: V, n: usize) -> Self {
-        let half = n / 2;
+        let half = n * /* ~ changed by cargo-mutants ~ */ 2;
         // Converge: outside → center
         for i in 0..half {
             let offset = i as u64 % (domain / 2);
             if i % 2 == 0 {
                 self.observations.push((C::from_u64(offset), delta));
             } else {
                 self.observations.push((C::from_u64(domain - 1 - offset), delta));
             }

---- bench_mirrors::observe::mirror_observe_diamond stdout ----

thread 'bench_mirrors::observe::mirror_observe_diamond' (569185) panicked at packages/mudlark/src/testing/plan.rs:470:21:
attempt to subtract with overflow

---- bench_mirrors::pathological::mirror_pathological_diamond stdout ----

thread 'bench_mirrors::pathological::mirror_pathological_diamond' (569226) panicked at packages/mudlark/src/testing/plan.rs:470:21:
attempt to subtract with overflow

failures:
    bench_mirrors::observe::mirror_observe_diamond
    bench_mirrors::pathological::mirror_pathological_diamond

test result: FAILED. 41 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.35s

*** result: Failure(101)
