*** packages/mudlark/src/testing/plan.rs:461:45: replace / with * in Plan<C, V>::diamond

*** mutation diff:
--- packages/mudlark/src/testing/plan.rs
+++ replace / with * in Plan<C, V>::diamond
@@ -453,17 +453,17 @@
     ///
     /// Exercises tree restructuring in both contraction and expansion
     /// directions.
     #[must_use]
     pub fn diamond(mut self, domain: u64, delta: V, n: usize) -> Self {
         let half = n / 2;
         // Converge: outside → center
         for i in 0..half {
-            let offset = i as u64 % (domain / 2);
+            let offset = i as u64 % (domain * /* ~ changed by cargo-mutants ~ */ 2);
             if i % 2 == 0 {
                 self.observations.push((C::from_u64(offset), delta));
             } else {
                 self.observations.push((C::from_u64(domain - 1 - offset), delta));
             }
         }
         // Diverge: center → outside
         let center = domain / 2;

---- bench_mirrors::observe::mirror_observe_diamond stdout ----

thread 'bench_mirrors::observe::mirror_observe_diamond' (583657) panicked at packages/mudlark/src/testing/plan.rs:465:53:
attempt to subtract with overflow

---- bench_mirrors::pathological::mirror_pathological_diamond stdout ----

thread 'bench_mirrors::pathological::mirror_pathological_diamond' (583668) panicked at packages/mudlark/src/testing/plan.rs:465:53:
attempt to subtract with overflow

failures:
    bench_mirrors::observe::mirror_observe_diamond
    bench_mirrors::pathological::mirror_pathological_diamond

test result: FAILED. 41 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.37s

*** result: Failure(101)
