*** packages/mudlark/src/testing/plan.rs:470:24: replace - with / in Plan<C, V>::diamond

*** mutation diff:
--- packages/mudlark/src/testing/plan.rs
+++ replace - with / in Plan<C, V>::diamond
@@ -462,17 +462,17 @@
             if i % 2 == 0 {
                 self.observations.push((C::from_u64(offset), delta));
             } else {
                 self.observations.push((C::from_u64(domain - 1 - offset), delta));
             }
         }
         // Diverge: center → outside
         let center = domain / 2;
-        for i in 0..(n - half) {
+        for i in 0..(n / /* ~ changed by cargo-mutants ~ */ half) {
             let offset = i as u64 % (domain / 2);
             if i % 2 == 0 {
                 let coord = (center + offset).min(domain - 1);
                 self.observations.push((C::from_u64(coord), delta));
             } else {
                 self.observations
                     .push((C::from_u64(center.saturating_sub(offset + 1)), delta));
             }

*** result: Success
