*** packages/mudlark/src/testing/plan.rs:471:45: replace / with % in Plan<C, V>::diamond

*** mutation diff:
--- packages/mudlark/src/testing/plan.rs
+++ replace / with % in Plan<C, V>::diamond
@@ -463,17 +463,17 @@
                 self.observations.push((C::from_u64(offset), delta));
             } else {
                 self.observations.push((C::from_u64(domain - 1 - offset), delta));
             }
         }
         // Diverge: center → outside
         let center = domain / 2;
         for i in 0..(n - half) {
-            let offset = i as u64 % (domain / 2);
+            let offset = i as u64 % (domain % /* ~ changed by cargo-mutants ~ */ 2);
             if i % 2 == 0 {
                 let coord = (center + offset).min(domain - 1);
                 self.observations.push((C::from_u64(coord), delta));
             } else {
                 self.observations
                     .push((C::from_u64(center.saturating_sub(offset + 1)), delta));
             }
         }

---- bench_mirrors::observe::mirror_observe_diamond stdout ----

thread 'bench_mirrors::observe::mirror_observe_diamond' (662857) panicked at packages/mudlark/src/testing/plan.rs:471:26:
attempt to calculate the remainder with a divisor of zero

---- bench_mirrors::pathological::mirror_pathological_diamond stdout ----

thread 'bench_mirrors::pathological::mirror_pathological_diamond' (662875) panicked at packages/mudlark/src/testing/plan.rs:471:26:
attempt to calculate the remainder with a divisor of zero

failures:
    bench_mirrors::observe::mirror_observe_diamond
    bench_mirrors::pathological::mirror_pathological_diamond

test result: FAILED. 41 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.54s

*** result: Failure(101)
