*** packages/mudlark/src/testing/plan.rs:477:69: replace + with * in Plan<C, V>::diamond

*** mutation diff:
--- packages/mudlark/src/testing/plan.rs
+++ replace + with * in Plan<C, V>::diamond
@@ -469,17 +469,17 @@
         let center = domain / 2;
         for i in 0..(n - half) {
             let offset = i as u64 % (domain / 2);
             if i % 2 == 0 {
                 let coord = (center + offset).min(domain - 1);
                 self.observations.push((C::from_u64(coord), delta));
             } else {
                 self.observations
-                    .push((C::from_u64(center.saturating_sub(offset + 1)), delta));
+                    .push((C::from_u64(center.saturating_sub(offset * /* ~ changed by cargo-mutants ~ */ 1)), delta));
             }
         }
         self
     }
 
     /// Bit-flip walk: visit coordinates in Gray code order.
     ///
     /// Adjacent coordinates in a Gray code sequence differ by exactly

*** result: Success
