*** packages/mudlark/src/testing/plan.rs:492:32: replace % with + in Plan<C, V>::bit_flip_walk

*** mutation diff:
--- packages/mudlark/src/testing/plan.rs
+++ replace % with + in Plan<C, V>::bit_flip_walk
@@ -484,17 +484,17 @@
     ///
     /// Adjacent coordinates in a Gray code sequence differ by exactly
     /// one bit, meaning each step crosses exactly one sibling boundary
     /// in the V-Tree.  Systematically exercises every ancestor
     /// relationship.
     #[must_use]
     pub fn bit_flip_walk(mut self, domain: u64, delta: V, n: usize) -> Self {
         for i in 0..n {
-            let raw = i as u64 % domain;
+            let raw = i as u64 + /* ~ changed by cargo-mutants ~ */ domain;
             // Gray code: G(n) = n ^ (n >> 1)
             let gray = raw ^ (raw >> 1);
             self.observations.push((C::from_u64(gray % domain), delta));
         }
         self
     }
 
     /// Sibling flood: flood one half of the domain, then abruptly

*** result: Success
