*** packages/mudlark/src/testing/plan.rs:508:27: replace / with % in Plan<C, V>::sibling_flood

*** mutation diff:
--- packages/mudlark/src/testing/plan.rs
+++ replace / with % in Plan<C, V>::sibling_flood
@@ -500,17 +500,17 @@
     /// Sibling flood: flood one half of the domain, then abruptly
     /// flood the other half with (potentially different) intensity.
     ///
     /// The halves share the root as their common ancestor.  The
     /// abrupt shift forces massive restructuring at the shallowest
     /// tree level.
     #[must_use]
     pub fn sibling_flood(mut self, domain: u64, delta_first: V, delta_second: V, n_per_half: usize) -> Self {
-        let half = domain / 2;
+        let half = domain % /* ~ changed by cargo-mutants ~ */ 2;
         // Flood lower half
         for i in 0..n_per_half {
             self.observations.push((C::from_u64(i as u64 % half), delta_first));
         }
         // Flood upper half
         for i in 0..n_per_half {
             self.observations.push((C::from_u64(half + (i as u64 % half)), delta_second));
         }

---- all_coverage_patterns_combined_n4 stdout ----

thread 'all_coverage_patterns_combined_n4' (774480) panicked at packages/mudlark/src/testing/plan.rs:511:49:
attempt to calculate the remainder with a divisor of zero

---- sibling_flood_n8_asymmetric stdout ----

thread 'sibling_flood_n8_asymmetric' (774613) panicked at packages/mudlark/src/testing/plan.rs:511:49:
attempt to calculate the remainder with a divisor of zero

---- everything_combined_n8_aggressive stdout ----

thread 'everything_combined_n8_aggressive' (774535) panicked at packages/mudlark/src/testing/plan.rs:511:49:
attempt to calculate the remainder with a divisor of zero

failures:
    all_coverage_patterns_combined_n4
    everything_combined_n8_aggressive
    sibling_flood_n4_equal
    sibling_flood_n8_asymmetric

test result: FAILED. 58 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
