*** packages/mudlark/src/testing/plan.rs:515:54: replace + with - in Plan<C, V>::sibling_flood

*** mutation diff:
--- packages/mudlark/src/testing/plan.rs
+++ replace + with - in Plan<C, V>::sibling_flood
@@ -507,17 +507,17 @@
     pub fn sibling_flood(mut self, domain: u64, delta_first: V, delta_second: V, n_per_half: usize) -> Self {
         let half = domain / 2;
         // Flood lower half
         for i in 0..n_per_half {
             self.observations.push((C::from_u64(i as u64 % half), delta_first));
         }
         // Flood upper half
         for i in 0..n_per_half {
-            self.observations.push((C::from_u64(half + (i as u64 % half)), delta_second));
+            self.observations.push((C::from_u64(half - /* ~ changed by cargo-mutants ~ */ (i as u64 % half)), delta_second));
         }
         self
     }
 
     /// Mirrored growth: simultaneous symmetric observations at `x`
     /// and `domain − 1 − x` for `x = 0, 1, 2, …`.
     ///
     /// Forces balanced growth in both halves of the V-Tree, creating

*** result: Success
