*** packages/mudlark/src/testing/plan.rs:528:30: replace % with / in Plan<C, V>::mirrored_growth

*** mutation diff:
--- packages/mudlark/src/testing/plan.rs
+++ replace % with / in Plan<C, V>::mirrored_growth
@@ -520,17 +520,17 @@
     /// Mirrored growth: simultaneous symmetric observations at `x`
     /// and `domain − 1 − x` for `x = 0, 1, 2, …`.
     ///
     /// Forces balanced growth in both halves of the V-Tree, creating
     /// symmetric violation patterns.
     #[must_use]
     pub fn mirrored_growth(mut self, domain: u64, delta: V, n: usize) -> Self {
         for i in 0..n {
-            let x = i as u64 % (domain / 2);
+            let x = i as u64 / /* ~ changed by cargo-mutants ~ */ (domain / 2);
             self.observations.push((C::from_u64(x), delta));
             self.observations.push((C::from_u64(domain - 1 - x), delta));
         }
         self
     }
 
     /// Checkerboard: all even coordinates first, then all odd
     /// coordinates.

*** result: Success
