*** packages/mudlark/src/testing/plan.rs:528:40: replace / with * in Plan<C, V>::mirrored_growth

*** mutation diff:
--- packages/mudlark/src/testing/plan.rs
+++ replace / with * in Plan<C, V>::mirrored_growth
@@ -520,17 +520,17 @@
     /// Mirrored growth: simultaneous symmetric observations at `x`
     /// and `domain − 1 − x` for `x = 0, 1, 2, …`.
     ///
     /// Forces balanced growth in both halves of the V-Tree, creating
     /// symmetric violation patterns.
     #[must_use]
     pub fn mirrored_growth(mut self, domain: u64, delta: V, n: usize) -> Self {
         for i in 0..n {
-            let x = i as u64 % (domain / 2);
+            let x = i as u64 % (domain * /* ~ changed by cargo-mutants ~ */ 2);
             self.observations.push((C::from_u64(x), delta));
             self.observations.push((C::from_u64(domain - 1 - x), delta));
         }
         self
     }
 
     /// Checkerboard: all even coordinates first, then all odd
     /// coordinates.

---- all_coverage_patterns_combined_n4 stdout ----

thread 'all_coverage_patterns_combined_n4' (836384) panicked at packages/mudlark/src/testing/plan.rs:530:49:
attempt to subtract with overflow

---- mirrored_growth_n4 stdout ----

thread 'mirrored_growth_n4' (836418) panicked at packages/mudlark/src/testing/plan.rs:530:49:
attempt to subtract with overflow

---- multi_topology_stress_n4 stdout ----

thread 'multi_topology_stress_n4' (836420) panicked at packages/mudlark/src/testing/plan.rs:530:49:
attempt to subtract with overflow

failures:
    all_coverage_patterns_combined_n4
    mirrored_growth_n4
    multi_topology_stress_n4

test result: FAILED. 59 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
