*** packages/mudlark/src/testing/plan.rs:530:60: replace - with / in Plan<C, V>::mirrored_growth

*** mutation diff:
--- packages/mudlark/src/testing/plan.rs
+++ replace - with / in Plan<C, V>::mirrored_growth
@@ -522,17 +522,17 @@
     ///
     /// Forces balanced growth in both halves of the V-Tree, creating
     /// symmetric violation patterns.
     #[must_use]
     pub fn mirrored_growth(mut self, domain: u64, delta: V, n: usize) -> Self {
         for i in 0..n {
             let x = i as u64 % (domain / 2);
             self.observations.push((C::from_u64(x), delta));
-            self.observations.push((C::from_u64(domain - 1 - x), delta));
+            self.observations.push((C::from_u64(domain - 1 / /* ~ changed by cargo-mutants ~ */ x), delta));
         }
         self
     }
 
     /// Checkerboard: all even coordinates first, then all odd
     /// coordinates.
     ///
     /// Phase 1 creates violations at even-child boundaries; phase 2

---- all_coverage_patterns_combined_n4 stdout ----

thread 'all_coverage_patterns_combined_n4' (848470) panicked at packages/mudlark/src/testing/plan.rs:530:58:
attempt to divide by zero

---- mirrored_growth_n8 stdout ----

thread 'mirrored_growth_n8' (848516) panicked at packages/mudlark/src/testing/plan.rs:530:58:
attempt to divide by zero

---- multi_topology_stress_n4 stdout ----

thread 'multi_topology_stress_n4' (848517) panicked at packages/mudlark/src/testing/plan.rs:530:58:
attempt to divide by zero

failures:
    all_coverage_patterns_combined_n4
    everything_combined_n8_aggressive
    mirrored_growth_n4
    mirrored_growth_n8
    multi_topology_stress_n4
    multi_topology_stress_n8

test result: FAILED. 56 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
