*** packages/mudlark/src/testing/plan.rs:543:22: replace / with % in Plan<C, V>::checkerboard

*** mutation diff:
--- packages/mudlark/src/testing/plan.rs
+++ replace / with % in Plan<C, V>::checkerboard
@@ -535,17 +535,17 @@
     /// Checkerboard: all even coordinates first, then all odd
     /// coordinates.
     ///
     /// Phase 1 creates violations at even-child boundaries; phase 2
     /// injects adjacent violations that share parents with phase 1
     /// nodes, potentially triggering source 10 topology.
     #[must_use]
     pub fn checkerboard(mut self, domain: u64, delta_even: V, delta_odd: V, n: usize) -> Self {
-        let half = n / 2;
+        let half = n % /* ~ changed by cargo-mutants ~ */ 2;
         // Even coords
         for i in 0..half {
             let coord = (i as u64 * 2) % domain;
             self.observations.push((C::from_u64(coord), delta_even));
         }
         // Odd coords
         for i in 0..(n - half) {
             let coord = (i as u64 * 2 + 1) % domain;

*** result: Success
