*** packages/mudlark/src/testing/plan.rs:543:22: replace / with * in Plan<C, V>::checkerboard

*** mutation diff:
--- packages/mudlark/src/testing/plan.rs
+++ replace / with * in Plan<C, V>::checkerboard
@@ -535,17 +535,17 @@
     /// Checkerboard: all even coordinates first, then all odd
     /// coordinates.
     ///
     /// Phase 1 creates violations at even-child boundaries; phase 2
     /// injects adjacent violations that share parents with phase 1
     /// nodes, potentially triggering source 10 topology.
     #[must_use]
     pub fn checkerboard(mut self, domain: u64, delta_even: V, delta_odd: V, n: usize) -> Self {
-        let half = n / 2;
+        let half = n * /* ~ changed by cargo-mutants ~ */ 2;
         // Even coords
         for i in 0..half {
             let coord = (i as u64 * 2) % domain;
             self.observations.push((C::from_u64(coord), delta_even));
         }
         // Odd coords
         for i in 0..(n - half) {
             let coord = (i as u64 * 2 + 1) % domain;

---- all_coverage_patterns_combined_n4 stdout ----

thread 'all_coverage_patterns_combined_n4' (862477) panicked at packages/mudlark/src/testing/plan.rs:550:21:
attempt to subtract with overflow

---- checkerboard_n8_asymmetric stdout ----

thread 'checkerboard_n8_asymmetric' (862487) panicked at packages/mudlark/src/testing/plan.rs:550:21:
attempt to subtract with overflow

---- checkerboard_n4_equal stdout ----

thread 'checkerboard_n4_equal' (862486) panicked at packages/mudlark/src/testing/plan.rs:550:21:
attempt to subtract with overflow

failures:
    all_coverage_patterns_combined_n4
    checkerboard_n4_equal
    checkerboard_n8_asymmetric
    energy_conserved_everything_combined
    everything_combined_n8_aggressive

test result: FAILED. 57 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
