*** packages/mudlark/src/testing/plan.rs:546:40: replace % with + in Plan<C, V>::checkerboard

*** mutation diff:
--- packages/mudlark/src/testing/plan.rs
+++ replace % with + in Plan<C, V>::checkerboard
@@ -538,17 +538,17 @@
     /// Phase 1 creates violations at even-child boundaries; phase 2
     /// injects adjacent violations that share parents with phase 1
     /// nodes, potentially triggering source 10 topology.
     #[must_use]
     pub fn checkerboard(mut self, domain: u64, delta_even: V, delta_odd: V, n: usize) -> Self {
         let half = n / 2;
         // Even coords
         for i in 0..half {
-            let coord = (i as u64 * 2) % domain;
+            let coord = (i as u64 * 2) + /* ~ changed by cargo-mutants ~ */ domain;
             self.observations.push((C::from_u64(coord), delta_even));
         }
         // Odd coords
         for i in 0..(n - half) {
             let coord = (i as u64 * 2 + 1) % domain;
             self.observations.push((C::from_u64(coord), delta_odd));
         }
         self

*** result: Success
