*** packages/mudlark/src/testing/plan.rs:550:24: replace - with + in Plan<C, V>::checkerboard

*** mutation diff:
--- packages/mudlark/src/testing/plan.rs
+++ replace - with + in Plan<C, V>::checkerboard
@@ -542,17 +542,17 @@
     pub fn checkerboard(mut self, domain: u64, delta_even: V, delta_odd: V, n: usize) -> Self {
         let half = n / 2;
         // Even coords
         for i in 0..half {
             let coord = (i as u64 * 2) % domain;
             self.observations.push((C::from_u64(coord), delta_even));
         }
         // Odd coords
-        for i in 0..(n - half) {
+        for i in 0..(n + /* ~ changed by cargo-mutants ~ */ half) {
             let coord = (i as u64 * 2 + 1) % domain;
             self.observations.push((C::from_u64(coord), delta_odd));
         }
         self
     }
 
     /// Pincer: two fronts approaching each other from opposite ends
     /// of `[lo, hi]`.

*** result: Success
