*** packages/mudlark/src/testing/plan.rs:551:39: replace + with - in Plan<C, V>::checkerboard

*** mutation diff:
--- packages/mudlark/src/testing/plan.rs
+++ replace + with - in Plan<C, V>::checkerboard
@@ -543,17 +543,17 @@
         let half = n / 2;
         // Even coords
         for i in 0..half {
             let coord = (i as u64 * 2) % domain;
             self.observations.push((C::from_u64(coord), delta_even));
         }
         // Odd coords
         for i in 0..(n - half) {
-            let coord = (i as u64 * 2 + 1) % domain;
+            let coord = (i as u64 * 2 - /* ~ changed by cargo-mutants ~ */ 1) % domain;
             self.observations.push((C::from_u64(coord), delta_odd));
         }
         self
     }
 
     /// Pincer: two fronts approaching each other from opposite ends
     /// of `[lo, hi]`.
     ///

---- all_coverage_patterns_combined_n4 stdout ----

thread 'all_coverage_patterns_combined_n4' (924615) panicked at packages/mudlark/src/testing/plan.rs:551:25:
attempt to subtract with overflow

---- checkerboard_n4_equal stdout ----

thread 'checkerboard_n4_equal' (924635) panicked at packages/mudlark/src/testing/plan.rs:551:25:
attempt to subtract with overflow

---- checkerboard_n8_asymmetric stdout ----

thread 'checkerboard_n8_asymmetric' (924637) panicked at packages/mudlark/src/testing/plan.rs:551:25:
attempt to subtract with overflow

failures:
    all_coverage_patterns_combined_n4
    checkerboard_n4_equal
    checkerboard_n8_asymmetric
    energy_conserved_everything_combined
    everything_combined_n8_aggressive

test result: FAILED. 57 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
