*** packages/mudlark/src/testing/plan.rs:570:25: replace != with == in Plan<C, V>::pincer

*** mutation diff:
--- packages/mudlark/src/testing/plan.rs
+++ replace != with == in Plan<C, V>::pincer
@@ -562,17 +562,17 @@
     /// eventually share the same ancestor at every depth.
     #[must_use]
     pub fn pincer(mut self, lo: u64, hi: u64, delta: V, burst_per_step: usize) -> Self {
         let mut left = lo;
         let mut right = hi;
         while left <= right {
             for _ in 0..burst_per_step {
                 self.observations.push((C::from_u64(left), delta));
-                if left != right {
+                if left == /* ~ changed by cargo-mutants ~ */ right {
                     self.observations.push((C::from_u64(right), delta));
                 }
             }
             left += 1;
             if right == 0 {
                 break;
             }
             right -= 1;

*** result: Success
