*** packages/mudlark/src/testing/plan.rs:574:18: replace += with -= in Plan<C, V>::pincer

*** mutation diff:
--- packages/mudlark/src/testing/plan.rs
+++ replace += with -= in Plan<C, V>::pincer
@@ -566,17 +566,17 @@
         let mut right = hi;
         while left <= right {
             for _ in 0..burst_per_step {
                 self.observations.push((C::from_u64(left), delta));
                 if left != right {
                     self.observations.push((C::from_u64(right), delta));
                 }
             }
-            left += 1;
+            left -= /* ~ changed by cargo-mutants ~ */ 1;
             if right == 0 {
                 break;
             }
             right -= 1;
         }
         self
     }

---- bench_mirrors::pathological::mirror_pathological_pincer stdout ----

thread 'bench_mirrors::pathological::mirror_pathological_pincer' (949873) panicked at packages/mudlark/src/testing/plan.rs:574:13:
attempt to subtract with overflow

failures:
    bench_mirrors::pathological::mirror_pathological_pincer

test result: FAILED. 42 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.34s

*** result: Failure(101)
