*** packages/mudlark/src/testing/plan.rs:613:64: replace + with - in Plan<C, V>::sawtooth

*** mutation diff:
--- packages/mudlark/src/testing/plan.rs
+++ replace + with - in Plan<C, V>::sawtooth
@@ -605,17 +605,17 @@
     /// intensity escalating each cycle.
     ///
     /// Creates periodic pressure waves that force the V-Tree to
     /// adapt to ever-increasing load.
     #[must_use]
     pub fn sawtooth(mut self, width: u64, base: V, cycles: usize) -> Self {
         for k in 0..cycles {
             #[allow(clippy::cast_precision_loss)]
-            let delta = V::from_f64(base.to_f64_approx() * ((k + 1) as f64));
+            let delta = V::from_f64(base.to_f64_approx() * ((k - /* ~ changed by cargo-mutants ~ */ 1) as f64));
             for x in 0..width {
                 self.observations.push((C::from_u64(x), delta));
             }
         }
         self
     }
 
     /// Centroid drift: a hotspot that slides across the domain from

---- all_coverage_patterns_combined_n4 stdout ----

thread 'all_coverage_patterns_combined_n4' (1008389) panicked at packages/mudlark/src/testing/plan.rs:613:61:
attempt to subtract with overflow

---- everything_combined_n8_aggressive stdout ----

thread 'everything_combined_n8_aggressive' (1008414) panicked at packages/mudlark/src/testing/plan.rs:613:61:
attempt to subtract with overflow

---- sawtooth_n4 stdout ----

thread 'sawtooth_n4' (1008446) panicked at packages/mudlark/src/testing/plan.rs:613:61:
attempt to subtract with overflow

failures:
    all_coverage_patterns_combined_n4
    everything_combined_n8_aggressive
    sawtooth_n4
    sawtooth_n8

test result: FAILED. 58 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
