*** packages/mudlark/src/testing/plan.rs:630:33: replace <= with > in Plan<C, V>::centroid_drift

*** mutation diff:
--- packages/mudlark/src/testing/plan.rs
+++ replace <= with > in Plan<C, V>::centroid_drift
@@ -622,17 +622,17 @@
     /// `start` to `end`, spending `burst_len` observations at each
     /// coordinate.
     ///
     /// Creates a moving front of violations that exercises different
     /// V-Tree neighborhoods in sequence, with lingering effects from
     /// previous positions.
     #[must_use]
     pub fn centroid_drift(mut self, start: u64, end: u64, delta: V, burst_len: usize) -> Self {
-        let (lo, hi) = if start <= end { (start, end) } else { (end, start) };
+        let (lo, hi) = if start > /* ~ changed by cargo-mutants ~ */ end { (start, end) } else { (end, start) };
         for coord in lo..=hi {
             self.observations
                 .extend(std::iter::repeat((C::from_u64(coord), delta)).take(burst_len));
         }
         self
     }
 
     /// Pulse decay: concentrated initial burst that decays in both

*** result: Success
