*** packages/mudlark/src/testing/plan.rs:647:58: replace / with % in Plan<C, V>::pulse_decay

*** mutation diff:
--- packages/mudlark/src/testing/plan.rs
+++ replace / with % in Plan<C, V>::pulse_decay
@@ -639,17 +639,17 @@
     /// intensity and spatial extent over successive rounds.
     ///
     /// Round k: intensity = `base / (k + 1)`, coordinates cycle
     /// through `[center − k, center + k] ∩ [0, domain)`.
     #[must_use]
     pub fn pulse_decay(mut self, center: u64, domain: u64, base: V, rounds: usize, obs_per_round: usize) -> Self {
         for k in 0..rounds {
             #[allow(clippy::cast_precision_loss)]
-            let delta = V::from_f64(base.to_f64_approx() / (k as f64 + 1.0));
+            let delta = V::from_f64(base.to_f64_approx() % /* ~ changed by cargo-mutants ~ */ (k as f64 + 1.0));
             let lo = center.saturating_sub(k as u64);
             let hi = (center + k as u64).min(domain - 1);
             let width = hi - lo + 1;
             for j in 0..obs_per_round {
                 let coord = C::from_u64(lo + (j as u64 % width));
                 self.observations.push((coord, delta));
             }
         }


