*** packages/mudlark/src/testing/plan.rs:69:9: replace Plan<C, V>::len -> usize with 1

*** mutation diff:
--- packages/mudlark/src/testing/plan.rs
+++ replace Plan<C, V>::len -> usize with 1
@@ -61,17 +61,17 @@
     pub fn then(mut self, other: Self) -> Self {
         self.observations.extend(other.observations);
         self
     }
 
     /// Number of observations in the plan.
     #[must_use]
     pub fn len(&self) -> usize {
-        self.observations.len()
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Whether the plan has zero observations.
     #[must_use]
     pub fn is_empty(&self) -> bool {
         self.observations.is_empty()
     }
 }

---- tests::plan_builders::oscillating_hotspot_produces_expected_count stdout ----

thread 'tests::plan_builders::oscillating_hotspot_produces_expected_count' (4131095) panicked at packages/mudlark/src/tests/plan_builders.rs:37:5:
assertion `left == right` failed
  left: 1
 right: 20

---- tests::plan_builders::random_spray_chains_with_other_builders stdout ----

thread 'tests::plan_builders::random_spray_chains_with_other_builders' (4131098) panicked at packages/mudlark/src/tests/plan_builders.rs:62:5:
assertion `left == right` failed
  left: 1
 right: 42

---- tests::plan_builders::random_spray_produces_expected_count stdout ----

thread 'tests::plan_builders::random_spray_produces_expected_count' (4131102) panicked at packages/mudlark/src/tests/plan_builders.rs:9:5:
assertion `left == right` failed
  left: 1
 right: 100

failures:
    tests::plan_builders::oscillating_hotspot_produces_expected_count
    tests::plan_builders::random_spray_chains_with_other_builders
    tests::plan_builders::random_spray_produces_expected_count

test result: FAILED. 343 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
