*** packages/mudlark/src/testing/plan.rs:75:9: replace Plan<C, V>::is_empty -> bool with true

*** mutation diff:
--- packages/mudlark/src/testing/plan.rs
+++ replace Plan<C, V>::is_empty -> bool with true
@@ -67,17 +67,17 @@
     #[must_use]
     pub fn len(&self) -> usize {
         self.observations.len()
     }
 
     /// Whether the plan has zero observations.
     #[must_use]
     pub fn is_empty(&self) -> bool {
-        self.observations.is_empty()
+        true /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl<C: Copy + Debug + Default, V: Copy + Debug> Default for Plan<C, V> {
     fn default() -> Self {
         Self::new()
     }
 }

*** result: Success
