*** packages/mudlark/src/testing/plan.rs:75:9: replace Plan<C, V>::is_empty -> bool with false

*** mutation diff:
--- packages/mudlark/src/testing/plan.rs
+++ replace Plan<C, V>::is_empty -> bool with false
@@ -67,17 +67,17 @@
     #[must_use]
     pub fn len(&self) -> usize {
         self.observations.len()
     }
 
     /// Whether the plan has zero observations.
     #[must_use]
     pub fn is_empty(&self) -> bool {
-        self.observations.is_empty()
+        false /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl<C: Copy + Debug + Default, V: Copy + Debug> Default for Plan<C, V> {
     fn default() -> Self {
         Self::new()
     }
 }

---- tests::plan_builders::oscillating_hotspot_zero_cycles_is_empty stdout ----

thread 'tests::plan_builders::oscillating_hotspot_zero_cycles_is_empty' (4138337) panicked at packages/mudlark/src/tests/plan_builders.rs:53:5:
assertion failed: plan.is_empty()

failures:
    tests::plan_builders::oscillating_hotspot_zero_cycles_is_empty

test result: FAILED. 345 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.10s

*** result: Failure(101)
