*** packages/mudlark/src/testing/plan.rs:93:46: replace % with + in Plan<C, V>::spread

*** mutation diff:
--- packages/mudlark/src/testing/plan.rs
+++ replace % with + in Plan<C, V>::spread
@@ -85,17 +85,17 @@
 // ── Convenience builders (need Coordinate + Accumulator) ────────
 
 impl<C: Coordinate, V: Accumulator + Inspectable> Plan<C, V> {
     /// Uniform spread: `n` observations cycling through coordinates
     /// `0, 1, 2, …` (mod `domain`), all with the same `delta`.
     #[must_use]
     pub fn spread(mut self, domain: u64, delta: V, n: usize) -> Self {
         for i in 0..n {
-            let coord = C::from_u64(i as u64 % domain);
+            let coord = C::from_u64(i as u64 + /* ~ changed by cargo-mutants ~ */ domain);
             self.observations.push((coord, delta));
         }
         self
     }
 
     /// Monotone sweep: coordinates `0, 1, 2, …` (mod `domain`), with
     /// varying intensity `(i % 7) + 1`.
     #[must_use]

---- depth_gates_shift_under_budget_pressure stdout ----

thread 'depth_gates_shift_under_budget_pressure' (4145828) panicked at packages/mudlark/tests/budget.rs:52:5:
D_evict should tighten under sustained budget pressure: current=12

failures:
    depth_gates_shift_under_budget_pressure

test result: FAILED. 23 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
