*** packages/mudlark/src/traits/accumulator.rs:262:14: replace - with / in <impl Accumulator for f32>::sub

*** mutation diff:
--- packages/mudlark/src/traits/accumulator.rs
+++ replace - with / in <impl Accumulator for f32>::sub
@@ -254,17 +254,17 @@
 
     #[inline]
     fn add(self, other: Self) -> Self {
         self + other
     }
 
     #[inline]
     fn sub(self, other: Self) -> Self {
-        self - other
+        self / /* ~ changed by cargo-mutants ~ */ other
     }
 }
 
 impl Accumulator for f64 {
     #[inline]
     fn zero() -> Self {
         0.0
     }

---- tests::traits::f32_sub stdout ----

thread 'tests::traits::f32_sub' (3742144) panicked at packages/mudlark/src/tests/traits.rs:98:5:
assertion failed: (f32::sub(10.0, 3.5) - 6.5).abs() < f32::EPSILON

failures:
    tests::traits::f32_sub

test result: FAILED. 345 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
