*** packages/mudlark/src/traits/accumulator.rs:274:14: replace + with - in <impl Accumulator for f64>::add

*** mutation diff:
--- packages/mudlark/src/traits/accumulator.rs
+++ replace + with - in <impl Accumulator for f64>::add
@@ -266,16 +266,16 @@
 impl Accumulator for f64 {
     #[inline]
     fn zero() -> Self {
         0.0
     }
 
     #[inline]
     fn add(self, other: Self) -> Self {
-        self + other
+        self - /* ~ changed by cargo-mutants ~ */ other
     }
 
     #[inline]
     fn sub(self, other: Self) -> Self {
         self - other
     }
 }

---- tests::decay::decay_f64_tree stdout ----

thread 'tests::decay::decay_f64_tree' (3750353) panicked at packages/mudlark/src/graph_plateau.rs:193:13:
POST-SPLIT: dynamic-contour-tracking mirror diverged from static rebuild
left (dynamic): {
    BasisEdge(
        0.0,
    ): Plateau {
        basis_edge: BasisEdge(
            0.0,
        ),
        start: 0.0,
        end: 16.0,
        depth: 0,

---- tests::decay_f64_depth::minimal_f64_depth_saturation stdout ----
2026-03-16T21:55:56.639492Z ERROR torrust_mudlark::graph_plateau: PLATEAU DIVERGENCE DETECTED label="POST-SPLIT" only_dynamic=[] only_static=[] differing=[BasisEdge(0.0)]
2026-03-16T21:55:56.639521Z ERROR torrust_mudlark::graph_plateau: DIFFERS key=BasisEdge(0.0) dyn_depth=0 dyn_start=0.0 dyn_end=16.0 dyn_sum=10.0 stat_depth=0 stat_start=0.0 stat_end=16.0 stat_sum=-10.0 basis=[0]
2026-03-16T21:55:56.639529Z ERROR torrust_mudlark::graph_plateau:   basis element gid=0 state=Terminal lo=0.0 hi=16.0 sum=-10.0 uniform_depth=Some(0)
2026-03-16T21:55:56.639542Z ERROR torrust_mudlark::graph_plateau: G-TREE DUMP dump=═══ G-Tree dump (root=GNodeId(0), 1 nodes) ═══
  G(  0) T [   0.0,   16.0)  d=0  par=None  L=_ R=_  sum=   -10.0 own=   -10.0  basis=BasisEdge(0.0)


thread 'tests::decay_f64_depth::minimal_f64_depth_saturation' (3

---- tests::decay_f64_depth::trace_f64_depth_inconsistency_step_by_step stdout ----
2026-03-16T21:55:56.639529Z ERROR torrust_mudlark::graph_plateau: PLATEAU DIVERGENCE DETECTED label="POST-SPLIT" only_dynamic=[] only_static=[] differing=[BasisEdge(0.0)]
2026-03-16T21:55:56.639535Z ERROR torrust_mudlark::graph_plateau: DIFFERS key=BasisEdge(0.0) dyn_depth=0 dyn_start=0.0 dyn_end=16.0 dyn_sum=10.0 stat_depth=0 stat_start=0.0 stat_end=16.0 stat_sum=-10.0 basis=[0]
2026-03-16T21:55:56.639539Z ERROR torrust_mudlark::graph_plateau:   basis element gid=0 state=Terminal lo=0.0 hi=16.0 sum=-10.0 uniform_depth=Some(0)
2026-03-16T21:55:56.639545Z ERROR torrust_mudlark::graph_plateau: G-TREE DUMP dump=═══ G-Tree dump (root=GNodeId(0), 1 nodes) ═══
  G(  0) T [   0.0,   16.0)  d=0  par=None  L=_ R=_  sum=   -10.0 own=   -10.0  basis=BasisEdge(0.0)


thread 'tests::decay_f64_depth::trace_f64_depth_in

failures:
    tests::decay::decay_f64_tree
    tests::decay_f64_depth::minimal_f64_depth_saturation
    tests::decay_f64_depth::trace_f64_depth_inconsistency_step_by_step
    tests::pewei::reconstruct_f64_coordinates
    tests::traits::f64_accumulator
    tests::traits::same_type_accumulate
    tests::traits::sub_mirrors_add

test result: FAILED. 339 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
