*** packages/mudlark/src/traits/accumulator.rs:274:14: replace + with * in <impl Accumulator for f64>::add

*** mutation diff:
--- packages/mudlark/src/traits/accumulator.rs
+++ replace + with * in <impl Accumulator for f64>::add
@@ -266,16 +266,16 @@
 impl Accumulator for f64 {
     #[inline]
     fn zero() -> Self {
         0.0
     }
 
     #[inline]
     fn add(self, other: Self) -> Self {
-        self + other
+        self * /* ~ changed by cargo-mutants ~ */ other
     }
 
     #[inline]
     fn sub(self, other: Self) -> Self {
         self - other
     }
 }

---- tests::pewei::reconstruct_f64_coordinates stdout ----

thread 'tests::pewei::reconstruct_f64_coordinates' (3752753) panicked at packages/mudlark/src/tests/pewei.rs:720:5:
assertion failed: (spans[0].intensity - 6.0).abs() < f64::EPSILON

---- tests::traits::same_type_accumulate stdout ----

thread 'tests::traits::same_type_accumulate' (3752922) panicked at packages/mudlark/src/tests/traits.rs:132:5:
assertion failed: (r - 4.0).abs() < f64::EPSILON

---- tests::traits::sub_mirrors_add stdout ----

thread 'tests::traits::sub_mirrors_add' (3752924) panicked at packages/mudlark/src/tests/traits.rs:105:5:
assertion failed: (f64::sub(f64::add(3.125, 2.0), 2.0) - 3.125).abs() < f64::EPSILON

failures:
    tests::pewei::reconstruct_f64_coordinates
    tests::traits::f64_accumulator
    tests::traits::same_type_accumulate
    tests::traits::sub_mirrors_add

test result: FAILED. 342 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
