*** packages/mudlark/src/traits/attenuatable.rs:142:14: replace * with + in <impl Attenuatable for f64>::attenuate

*** mutation diff:
--- packages/mudlark/src/traits/attenuatable.rs
+++ replace * with + in <impl Attenuatable for f64>::attenuate
@@ -134,11 +134,11 @@
     fn attenuate(self, factor: f64) -> Self {
         (f64::from(self) * factor) as Self
     }
 }
 
 impl Attenuatable for f64 {
     #[inline]
     fn attenuate(self, factor: f64) -> Self {
-        self * factor
+        self + /* ~ changed by cargo-mutants ~ */ factor
     }
 }

---- tests::decay::decay_f64_tree stdout ----

thread 'tests::decay::decay_f64_tree' (3769026) panicked at packages/mudlark/src/tests/decay.rs:401:5:
assertion failed: diff < 1.0

failures:
    tests::decay::decay_f64_tree

test result: FAILED. 345 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
