*** packages/mudlark/src/traits/coordinate.rs:257:16: replace - with / in <impl Coordinate for f32>::midpoint

*** mutation diff:
--- packages/mudlark/src/traits/coordinate.rs
+++ replace - with / in <impl Coordinate for f32>::midpoint
@@ -249,17 +249,17 @@
     #[inline]
     #[allow(clippy::cast_possible_wrap)]
     fn domain_max(n: u32) -> Self {
         2.0_f32.powi(n as i32)
     }
 
     #[inline]
     fn midpoint(a: Self, b: Self) -> Self {
-        a + (b - a) / 2.0
+        a + (b / /* ~ changed by cargo-mutants ~ */ a) / 2.0
     }
 
     #[inline]
     fn width(start: Self, end: Self) -> Self {
         end - start
     }
 
     #[inline]

---- f32_f32_observe_and_split stdout ----

thread 'f32_f32_observe_and_split' (3616779) panicked at packages/mudlark/src/gtree.rs:62:5:
gnode_depth_from_interval: zero-width interval

failures:
    f32_f32_observe_and_split

test result: FAILED. 13 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
