*** packages/mudlark/src/traits/coordinate.rs:278:9: replace <impl Coordinate for f32>::next_value -> Self with Default::default()

*** mutation diff:
--- packages/mudlark/src/traits/coordinate.rs
+++ replace <impl Coordinate for f32>::next_value -> Self with Default::default()
@@ -270,17 +270,17 @@
     #[inline]
     #[allow(clippy::cast_precision_loss)]
     fn from_u64(v: u64) -> Self {
         v as Self
     }
 
     #[inline]
     fn next_value(self) -> Self {
-        panic!("next_value is not supported for f32 coordinates; use Excluded/Included bounds directly")
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     #[inline]
     fn to_f64(self) -> f64 {
         f64::from(self)
     }
 
     #[inline]

*** result: Success
