*** packages/mudlark/src/traits/coordinate.rs:283:9: replace <impl Coordinate for f32>::to_f64 -> f64 with 0.0

*** mutation diff:
--- packages/mudlark/src/traits/coordinate.rs
+++ replace <impl Coordinate for f32>::to_f64 -> f64 with 0.0
@@ -275,17 +275,17 @@
 
     #[inline]
     fn next_value(self) -> Self {
         panic!("next_value is not supported for f32 coordinates; use Excluded/Included bounds directly")
     }
 
     #[inline]
     fn to_f64(self) -> f64 {
-        f64::from(self)
+        0.0 /* ~ changed by cargo-mutants ~ */
     }
 
     #[inline]
     fn is_nan(self) -> bool {
         self.is_nan()
     }
 
     #[inline]

---- f32_f32_observe_and_split stdout ----

thread 'f32_f32_observe_and_split' (3644310) panicked at packages/mudlark/src/gtree.rs:62:5:
gnode_depth_from_interval: zero-width interval

failures:
    f32_f32_observe_and_split

test result: FAILED. 13 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
