*** packages/mudlark/src/traits/coordinate.rs:313:11: replace + with - in <impl Coordinate for f64>::midpoint

*** mutation diff:
--- packages/mudlark/src/traits/coordinate.rs
+++ replace + with - in <impl Coordinate for f64>::midpoint
@@ -305,17 +305,17 @@
     #[inline]
     #[allow(clippy::cast_possible_wrap)]
     fn domain_max(n: u32) -> Self {
         2.0_f64.powi(n as i32)
     }
 
     #[inline]
     fn midpoint(a: Self, b: Self) -> Self {
-        a + (b - a) / 2.0
+        a - /* ~ changed by cargo-mutants ~ */ (b - a) / 2.0
     }
 
     #[inline]
     fn width(start: Self, end: Self) -> Self {
         end - start
     }
 
     #[inline]

---- f64_f64_observe_and_split stdout ----

thread 'f64_f64_observe_and_split' (3676656) panicked at packages/mudlark/tests/cross_type.rs:91:5:
assertion `left == right` failed
  left: 1
 right: 3

---- f64_coord_f64_observation stdout ----

thread 'f64_coord_f64_observation' (3676652) panicked at packages/mudlark/tests/cross_type.rs:286:5:
assertion `left == right` failed
  left: 1
 right: 3

failures:
    f64_coord_f64_observation
    f64_f64_observe_and_split

test result: FAILED. 12 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
