*** packages/mudlark/src/traits/coordinate.rs:313:16: replace - with + in <impl Coordinate for f64>::midpoint

*** mutation diff:
--- packages/mudlark/src/traits/coordinate.rs
+++ replace - with + in <impl Coordinate for f64>::midpoint
@@ -305,17 +305,17 @@
     #[inline]
     #[allow(clippy::cast_possible_wrap)]
     fn domain_max(n: u32) -> Self {
         2.0_f64.powi(n as i32)
     }
 
     #[inline]
     fn midpoint(a: Self, b: Self) -> Self {
-        a + (b - a) / 2.0
+        a + (b + /* ~ changed by cargo-mutants ~ */ a) / 2.0
     }
 
     #[inline]
     fn width(start: Self, end: Self) -> Self {
         end - start
     }
 
     #[inline]

---- tests::decay::decay_f64_tree stdout ----

thread 'tests::decay::decay_f64_tree' (3687793) panicked at packages/mudlark/src/gtree.rs:62:5:
gnode_depth_from_interval: zero-width interval

---- tests::decay_f64_depth::trace_f64_depth_inconsistency_step_by_step stdout ----

thread 'tests::decay_f64_depth::trace_f64_depth_inconsistency_step_by_step' (3687849) panicked at packages/mudlark/src/gtree.rs:62:5:
gnode_depth_from_interval: zero-width interval

---- tests::decay_f64_depth::minimal_f64_depth_saturation stdout ----

thread 'tests::decay_f64_depth::minimal_f64_depth_saturation' (3687848) panicked at packages/mudlark/src/gtree.rs:62:5:
gnode_depth_from_interval: zero-width interval

failures:
    tests::decay::decay_f64_tree
    tests::decay_f64_depth::minimal_f64_depth_saturation
    tests::decay_f64_depth::trace_f64_depth_inconsistency_step_by_step

test result: FAILED. 343 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
