*** packages/mudlark/src/traits/coordinate.rs:313:21: replace / with % in <impl Coordinate for f64>::midpoint

*** mutation diff:
--- packages/mudlark/src/traits/coordinate.rs
+++ replace / with % in <impl Coordinate for f64>::midpoint
@@ -305,17 +305,17 @@
     #[inline]
     #[allow(clippy::cast_possible_wrap)]
     fn domain_max(n: u32) -> Self {
         2.0_f64.powi(n as i32)
     }
 
     #[inline]
     fn midpoint(a: Self, b: Self) -> Self {
-        a + (b - a) / 2.0
+        a + (b - a) % /* ~ changed by cargo-mutants ~ */ 2.0
     }
 
     #[inline]
     fn width(start: Self, end: Self) -> Self {
         end - start
     }
 
     #[inline]

---- tests::pewei::reconstruct_f64_coordinates stdout ----

thread 'tests::pewei::reconstruct_f64_coordinates' (3681617) panicked at packages/mudlark/src/tests/pewei.rs:721:5:
assertion failed: (spans[1].intensity - 4.0).abs() < f64::EPSILON

failures:
    tests::pewei::reconstruct_f64_coordinates

test result: FAILED. 345 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
