*** packages/mudlark/src/traits/coordinate.rs:318:13: replace - with + in <impl Coordinate for f64>::width

*** mutation diff:
--- packages/mudlark/src/traits/coordinate.rs
+++ replace - with + in <impl Coordinate for f64>::width
@@ -310,17 +310,17 @@
 
     #[inline]
     fn midpoint(a: Self, b: Self) -> Self {
         a + (b - a) / 2.0
     }
 
     #[inline]
     fn width(start: Self, end: Self) -> Self {
-        end - start
+        end + /* ~ changed by cargo-mutants ~ */ start
     }
 
     #[inline]
     fn is_final(_start: Self, _end: Self, depth: u32, n: u32) -> bool {
         depth >= n
     }
 
     #[inline]

---- tests::gtree::depth_f64_half_n4 stdout ----

thread 'tests::gtree::depth_f64_half_n4' (3693140) panicked at packages/mudlark/src/tests/gtree.rs:195:5:
assertion `left == right` failed
  left: 0
 right: 1

---- tests::gtree::depth_f64_sub_unit_n4 stdout ----

thread 'tests::gtree::depth_f64_sub_unit_n4' (3693144) panicked at packages/mudlark/src/tests/gtree.rs:206:5:
assertion `left == right` failed
  left: 2
 right: 5

failures:
    tests::gtree::depth_f64_half_n4
    tests::gtree::depth_f64_sub_unit_n4

test result: FAILED. 344 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
