*** packages/mudlark/src/traits/coordinate.rs:318:13: replace - with / in <impl Coordinate for f64>::width

*** mutation diff:
--- packages/mudlark/src/traits/coordinate.rs
+++ replace - with / in <impl Coordinate for f64>::width
@@ -310,17 +310,17 @@
 
     #[inline]
     fn midpoint(a: Self, b: Self) -> Self {
         a + (b - a) / 2.0
     }
 
     #[inline]
     fn width(start: Self, end: Self) -> Self {
-        end - start
+        end / /* ~ changed by cargo-mutants ~ */ start
     }
 
     #[inline]
     fn is_final(_start: Self, _end: Self, depth: u32, n: u32) -> bool {
         depth >= n
     }
 
     #[inline]

---- tests::gtree::depth_f64_quarter_n4 stdout ----

thread 'tests::gtree::depth_f64_quarter_n4' (3698335) panicked at packages/mudlark/src/tests/gtree.rs:200:5:
assertion `left == right` failed
  left: 2147483653
 right: 2

---- tests::gtree::depth_f64_root_n4 stdout ----

thread 'tests::gtree::depth_f64_root_n4' (3698336) panicked at packages/mudlark/src/tests/gtree.rs:189:5:
assertion `left == right` failed
  left: 2147483653
 right: 0

---- tests::gtree::depth_f64_half_n4 stdout ----

thread 'tests::gtree::depth_f64_half_n4' (3698334) panicked at packages/mudlark/src/tests/gtree.rs:194:5:
assertion `left == right` failed
  left: 2147483653
 right: 1

failures:
    tests::gtree::depth_f64_half_n4
    tests::gtree::depth_f64_quarter_n4
    tests::gtree::depth_f64_root_n4
    tests::gtree::depth_f64_sub_unit_n4
    tests::plateau::plateau_width_f64
    tests::view::node_f64_types
    tests::view::span_width_f64

test result: FAILED. 339 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
