*** packages/mudlark/src/traits/coordinate.rs:323:15: replace >= with < in <impl Coordinate for f64>::is_final

*** mutation diff:
--- packages/mudlark/src/traits/coordinate.rs
+++ replace >= with < in <impl Coordinate for f64>::is_final
@@ -315,17 +315,17 @@
 
     #[inline]
     fn width(start: Self, end: Self) -> Self {
         end - start
     }
 
     #[inline]
     fn is_final(_start: Self, _end: Self, depth: u32, n: u32) -> bool {
-        depth >= n
+        depth < /* ~ changed by cargo-mutants ~ */ n
     }
 
     #[inline]
     #[allow(clippy::cast_precision_loss)]
     fn from_u64(v: u64) -> Self {
         v as Self
     }

---- tests::view::cell_is_final_f64 stdout ----

thread 'tests::view::cell_is_final_f64' (3697595) panicked at packages/mudlark/src/tests/view.rs:104:5:
assertion failed: cell.is_final(8)

---- tests::traits::f64_is_final stdout ----

thread 'tests::traits::f64_is_final' (3697577) panicked at packages/mudlark/src/tests/traits.rs:41:5:
assertion failed: f64::is_final(0.0, 1.0, 52, 52)

failures:
    tests::traits::f64_is_final
    tests::view::cell_is_final_f64

test result: FAILED. 344 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
