*** packages/mudlark/src/traits/coordinate.rs:339:9: replace <impl Coordinate for f64>::to_f64 -> f64 with 0.0

*** mutation diff:
--- packages/mudlark/src/traits/coordinate.rs
+++ replace <impl Coordinate for f64>::to_f64 -> f64 with 0.0
@@ -331,17 +331,17 @@
 
     #[inline]
     fn next_value(self) -> Self {
         panic!("next_value is not supported for f64 coordinates; use Excluded/Included bounds directly")
     }
 
     #[inline]
     fn to_f64(self) -> f64 {
-        self
+        0.0 /* ~ changed by cargo-mutants ~ */
     }
 
     #[inline]
     fn is_nan(self) -> bool {
         self.is_nan()
     }
 
     #[inline]

---- tests::decay::decay_f64_tree stdout ----

thread 'tests::decay::decay_f64_tree' (3709691) panicked at packages/mudlark/src/gtree.rs:62:5:
gnode_depth_from_interval: zero-width interval

---- tests::decay_f64_depth::f64_depth_saturates_at_n stdout ----

thread 'tests::decay_f64_depth::f64_depth_saturates_at_n' (3709717) panicked at packages/mudlark/src/gtree.rs:62:5:
gnode_depth_from_interval: zero-width interval

---- tests::decay_f64_depth::minimal_f64_depth_saturation stdout ----

thread 'tests::decay_f64_depth::minimal_f64_depth_saturation' (3709718) panicked at packages/mudlark/src/gtree.rs:62:5:
gnode_depth_from_interval: zero-width interval

failures:
    tests::decay::decay_f64_tree
    tests::decay_f64_depth::f64_depth_saturates_at_n
    tests::decay_f64_depth::minimal_f64_depth_saturation
    tests::decay_f64_depth::trace_f64_depth_inconsistency_step_by_step
    tests::gtree::depth_f64_half_n4
    tests::gtree::depth_f64_quarter_n4
    tests::gtree::depth_f64_root_n4
    tests::gtree::depth_f64_sub_unit_n4

test result: FAILED. 338 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
