*** packages/mudlark/src/traits/coordinate.rs:339:9: replace <impl Coordinate for f64>::to_f64 -> f64 with 1.0

*** mutation diff:
--- packages/mudlark/src/traits/coordinate.rs
+++ replace <impl Coordinate for f64>::to_f64 -> f64 with 1.0
@@ -331,17 +331,17 @@
 
     #[inline]
     fn next_value(self) -> Self {
         panic!("next_value is not supported for f64 coordinates; use Excluded/Included bounds directly")
     }
 
     #[inline]
     fn to_f64(self) -> f64 {
-        self
+        1.0 /* ~ changed by cargo-mutants ~ */
     }
 
     #[inline]
     fn is_nan(self) -> bool {
         self.is_nan()
     }
 
     #[inline]

---- tests::gtree::depth_f64_half_n4 stdout ----

thread 'tests::gtree::depth_f64_half_n4' (3715178) panicked at packages/mudlark/src/tests/gtree.rs:194:5:
assertion `left == right` failed
  left: 4
 right: 1

---- tests::gtree::depth_f64_quarter_n4 stdout ----

thread 'tests::gtree::depth_f64_quarter_n4' (3715179) panicked at packages/mudlark/src/tests/gtree.rs:200:5:
assertion `left == right` failed
  left: 4
 right: 2

---- tests::gtree::depth_f64_root_n4 stdout ----

thread 'tests::gtree::depth_f64_root_n4' (3715180) panicked at packages/mudlark/src/tests/gtree.rs:189:5:
assertion `left == right` failed
  left: 4
 right: 0

failures:
    tests::gtree::depth_f64_half_n4
    tests::gtree::depth_f64_quarter_n4
    tests::gtree::depth_f64_root_n4
    tests::gtree::depth_f64_sub_unit_n4

test result: FAILED. 342 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
