*** packages/mudlark/src/traits/coordinate.rs:344:9: replace <impl Coordinate for f64>::is_nan -> bool with true

*** mutation diff:
--- packages/mudlark/src/traits/coordinate.rs
+++ replace <impl Coordinate for f64>::is_nan -> bool with true
@@ -336,16 +336,16 @@
 
     #[inline]
     fn to_f64(self) -> f64 {
         self
     }
 
     #[inline]
     fn is_nan(self) -> bool {
-        self.is_nan()
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     #[inline]
     fn total_cmp(&self, other: &Self) -> std::cmp::Ordering {
         Self::total_cmp(self, other)
     }
 }

---- get_out_of_domain_low_clamps_f64 stdout ----

thread 'get_out_of_domain_low_clamps_f64' (3716315) panicked at packages/mudlark/src/graph_query.rs:165:9:
get(): coordinate is NaN

---- get_f64_coordinates stdout ----

thread 'get_f64_coordinates' (3716312) panicked at packages/mudlark/src/graph_query.rs:165:9:
get(): coordinate is NaN

failures:
    get_f64_coordinates
    get_out_of_domain_low_clamps_f64

test result: FAILED. 11 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
