*** packages/mudlark/src/traits/coordinate.rs:344:9: replace <impl Coordinate for f64>::is_nan -> bool with false

*** mutation diff:
--- packages/mudlark/src/traits/coordinate.rs
+++ replace <impl Coordinate for f64>::is_nan -> bool with false
@@ -336,16 +336,16 @@
 
     #[inline]
     fn to_f64(self) -> f64 {
         self
     }
 
     #[inline]
     fn is_nan(self) -> bool {
-        self.is_nan()
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     #[inline]
     fn total_cmp(&self, other: &Self) -> std::cmp::Ordering {
         Self::total_cmp(self, other)
     }
 }

---- get_nan_panics stdout ----

thread 'get_nan_panics' (3724660) panicked at packages/mudlark/src/graph_query.rs:180:13:
get(): returned cell [0.0, 16.0) does not contain clamped coord NaN
note: panic did not contain expected string
      panic message: "get(): returned cell [0.0, 16.0) does not contain clamped coord NaN"
 expected substring: "get(): coordinate is NaN"

failures:
    get_nan_panics

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
