*** packages/mudlark/src/traits/inspectable.rs:142:9: replace <impl Inspectable for f32>::to_f64_approx -> f64 with 1.0

*** mutation diff:
--- packages/mudlark/src/traits/inspectable.rs
+++ replace <impl Inspectable for f32>::to_f64_approx -> f64 with 1.0
@@ -134,17 +134,17 @@
 
 impl_inspectable_uint!(u8, u16, u32, u64, u128);
 
 // ── Floating-point implementations ──────────────────────────────────
 
 impl Inspectable for f32 {
     #[inline]
     fn to_f64_approx(self) -> f64 {
-        f64::from(self)
+        1.0 /* ~ changed by cargo-mutants ~ */
     }
 
     #[inline]
     #[allow(clippy::cast_possible_truncation)]
     fn from_f64(v: f64) -> Self {
         v as Self
     }
 }

---- f32_f32_observe_and_split stdout ----

thread 'f32_f32_observe_and_split' (3878644) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (4 total):
G-I1 violated at G-node 0: expected sum=3, actual sum=1 (own=1, left_sum=1, right_sum=1)
V-I1 violated at V-node 3: intensity=1, sum of children=2
V-I1 violated at V-node 4: intensity=1, sum of children=2
Clean accounting violated: V-entry sum=3, G-root sum=1

failures:
    f32_f32_observe_and_split

test result: FAILED. 13 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
