*** packages/mudlark/src/traits/inspectable.rs:155:9: replace <impl Inspectable for f64>::to_f64_approx -> f64 with 0.0

*** mutation diff:
--- packages/mudlark/src/traits/inspectable.rs
+++ replace <impl Inspectable for f64>::to_f64_approx -> f64 with 0.0
@@ -147,16 +147,16 @@
     fn from_f64(v: f64) -> Self {
         v as Self
     }
 }
 
 impl Inspectable for f64 {
     #[inline]
     fn to_f64_approx(self) -> f64 {
-        self
+        0.0 /* ~ changed by cargo-mutants ~ */
     }
 
     #[inline]
     fn from_f64(v: f64) -> Self {
         v
     }
 }

error: doctest failed, to rerun pass `-p torrust-mudlark --doc`

---- packages/mudlark/src/traits/inspectable.rs - traits::inspectable::Inspectable (line 52) stdout ----
Test executable failed (exit status: 101).

stderr:

thread 'main' (3889165) panicked at packages/mudlark/src/traits/inspectable.rs:17:1:
assertion `left == right` failed
  left: 0.0
 right: 3.14

failures:
    packages/mudlark/src/traits/inspectable.rs - traits::inspectable::Inspectable (line 52)

test result: FAILED. 105 passed; 1 failed; 1 ignored; 0 measured; 0 filtered out; finished in 5.93s

*** result: Failure(101)
