*** packages/mudlark/src/traits/inspectable.rs:155:9: replace <impl Inspectable for f64>::to_f64_approx -> f64 with -1.0

*** mutation diff:
--- packages/mudlark/src/traits/inspectable.rs
+++ replace <impl Inspectable for f64>::to_f64_approx -> f64 with -1.0
@@ -147,16 +147,16 @@
     fn from_f64(v: f64) -> Self {
         v as Self
     }
 }
 
 impl Inspectable for f64 {
     #[inline]
     fn to_f64_approx(self) -> f64 {
-        self
+        -1.0 /* ~ changed by cargo-mutants ~ */
     }
 
     #[inline]
     fn from_f64(v: f64) -> Self {
         v
     }
 }

---- tests::decay_f64_depth::minimal_f64_depth_saturation stdout ----

thread 'tests::decay_f64_depth::minimal_f64_depth_saturation' (3897955) panicked at packages/mudlark/src/tests/decay_f64_depth.rs:257:17:
Depth saturation bug reproduced at observation 1.

---- tests::decay_f64_depth::trace_f64_depth_inconsistency_step_by_step stdout ----

thread 'tests::decay_f64_depth::trace_f64_depth_inconsistency_step_by_step' (3897956) panicked at packages/mudlark/src/tests/decay_f64_depth.rs:178:13:
Invariant violation at step 1. See stderr for full diagnosis.

---- tests::decay::decay_f64_tree stdout ----

thread 'tests::decay::decay_f64_tree' (3897928) panicked at packages/mudlark/src/graph_plateau.rs:956:17:
normalize_plateaus step 2: sweep sum -1 != element sum -2 for plateau BasisEdge(4.0)

failures:
    tests::decay::decay_f64_tree
    tests::decay_f64_depth::minimal_f64_depth_saturation
    tests::decay_f64_depth::trace_f64_depth_inconsistency_step_by_step

test result: FAILED. 343 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
