*** packages/mudlark/src/traits/observation.rs:120:9: replace Observation::scale -> V with Default::default()

*** mutation diff:
--- packages/mudlark/src/traits/observation.rs
+++ replace Observation::scale -> V with Default::default()
@@ -112,20 +112,17 @@
     /// Multiplicative scaling: `current × factor`, in `Self`'s
     /// precision, stored as `V`.
     ///
     /// Default panics.  Cross-type impls (`f64` → uint, `f32` → uint)
     /// provide working implementations.  Same-type `scale` is not
     /// used by the core engine — `decay()` uses
     /// `Attenuatable::attenuate` directly.
     fn scale(_current: V, _factor: Self) -> V {
-        unimplemented!(
-            "Observation::scale: use a cross-type Observation impl \
-             (e.g. f64 → uint) or call Attenuatable::attenuate directly"
-        )
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 // ── Same-type blanket impl ──────────────────────────────────────────
 
 /// Every `V: Accumulator` is `Observation<V>` (same-type).
 ///
 /// Provides `accumulate` via [`Accumulator::add`].  `scale` uses

---- tests::traits::same_type_scale_panics stdout ----
note: test did not panic as expected at packages/mudlark/src/tests/traits.rs:137:4

failures:
    tests::traits::same_type_scale_panics

test result: FAILED. 345 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.11s

*** result: Failure(101)
