*** packages/mudlark/src/traits/observation.rs:169:30: replace + with - in <impl Observation<f32> for f64>::accumulate

*** mutation diff:
--- packages/mudlark/src/traits/observation.rs
+++ replace + with - in <impl Observation<f32> for f64>::accumulate
@@ -161,17 +161,17 @@
 
 impl_observation_f64_to_uint!(u8, u16, u32, u64, u128);
 
 /// `f64` as observation on `f32` (narrowing).
 impl Observation<f32> for f64 {
     #[inline]
     #[allow(clippy::cast_possible_truncation)]
     fn accumulate(current: f32, delta: Self) -> f32 {
-        (Self::from(current) + delta) as f32
+        (Self::from(current) - /* ~ changed by cargo-mutants ~ */ delta) as f32
     }
 
     #[inline]
     #[allow(clippy::cast_possible_truncation)]
     fn scale(current: f32, factor: Self) -> f32 {
         (Self::from(current) * factor) as f32
     }
 }

---- tests::traits::cross_type_f64_to_f32 stdout ----

thread 'tests::traits::cross_type_f64_to_f32' (3903010) panicked at packages/mudlark/src/tests/traits.rs:166:5:
assertion failed: (result - 1.5_f32).abs() < f32::EPSILON

failures:
    tests::traits::cross_type_f64_to_f32

test result: FAILED. 345 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
