*** packages/mudlark/src/traits/observation.rs:175:30: replace * with / in <impl Observation<f32> for f64>::scale

*** mutation diff:
--- packages/mudlark/src/traits/observation.rs
+++ replace * with / in <impl Observation<f32> for f64>::scale
@@ -167,17 +167,17 @@
     #[allow(clippy::cast_possible_truncation)]
     fn accumulate(current: f32, delta: Self) -> f32 {
         (Self::from(current) + delta) as f32
     }
 
     #[inline]
     #[allow(clippy::cast_possible_truncation)]
     fn scale(current: f32, factor: Self) -> f32 {
-        (Self::from(current) * factor) as f32
+        (Self::from(current) / /* ~ changed by cargo-mutants ~ */ factor) as f32
     }
 }
 
 // Note: f64 → f64 is handled by the blanket impl (same-type).
 
 // ── Cross-type: f32 → unsigned integers ─────────────────────────────
 
 macro_rules! impl_observation_f32_to_uint {

---- tests::traits::cross_type_f64_to_f32 stdout ----

thread 'tests::traits::cross_type_f64_to_f32' (3919575) panicked at packages/mudlark/src/tests/traits.rs:168:5:
assertion failed: (scaled - 2.5_f32).abs() < f32::EPSILON

failures:
    tests::traits::cross_type_f64_to_f32

test result: FAILED. 345 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
