*** packages/mudlark/src/traits/proratable.rs:133:33: replace / with % in <impl Proratable for f32>::prorate

*** mutation diff:
--- packages/mudlark/src/traits/proratable.rs
+++ replace / with % in <impl Proratable for f32>::prorate
@@ -125,17 +125,17 @@
 
 impl Proratable for f32 {
     #[inline]
     #[allow(clippy::cast_precision_loss)]
     fn prorate(self, portion: u64, total: u64) -> Self {
         if total == 0 {
             return <Self as Accumulator>::zero();
         }
-        self * (portion as Self / total as Self)
+        self * (portion as Self % /* ~ changed by cargo-mutants ~ */ total as Self)
     }
 
     #[inline]
     #[allow(clippy::cast_possible_truncation)]
     fn scale_by(self, ratio: f64) -> Self {
         (f64::from(self) * ratio) as Self
     }
 }

*** result: Success
