*** packages/mudlark/src/traits/proratable.rs:150:14: replace * with + in <impl Proratable for f64>::prorate

*** mutation diff:
--- packages/mudlark/src/traits/proratable.rs
+++ replace * with + in <impl Proratable for f64>::prorate
@@ -142,16 +142,16 @@
 
 impl Proratable for f64 {
     #[inline]
     #[allow(clippy::cast_precision_loss)]
     fn prorate(self, portion: u64, total: u64) -> Self {
         if total == 0 {
             return <Self as Accumulator>::zero();
         }
-        self * (portion as Self / total as Self)
+        self + /* ~ changed by cargo-mutants ~ */ (portion as Self / total as Self)
     }
 
     #[inline]
     fn scale_by(self, ratio: f64) -> Self {
         self * ratio
     }
 }

---- tests::pewei::reconstruct_f64_coordinates stdout ----

thread 'tests::pewei::reconstruct_f64_coordinates' (3859052) panicked at packages/mudlark/src/tests/pewei.rs:720:5:
assertion failed: (spans[0].intensity - 6.0).abs() < f64::EPSILON

---- tests::traits::f64_accumulator stdout ----

thread 'tests::traits::f64_accumulator' (3859175) panicked at packages/mudlark/src/tests/traits.rs:68:5:
assertion failed: (p - 75.0).abs() < 1e-10

failures:
    tests::pewei::reconstruct_f64_coordinates
    tests::traits::f64_accumulator

test result: FAILED. 344 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
