*** packages/mudlark/src/traits/proratable.rs:155:14: replace * with / in <impl Proratable for f64>::scale_by

*** mutation diff:
--- packages/mudlark/src/traits/proratable.rs
+++ replace * with / in <impl Proratable for f64>::scale_by
@@ -147,11 +147,11 @@
         if total == 0 {
             return <Self as Accumulator>::zero();
         }
         self * (portion as Self / total as Self)
     }
 
     #[inline]
     fn scale_by(self, ratio: f64) -> Self {
-        self * ratio
+        self / /* ~ changed by cargo-mutants ~ */ ratio
     }
 }

---- range_sum_f64_prorate stdout ----

thread 'range_sum_f64_prorate' (3871935) panicked at packages/mudlark/tests/graph_range.rs:191:5:
assertion failed: (g.range_sum(0.0..8.0) - 8.0).abs() < f64::EPSILON

failures:
    range_sum_f64_prorate

test result: FAILED. 11 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
