*** packages/mudlark/src/traits/rng.rs:105:9: replace <impl Rng for T>::next_f64 -> f64 with 0.0

*** mutation diff:
--- packages/mudlark/src/traits/rng.rs
+++ replace <impl Rng for T>::next_f64 -> f64 with 0.0
@@ -97,11 +97,11 @@
 }
 
 #[cfg(feature = "rand")]
 impl<T: rand_core::Rng> Rng for T {
     #[inline]
     #[allow(clippy::cast_precision_loss)] // intentional: top 53 bits of u64 → f64
     fn next_f64(&mut self) -> f64 {
         // Standard conversion: top 53 bits of u64 → f64 in [0, 1).
-        (self.next_u64() >> 11) as f64 * (1.0 / (1u64 << 53) as f64)
+        0.0 /* ~ changed by cargo-mutants ~ */
     }
 }

*** result: Success
