*** packages/mudlark/src/traits/weighable.rs:121:9: replace <impl Weighable for f32>::weight -> f64 with 0.0

*** mutation diff:
--- packages/mudlark/src/traits/weighable.rs
+++ replace <impl Weighable for f32>::weight -> f64 with 0.0
@@ -113,17 +113,17 @@
 
 impl_weighable_uint!(u8, u16, u32, u64, u128);
 
 // ── Floating-point implementations ──────────────────────────────────
 
 impl Weighable for f32 {
     #[inline]
     fn weight(self) -> f64 {
-        f64::from(self)
+        0.0 /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl Weighable for f64 {
     #[inline]
     fn weight(self) -> f64 {
         self
     }

*** result: Success
