*** packages/mudlark/src/traits/weighable.rs:128:9: replace <impl Weighable for f64>::weight -> f64 with -1.0

*** mutation diff:
--- packages/mudlark/src/traits/weighable.rs
+++ replace <impl Weighable for f64>::weight -> f64 with -1.0
@@ -120,11 +120,11 @@
     fn weight(self) -> f64 {
         f64::from(self)
     }
 }
 
 impl Weighable for f64 {
     #[inline]
     fn weight(self) -> f64 {
-        self
+        -1.0 /* ~ changed by cargo-mutants ~ */
     }
 }

---- tests::pewei::snr_float_types stdout ----

thread 'tests::pewei::snr_float_types' (3796548) panicked at packages/mudlark/src/tests/pewei.rs:50:5:
assertion failed: (snr - 1.5).abs() < f64::EPSILON

failures:
    tests::pewei::snr_float_types

test result: FAILED. 345 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
