*** packages/mudlark/src/view.rs:357:23: replace == with != in Node<C, V>::to_cell

*** mutation diff:
--- packages/mudlark/src/view.rs
+++ replace == with != in Node<C, V>::to_cell
@@ -349,17 +349,17 @@
     ///     assert_eq!(cell.intensity, node.own);
     /// } else {
     ///     assert!(node.to_cell().is_none());
     /// }
     /// ```
     #[inline]
     #[must_use]
     pub fn to_cell(self) -> Option<Cell<C, V>> {
-        if self.state == GState::Terminal {
+        if self.state != /* ~ changed by cargo-mutants ~ */ GState::Terminal {
             Some(Cell {
                 start: self.start,
                 end: self.end,
                 intensity: self.own,
                 depth: self.depth,
             })
         } else {
             None

---- tests::view::node_internal_to_cell_none stdout ----

thread 'tests::view::node_internal_to_cell_none' (830581) panicked at packages/mudlark/src/tests/view.rs:152:5:
assertion failed: node.to_cell().is_none()

---- tests::view::node_semi_internal_to_cell_none stdout ----

thread 'tests::view::node_semi_internal_to_cell_none' (830586) panicked at packages/mudlark/src/tests/view.rs:166:5:
assertion failed: node.to_cell().is_none()

---- tests::view::node_terminal_to_cell stdout ----

thread 'tests::view::node_terminal_to_cell' (830587) panicked at packages/mudlark/src/tests/view.rs:134:31:
terminal → Some(Cell)

failures:
    tests::view::node_f64_types
    tests::view::node_internal_to_cell_none
    tests::view::node_semi_internal_to_cell_none
    tests::view::node_terminal_to_cell

test result: FAILED. 342 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
