*** packages/mudlark/src/view.rs:357:9: replace Node<C, V>::to_cell -> Option<Cell<C, V>> with None

*** mutation diff:
--- packages/mudlark/src/view.rs
+++ replace Node<C, V>::to_cell -> Option<Cell<C, V>> with None
@@ -349,26 +349,17 @@
     ///     assert_eq!(cell.intensity, node.own);
     /// } else {
     ///     assert!(node.to_cell().is_none());
     /// }
     /// ```
     #[inline]
     #[must_use]
     pub fn to_cell(self) -> Option<Cell<C, V>> {
-        if self.state == GState::Terminal {
-            Some(Cell {
-                start: self.start,
-                end: self.end,
-                intensity: self.own,
-                depth: self.depth,
-            })
-        } else {
-            None
-        }
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// Whether this node is a terminal (leaf) in the G-Tree.
     ///
     /// # Examples
     ///
     /// ```
     /// # use torrust_mudlark::{Config, GvGraph, GState};

---- tests::view::node_terminal_to_cell stdout ----

thread 'tests::view::node_terminal_to_cell' (840592) panicked at packages/mudlark/src/tests/view.rs:134:31:
terminal → Some(Cell)

failures:
    tests::view::node_terminal_to_cell

test result: FAILED. 345 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
