*** packages/mudlark/src/view.rs:391:9: replace Node<C, V>::is_terminal -> bool with true

*** mutation diff:
--- packages/mudlark/src/view.rs
+++ replace Node<C, V>::is_terminal -> bool with true
@@ -383,17 +383,17 @@
     /// # let mut g = GvGraph::<u64, u64, 8>::new(cfg);
     /// # g.observe(42, 10u64);
     /// let (_layer, node) = g.layers().next().unwrap();
     /// assert_eq!(node.is_terminal(), node.state == GState::Terminal);
     /// ```
     #[inline]
     #[must_use]
     pub fn is_terminal(&self) -> bool {
-        self.state == GState::Terminal
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     /// Refinement energy: `sum - own`
     ///
     /// Quantifies how much energy in this node's region comes from
     /// child nodes rather than direct accumulation. For terminal
     /// nodes (no children) this is always zero; for internal or
     /// semi-internal nodes it reveals how much spatial detail exists

---- tests::view::node_is_terminal stdout ----

thread 'tests::view::node_is_terminal' (850328) panicked at packages/mudlark/src/tests/view.rs:191:5:
assertion failed: !internal.is_terminal()

failures:
    tests::view::node_is_terminal

test result: FAILED. 345 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
