*** packages/mudlark/src/view.rs:428:9: replace Node<C, V>::refinement -> V with Default::default()

*** mutation diff:
--- packages/mudlark/src/view.rs
+++ replace Node<C, V>::refinement -> V with Default::default()
@@ -420,17 +420,17 @@
     ///     }
     ///     // For any node: refinement + own == sum.
     ///     assert_eq!(node.refinement() + node.own, node.sum);
     /// }
     /// ```
     #[inline]
     #[must_use]
     pub fn refinement(&self) -> V {
-        V::sub(self.sum, self.own)
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Width of this node's interval: `end - start`.
     ///
     /// # Examples
     ///
     /// ```
     /// # use torrust_mudlark::{Config, GvGraph};

---- tests::view::node_refinement_internal stdout ----

thread 'tests::view::node_refinement_internal' (845103) panicked at packages/mudlark/src/tests/view.rs:268:5:
assertion `left == right` failed
  left: 0
 right: 20

---- tests::view::node_refinement_f64 stdout ----

thread 'tests::view::node_refinement_f64' (845102) panicked at packages/mudlark/src/tests/view.rs:296:5:
assertion failed: (node.refinement() - 3.0).abs() < f64::EPSILON

failures:
    tests::view::node_refinement_f64
    tests::view::node_refinement_internal

test result: FAILED. 344 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
