*** packages/mudlark/src/vnode.rs:135:9: replace PackedChildren<V>::len -> usize with 1

*** mutation diff:
--- packages/mudlark/src/vnode.rs
+++ replace PackedChildren<V>::len -> usize with 1
@@ -127,17 +127,17 @@
             len: 3,
         }
     }
 
     /// Number of children (2 or 3).
     #[must_use]
     #[inline]
     pub const fn len(&self) -> usize {
-        self.len as usize
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns `true` if there are no children. (Always false for a valid node.)
     #[must_use]
     #[inline]
     #[allow(dead_code)]
     pub const fn is_empty(&self) -> bool {
         self.len == 0

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (2763646) panicked at packages/mudlark/src/vnode.rs:203:9:
add_child: already a 3-node

---- tests::decay::decay_amplification_above_one stdout ----

thread 'tests::decay::decay_amplification_above_one' (2763645) panicked at packages/mudlark/src/vnode.rs:203:9:
add_child: already a 3-node

---- tests::decay::decay_energy_conservation_selective stdout ----

thread 'tests::decay::decay_energy_conservation_selective' (2763647) panicked at packages/mudlark/src/vnode.rs:203:9:
add_child: already a 3-node

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 219 passed; 127 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
