*** packages/mudlark/src/vnode.rs:143:18: replace == with != in PackedChildren<V>::is_empty

*** mutation diff:
--- packages/mudlark/src/vnode.rs
+++ replace == with != in PackedChildren<V>::is_empty
@@ -135,17 +135,17 @@
         self.len as usize
     }
 
     /// Returns `true` if there are no children. (Always false for a valid node.)
     #[must_use]
     #[inline]
     #[allow(dead_code)]
     pub const fn is_empty(&self) -> bool {
-        self.len == 0
+        self.len != /* ~ changed by cargo-mutants ~ */ 0
     }
 
     /// Get the `(id, intensity)` pair at `index`.
     ///
     /// # Panics
     ///
     /// Panics if `index >= self.len()`.
     #[must_use]

---- tests::vnode::default_packed_children_is_empty stdout ----

thread 'tests::vnode::default_packed_children_is_empty' (2763594) panicked at packages/mudlark/src/tests/vnode.rs:116:5:
assertion failed: pc.is_empty()

failures:
    tests::vnode::default_packed_children_is_empty

test result: FAILED. 345 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
