*** packages/mudlark/src/vnode.rs:163:9: replace PackedChildren<V>::iter -> impl Iterator<Item =(VNodeId, V)>+'_ with ::std::iter::empty()

*** mutation diff:
--- packages/mudlark/src/vnode.rs
+++ replace PackedChildren<V>::iter -> impl Iterator<Item =(VNodeId, V)>+'_ with ::std::iter::empty()
@@ -155,17 +155,17 @@
         (
             self.ids[index].expect("child ID should be Some within len"),
             self.intensities[index],
         )
     }
 
     /// Iterate over `(id, intensity)` pairs.
     pub fn iter(&self) -> impl Iterator<Item = (VNodeId, V)> + '_ {
-        (0..self.len()).map(|i| self.get(i))
+        ::std::iter::empty() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Index of the child with the highest intensity.
     /// Ties broken by leftmost (index 0) wins.
     #[must_use]
     pub fn heaviest_child_index(&self) -> usize {
         let mut max_idx = 0;
         for i in 1..self.len() {

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (2772006) panicked at packages/mudlark/src/rebalance.rs:1445:9:
rebalance finished with residual violations: [VNodeId(10)]

---- tests::decay::decay_amplification_above_one stdout ----

thread 'tests::decay::decay_amplification_above_one' (2772005) panicked at packages/mudlark/src/rebalance.rs:1445:9:
rebalance finished with residual violations: [VNodeId(10)]

---- tests::decay::decay_energy_conservation_selective stdout ----

thread 'tests::decay::decay_energy_conservation_selective' (2772007) panicked at packages/mudlark/src/rebalance.rs:1445:9:
rebalance finished with residual violations: [VNodeId(10)]

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 293 passed; 53 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
