*** packages/mudlark/src/vnode.rs:170:9: replace PackedChildren<V>::heaviest_child_index -> usize with 0

*** mutation diff:
--- packages/mudlark/src/vnode.rs
+++ replace PackedChildren<V>::heaviest_child_index -> usize with 0
@@ -162,24 +162,17 @@
     pub fn iter(&self) -> impl Iterator<Item = (VNodeId, V)> + '_ {
         (0..self.len()).map(|i| self.get(i))
     }
 
     /// Index of the child with the highest intensity.
     /// Ties broken by leftmost (index 0) wins.
     #[must_use]
     pub fn heaviest_child_index(&self) -> usize {
-        let mut max_idx = 0;
-        for i in 1..self.len() {
-            // Strict greater-than: leftmost wins ties.
-            if self.intensities[i] > self.intensities[max_idx] {
-                max_idx = i;
-            }
-        }
-        max_idx
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Find the position of `id` in this node's children.
     #[must_use]
     pub fn find_index(&self, id: VNodeId) -> Option<usize> {
         (0..self.len()).find(|&i| self.ids[i] == Some(id))
     }

---- tests::vnode::packed_children_new_3 stdout ----

thread 'tests::vnode::packed_children_new_3' (2775512) panicked at packages/mudlark/src/tests/vnode.rs:60:5:
assertion `left == right` failed
  left: 0
 right: 1

---- tests::vnode::packed_children_new_2 stdout ----

thread 'tests::vnode::packed_children_new_2' (2775511) panicked at packages/mudlark/src/tests/vnode.rs:49:5:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    tests::vnode::packed_children_new_2
    tests::vnode::packed_children_new_3

test result: FAILED. 344 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
