*** packages/mudlark/src/vnode.rs:170:9: replace PackedChildren<V>::heaviest_child_index -> usize with 1

*** mutation diff:
--- packages/mudlark/src/vnode.rs
+++ replace PackedChildren<V>::heaviest_child_index -> usize with 1
@@ -162,24 +162,17 @@
     pub fn iter(&self) -> impl Iterator<Item = (VNodeId, V)> + '_ {
         (0..self.len()).map(|i| self.get(i))
     }
 
     /// Index of the child with the highest intensity.
     /// Ties broken by leftmost (index 0) wins.
     #[must_use]
     pub fn heaviest_child_index(&self) -> usize {
-        let mut max_idx = 0;
-        for i in 1..self.len() {
-            // Strict greater-than: leftmost wins ties.
-            if self.intensities[i] > self.intensities[max_idx] {
-                max_idx = i;
-            }
-        }
-        max_idx
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Find the position of `id` in this node's children.
     #[must_use]
     pub fn find_index(&self, id: VNodeId) -> Option<usize> {
         (0..self.len()).find(|&i| self.ids[i] == Some(id))
     }

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (2775859) panicked at packages/mudlark/src/rebalance.rs:1381:13:
rebalance: exceeded 10000 iterations (queue=20000, node=v1, resolved=10000)

---- tests::decay::decay_amplification_above_one stdout ----

thread 'tests::decay::decay_amplification_above_one' (2775854) panicked at packages/mudlark/src/rebalance.rs:1381:13:
rebalance: exceeded 10000 iterations (queue=20000, node=v1, resolved=10000)

---- tests::decay::decay_panics_q_above_one stdout ----

thread 'tests::decay::decay_panics_q_above_one' (2775873) panicked at packages/mudlark/src/rebalance.rs:1381:13:
rebalance: exceeded 10000 iterations (queue=20000, node=v1, resolved=10000)
note: panic did not contain expected string
      panic message: "rebalance: exceeded 10000 iterations (queue=20000, node=v1, resolved=10000)"
 expected substring: "q must be in"

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 273 passed; 73 failed; 0 ignored; 0 measured; 0 filtered out; finished in 4.26s

*** result: Failure(101)
