*** packages/mudlark/src/vnode.rs:173:36: replace > with < in PackedChildren<V>::heaviest_child_index

*** mutation diff:
--- packages/mudlark/src/vnode.rs
+++ replace > with < in PackedChildren<V>::heaviest_child_index
@@ -165,17 +165,17 @@
 
     /// Index of the child with the highest intensity.
     /// Ties broken by leftmost (index 0) wins.
     #[must_use]
     pub fn heaviest_child_index(&self) -> usize {
         let mut max_idx = 0;
         for i in 1..self.len() {
             // Strict greater-than: leftmost wins ties.
-            if self.intensities[i] > self.intensities[max_idx] {
+            if self.intensities[i] < /* ~ changed by cargo-mutants ~ */ self.intensities[max_idx] {
                 max_idx = i;
             }
         }
         max_idx
     }
 
     /// Find the position of `id` in this node's children.
     #[must_use]

---- tests::decay::decay_amplification_above_one stdout ----

thread 'tests::decay::decay_amplification_above_one' (2784707) panicked at packages/mudlark/src/rebalance.rs:1381:13:
rebalance: exceeded 10000 iterations (queue=40001, node=v6, resolved=10000)

---- tests::decay::decay_energy_conservation_selective stdout ----

thread 'tests::decay::decay_energy_conservation_selective' (2784709) panicked at packages/mudlark/src/rebalance.rs:1381:13:
rebalance: exceeded 10000 iterations (queue=40001, node=v6, resolved=10000)

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (2784708) panicked at packages/mudlark/src/rebalance.rs:1381:13:
rebalance: exceeded 10000 iterations (queue=40001, node=v6, resolved=10000)

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 267 passed; 79 failed; 0 ignored; 0 measured; 0 filtered out; finished in 4.70s

*** result: Failure(101)
