*** packages/mudlark/src/vnode.rs:173:36: replace > with >= in PackedChildren<V>::heaviest_child_index

*** mutation diff:
--- packages/mudlark/src/vnode.rs
+++ replace > with >= in PackedChildren<V>::heaviest_child_index
@@ -165,17 +165,17 @@
 
     /// Index of the child with the highest intensity.
     /// Ties broken by leftmost (index 0) wins.
     #[must_use]
     pub fn heaviest_child_index(&self) -> usize {
         let mut max_idx = 0;
         for i in 1..self.len() {
             // Strict greater-than: leftmost wins ties.
-            if self.intensities[i] > self.intensities[max_idx] {
+            if self.intensities[i] >= /* ~ changed by cargo-mutants ~ */ self.intensities[max_idx] {
                 max_idx = i;
             }
         }
         max_idx
     }
 
     /// Find the position of `id` in this node's children.
     #[must_use]

---- tests::vnode::lightest_tiebreak_leftmost stdout ----

thread 'tests::vnode::lightest_tiebreak_leftmost' (2785489) panicked at packages/mudlark/src/tests/vnode.rs:99:5:
assertion `left == right` failed
  left: 2
 right: 0

failures:
    tests::vnode::lightest_tiebreak_leftmost

test result: FAILED. 345 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
