*** packages/mudlark/src/vnode.rs:183:47: replace == with != in PackedChildren<V>::find_index

*** mutation diff:
--- packages/mudlark/src/vnode.rs
+++ replace == with != in PackedChildren<V>::find_index
@@ -175,17 +175,17 @@
             }
         }
         max_idx
     }
 
     /// Find the position of `id` in this node's children.
     #[must_use]
     pub fn find_index(&self, id: VNodeId) -> Option<usize> {
-        (0..self.len()).find(|&i| self.ids[i] == Some(id))
+        (0..self.len()).find(|&i| self.ids[i] != /* ~ changed by cargo-mutants ~ */ Some(id))
     }
 
     /// Replace one child with another.
     ///
     /// # Panics
     ///
     /// Panics if `old` is not found among the children.
     pub fn replace_child(&mut self, old: VNodeId, new: VNodeId, new_intensity: V) {

---- tests::decay::decay_amplification_above_one stdout ----

thread 'tests::decay::decay_amplification_above_one' (2788023) panicked at packages/mudlark/src/rebalance.rs:1445:9:
rebalance finished with residual violations: [VNodeId(2)]

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (2788024) panicked at packages/mudlark/src/rebalance.rs:1445:9:
rebalance finished with residual violations: [VNodeId(2)]

---- tests::decay::decay_energy_conservation_uniform stdout ----

thread 'tests::decay::decay_energy_conservation_uniform' (2788026) panicked at packages/mudlark/src/rebalance.rs:1445:9:
rebalance finished with residual violations: [VNodeId(2)]

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 264 passed; 82 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
