*** packages/mudlark/src/vnode.rs:221:16: replace < with == in PackedChildren<V>::remove_child

*** mutation diff:
--- packages/mudlark/src/vnode.rs
+++ replace < with == in PackedChildren<V>::remove_child
@@ -213,17 +213,17 @@
     ///
     /// Panics if not a 3-node or if `id` is not found.
     pub fn remove_child(&mut self, id: VNodeId) -> (VNodeId, V) {
         assert!(self.len == 3, "remove_child: not a 3-node");
         let idx = self.find_index(id).expect("remove_child: id not found");
         let removed = self.get(idx);
 
         // Shift the last child into the removed slot if needed.
-        if idx < 2 {
+        if idx == /* ~ changed by cargo-mutants ~ */ 2 {
             self.ids[idx] = self.ids[2];
             self.intensities[idx] = self.intensities[2];
         }
         self.ids[2] = None;
         self.intensities[2] = V::default();
         self.len = 2;
         removed
     }

---- tests::graph::check_evictions_trailing_rebalance_clears_violations stdout ----

thread 'tests::graph::check_evictions_trailing_rebalance_clears_violations' (2792087) panicked at packages/mudlark/src/vnode.rs:192:40:
replace_child: old id not found

---- tests::graph::check_evictions_return_value_matches_count_delta stdout ----

thread 'tests::graph::check_evictions_return_value_matches_count_delta' (2792086) panicked at packages/mudlark/src/vnode.rs:192:40:
replace_child: old id not found

---- tests::graph::check_evictions_unbounded_evicts_all stdout ----

thread 'tests::graph::check_evictions_unbounded_evicts_all' (2792088) panicked at packages/mudlark/src/vnode.rs:192:40:
replace_child: old id not found

failures:
    tests::graph::check_evictions_return_value_matches_count_delta
    tests::graph::check_evictions_trailing_rebalance_clears_violations
    tests::graph::check_evictions_unbounded_evicts_all
    tests::graph::get_semi_internal_depth_is_trimmed_depth
    tests::graph::get_semi_internal_left_child_trims_right
    tests::graph::get_semi_internal_right_child_trims_left
    tests::structural::semi_internal_surviving_child_unaffected

test result: FAILED. 339 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
