*** packages/mudlark/src/vtree.rs:178:29: replace == with != in propagate_evictable_flags

*** mutation diff:
--- packages/mudlark/src/vtree.rs
+++ replace == with != in propagate_evictable_flags
@@ -170,17 +170,17 @@
         let node = vnodes.get(id.index());
         match &node.kind {
             VKind::Entry { .. } => {
                 current = node.parent;
             }
             VKind::Structural { children, has_evictable } => {
                 let old = *has_evictable;
                 let new_flag = compute_has_evictable(vnodes, children);
-                if new_flag == old {
+                if new_flag != /* ~ changed by cargo-mutants ~ */ old {
                     return; // No change — stop propagation.
                 }
                 // Must drop borrow before mutating.
                 let parent = node.parent;
                 set_has_evictable(vnodes, id, new_flag);
                 current = parent;
             }
         }

---- tests::observe::observe_invariants_hold_after_eviction_cycle stdout ----

thread 'tests::observe::observe_invariants_hold_after_eviction_cycle' (2807474) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
V-I7 violated at V-node 3: has_evictable=false, expected=true

---- tests::structural::semi_internal_surviving_child_unaffected stdout ----

thread 'tests::structural::semi_internal_surviving_child_unaffected' (2807608) panicked at packages/mudlark/src/invariants.rs:65:9:
Invariant violations (1 total):
V-I7 violated at V-node 11: has_evictable=true, expected=false

failures:
    tests::observe::observe_invariants_hold_after_eviction_cycle
    tests::structural::semi_internal_surviving_child_unaffected

test result: FAILED. 344 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
