*** packages/mudlark/src/vtree.rs:194:59: replace + with * in v_depth_uncached

*** mutation diff:
--- packages/mudlark/src/vtree.rs
+++ replace + with * in v_depth_uncached
@@ -186,17 +186,17 @@
         }
     }
 }
 
 /// Compute the true V-Tree depth without caching (for debug assertions).
 #[cfg(debug_assertions)]
 fn v_depth_uncached<V: Accumulator>(vnodes: &Arena<VNode<V>>, id: VNodeId) -> u32 {
     let node = vnodes.get(id.index());
-    node.parent.map_or(0, |p| v_depth_uncached(vnodes, p) + 1)
+    node.parent.map_or(0, |p| v_depth_uncached(vnodes, p) * /* ~ changed by cargo-mutants ~ */ 1)
 }
 
 /// Compute the V-Tree depth (number of parent hops) of node `id`.
 ///
 /// The V-root has depth 0. Used by the depth gate in `attempt_split`
 /// and eviction re-verification.
 ///
 /// Uses opportunistic caching with path warming (ADR-M-029):

---- tests::decay::decay_amplification_above_one stdout ----

thread 'tests::decay::decay_amplification_above_one' (2813883) panicked at packages/mudlark/src/vtree.rs:213:9:
assertion `left == right` failed: cached depth mismatch for VNode VNodeId(3)
  left: 2
 right: 0

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (2813884) panicked at packages/mudlark/src/vtree.rs:213:9:
assertion `left == right` failed: cached depth mismatch for VNode VNodeId(3)
  left: 2
 right: 0

---- tests::decay::decay_f64_tree stdout ----

thread 'tests::decay::decay_f64_tree' (2813887) panicked at packages/mudlark/src/vtree.rs:213:9:
assertion `left == right` failed: cached depth mismatch for VNode VNodeId(2)
  left: 2
 right: 0

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 263 passed; 83 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
