*** packages/mudlark/src/vtree.rs:211:15: replace != with == in v_depth

*** mutation diff:
--- packages/mudlark/src/vtree.rs
+++ replace != with == in v_depth
@@ -203,17 +203,17 @@
 /// - Fast path: return cached depth if valid
 /// - Slow path: recurse to parent, cache all nodes on path
 #[must_use]
 pub fn v_depth<V: Accumulator>(vnodes: &Arena<VNode<V>>, id: VNodeId) -> u32 {
     let node = vnodes.get(id.index());
     let cached = node.cached_depth.load(Ordering::Relaxed);
 
     // Fast path: cached and valid
-    if cached != DEPTH_STALE {
+    if cached == /* ~ changed by cargo-mutants ~ */ DEPTH_STALE {
         #[cfg(debug_assertions)]
         assert_eq!(cached, v_depth_uncached(vnodes, id), "cached depth mismatch for VNode {id:?}");
         return cached;
     }
 
     // Slow path: recurse to parent, cache on return
     let depth = node.parent.map_or(0, |p| v_depth(vnodes, p) + 1);
     node.cached_depth.store(depth, Ordering::Relaxed);

---- tests::decay::decay_multiple_uniform_preserves_invariants stdout ----

thread 'tests::decay::decay_multiple_uniform_preserves_invariants' (2819818) panicked at packages/mudlark/src/vtree.rs:213:9:
assertion `left == right` failed: cached depth mismatch for VNode VNodeId(10)
  left: 4294967295
 right: 3

---- tests::decay::decay_panics_nan_q stdout ----

thread 'tests::decay::decay_panics_nan_q' (2819821) panicked at packages/mudlark/src/vtree.rs:213:9:
assertion `left == right` failed: cached depth mismatch for VNode VNodeId(10)
  left: 4294967295
 right: 3
note: panic did not contain expected string
      panic message: "assertion `left == right` failed: cached depth mismatch for VNode VNodeId(10)\n  left: 4294967295\n right: 3"
 expected substring: "q must be in"

---- tests::decay::decay_panics_negative_attenuation stdout ----

thread 'tests::decay::decay_panics_negative_attenuation' (2819822) panicked at packages/mudlark/src/vtree.rs:213:9:
assertion `left == right` failed: cached depth mismatch for VNode VNodeId(10)
  left: 4294967295
 right: 3
note: panic did not contain expected string
      panic message: "assertion `left == right` failed: cached depth mismatch for VNode VNodeId(10)\n  left: 4294967295\n right: 3"
 expected substring: "attenuation must be > 0"

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 274 passed; 72 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
