*** packages/mudlark/src/vtree.rs:218:62: replace + with - in v_depth

*** mutation diff:
--- packages/mudlark/src/vtree.rs
+++ replace + with - in v_depth
@@ -210,17 +210,17 @@
     // Fast path: cached and valid
     if cached != DEPTH_STALE {
         #[cfg(debug_assertions)]
         assert_eq!(cached, v_depth_uncached(vnodes, id), "cached depth mismatch for VNode {id:?}");
         return cached;
     }
 
     // Slow path: recurse to parent, cache on return
-    let depth = node.parent.map_or(0, |p| v_depth(vnodes, p) + 1);
+    let depth = node.parent.map_or(0, |p| v_depth(vnodes, p) - /* ~ changed by cargo-mutants ~ */ 1);
     node.cached_depth.store(depth, Ordering::Relaxed);
     depth
 }
 
 /// Invalidate cached depth for a subtree rooted at `root`.
 ///
 /// Uses early-exit: if a node is already stale, its entire subtree
 /// must also be stale (ancestor invariant from ADR-M-029).

---- tests::decay::decay_amplification_above_one stdout ----

thread 'tests::decay::decay_amplification_above_one' (2821424) panicked at packages/mudlark/src/vtree.rs:218:43:
attempt to subtract with overflow

---- tests::decay::decay_energy_conservation_selective stdout ----

thread 'tests::decay::decay_energy_conservation_selective' (2821426) panicked at packages/mudlark/src/vtree.rs:218:43:
attempt to subtract with overflow

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (2821425) panicked at packages/mudlark/src/vtree.rs:218:43:
attempt to subtract with overflow

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 276 passed; 70 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
