*** packages/mudlark/src/vtree.rs:233:54: replace == with != in invalidate_depth_subtree

*** mutation diff:
--- packages/mudlark/src/vtree.rs
+++ replace == with != in invalidate_depth_subtree
@@ -225,17 +225,17 @@
 /// Uses early-exit: if a node is already stale, its entire subtree
 /// must also be stale (ancestor invariant from ADR-M-029).
 pub fn invalidate_depth_subtree<V: Accumulator>(vnodes: &Arena<VNode<V>>, root: VNodeId) {
     let mut stack = vec![root];
     while let Some(id) = stack.pop() {
         let node = vnodes.get(id.index());
 
         // Already stale → subtree also stale (invariant)
-        if node.cached_depth.load(Ordering::Relaxed) == DEPTH_STALE {
+        if node.cached_depth.load(Ordering::Relaxed) != /* ~ changed by cargo-mutants ~ */ DEPTH_STALE {
             continue;
         }
 
         node.cached_depth.store(DEPTH_STALE, Ordering::Relaxed);
 
         if let VKind::Structural { children, .. } = &node.kind {
             for i in 0..children.len() {
                 stack.push(children.get(i).0);

---- tests::decay::decay_amplification_above_one stdout ----

thread 'tests::decay::decay_amplification_above_one' (2824898) panicked at packages/mudlark/src/vtree.rs:213:9:
assertion `left == right` failed: cached depth mismatch for VNode VNodeId(14)
  left: 4
 right: 2

---- tests::decay::decay_composition_k_steps stdout ----

thread 'tests::decay::decay_composition_k_steps' (2824899) panicked at packages/mudlark/src/vtree.rs:213:9:
assertion `left == right` failed: cached depth mismatch for VNode VNodeId(14)
  left: 4
 right: 2

---- tests::decay::decay_energy_conservation_selective stdout ----

thread 'tests::decay::decay_energy_conservation_selective' (2824900) panicked at packages/mudlark/src/vtree.rs:213:9:
assertion `left == right` failed: cached depth mismatch for VNode VNodeId(14)
  left: 4
 right: 2

failures:
    tests::decay::decay_amplification_above_one
    tests::decay::decay_composition_k_steps
    tests::decay::decay_energy_conservation_selective
    tests::decay::decay_energy_conservation_uniform
    tests::decay::decay_f64_tree
    tests::decay::decay_multiple_selective_preserves_invariants
    tests::decay::decay_multiple_uniform_preserves_invariants
    tests::decay::decay_noop_at_attenuation_one
    tests::decay::decay_panics_nan_attenuation
    tests::decay::decay_panics_nan_q
    tests::decay::decay_panics_negative_attenuation
    tests::decay::decay_panics_negative_q

test result: FAILED. 288 passed; 58 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
