*** packages/mudlark/src/vtree.rs:297:19: replace != with == in sole_sibling

*** mutation diff:
--- packages/mudlark/src/vtree.rs
+++ replace != with == in sole_sibling
@@ -289,17 +289,17 @@
 }
 
 /// Get the sole sibling of `child` in a 2-node `parent`.
 fn sole_sibling<V: Accumulator>(vnodes: &Arena<VNode<V>>, parent: VNodeId, child: VNodeId) -> VNodeId {
     let p = vnodes.get(parent.index());
     if let VKind::Structural { children, .. } = &p.kind {
         for i in 0..children.len() {
             let (id, _) = children.get(i);
-            if id != child {
+            if id == /* ~ changed by cargo-mutants ~ */ child {
                 return id;
             }
         }
     }
     unreachable!("sole_sibling: child not found in parent");
 }
 
 /// Recompute a structural node's intensity from its children.

---- tests::diagnostic::evict_tip_creates_span stdout ----

thread 'tests::diagnostic::evict_tip_creates_span' (2825947) panicked at packages/mudlark/src/arena.rs:93:9:
Arena::get: slot 10 is not occupied

---- tests::evict::evict_after_observations_conserves_energy stdout ----

thread 'tests::evict::evict_after_observations_conserves_energy' (2825963) panicked at packages/mudlark/src/arena.rs:93:9:
Arena::get: slot 1 is not occupied

---- tests::diagnostic::eviction_pipeline_creates_spans stdout ----

thread 'tests::diagnostic::eviction_pipeline_creates_spans' (2825948) panicked at packages/mudlark/src/arena.rs:93:9:
Arena::get: slot 10 is not occupied

failures:
    tests::diagnostic::evict_tip_creates_span
    tests::diagnostic::eviction_pipeline_creates_spans
    tests::diagnostic::vtree_remove_leaf_creates_span
    tests::evict::evict_after_observations_conserves_energy
    tests::evict::evict_both_children_makes_parent_terminal
    tests::evict::evict_single_terminal_child
    tests::evict::evict_to_semi_internal_creates_thatch
    tests::evict::evict_to_terminal_destroys_thatch
    tests::graph::check_evictions_bounded_respects_limit
    tests::graph::check_evictions_return_value_matches_count_delta
    tests::graph::check_evictions_trailing_rebalance_clears_violations
    tests::graph::check_evictions_unbounded_evicts_all

test result: FAILED. 323 passed; 23 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
