*** packages/mudlark/src/vtree.rs:54:22: replace == with != in vtree_remove_leaf

*** mutation diff:
--- packages/mudlark/src/vtree.rs
+++ replace == with != in vtree_remove_leaf
@@ -46,17 +46,17 @@
     };
 
     let p = vnodes.get(p_id.index());
     let p_child_count = match &p.kind {
         VKind::Structural { children, .. } => children.len(),
         VKind::Entry { .. } => unreachable!("parent of entry should be structural"),
     };
 
-    if p_child_count == 3 {
+    if p_child_count != /* ~ changed by cargo-mutants ~ */ 3 {
         // 3-node → 2-node: just remove the child.
         span.record("case", "shrink");
         remove_child_from_structural(vnodes, p_id, v_id);
         propagate_v_sums_from(vnodes, p_id);
         propagate_evictable_flags(vnodes, p_id);
         vnodes.dealloc(v_id.index());
         return v_root;
     }

---- tests::diagnostic::eviction_pipeline_creates_spans stdout ----

thread 'tests::diagnostic::eviction_pipeline_creates_spans' (2800337) panicked at packages/mudlark/src/vnode.rs:216:9:
remove_child: not a 3-node

---- tests::diagnostic::vtree_remove_leaf_creates_span stdout ----

thread 'tests::diagnostic::vtree_remove_leaf_creates_span' (2800351) panicked at packages/mudlark/src/vnode.rs:216:9:
remove_child: not a 3-node

---- tests::evict::evict_after_observations_conserves_energy stdout ----

thread 'tests::evict::evict_after_observations_conserves_energy' (2800352) panicked at packages/mudlark/src/vnode.rs:216:9:
remove_child: not a 3-node

failures:
    tests::diagnostic::evict_tip_creates_span
    tests::diagnostic::eviction_pipeline_creates_spans
    tests::diagnostic::vtree_remove_leaf_creates_span
    tests::evict::evict_after_observations_conserves_energy
    tests::evict::evict_both_children_makes_parent_terminal
    tests::evict::evict_single_terminal_child
    tests::evict::evict_to_semi_internal_creates_thatch
    tests::evict::evict_to_terminal_destroys_thatch
    tests::graph::check_evictions_bounded_respects_limit
    tests::graph::check_evictions_return_value_matches_count_delta
    tests::graph::check_evictions_trailing_rebalance_clears_violations
    tests::graph::check_evictions_unbounded_evicts_all

test result: FAILED. 321 passed; 25 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
